{
  "无论如何，这件是不关你的事。": "In any case, it's none of your business.",
  "被闹钟唤醒没有被鸟唤醒的好。": "Much better to be woken by the birds than by an alarm.",
  "你固然是错了，但也不能怪你。": "On the one hand, you are wrong, but on the other hand, I can't blame you for that.",
  "万一我来晚的话，你不要等我。": "If by any chance I'm late, please don't wait for me.",
  "我爸爸不是每天都走路上班的。": "My father does not always walk to work.",
  "派对的准备工作就全交给你了。": "I will leave everything about the party up to you.",
  "在四位姑娘之中最美的是南希。": "Nancy is the most beautiful of the four girls.",
  "有的人是好的，有的人是坏的。": "Some people are good, some people are bad.",
  "咖啡师们该创造一个情景喜剧。": "Baristas need to make a sitcom.",
  "你们今天下午在学校做些什么？": "What are you doing at school this afternoon?",
  "我昨天买了一支像你那样的笔。": "I bought a pen like yours yesterday.",
  "他很聪明，但却不太帮得上忙。": "He may be clever, but he is not very helpful.",
  "那幅画是印象派的大师级作品。": "That painting is a masterpiece of impressionist art.",
  "他赢了冠军就自吹自擂了起来。": "He boasted of having won the first prize.",
  "谁也不工作。大家在看世界杯。": "No one is working. Everyone's watching the World Cup.",
  "这本杂志不要扔。我还没看呢。": "Don't throw away this magazine. I haven't read it yet.",
  "俄罗斯面临着严重的财政困难。": "Russia is facing great financial difficulties.",
  "阿图什的无花果是甜蜜多汁的。": "The figs of Atush are sweet and juicy.",
  "吉尔吉斯斯坦的情况十分混乱。": "The situation in Kyrgyzstan is a real mess.",
  "他走路去学校还是骑车去学校？": "Does he go to school on foot or by bicycle?",
  "哦，我不知道我是不是认同你。": "Oh, I don't know if I agree with you.",
  "请让我到火车站去接你的姐姐。": "Please let me pick up your sister at the station.",
  "明尼苏达州的官方鸟就是蚊子。": "Minnesota's state bird is the mosquito.",
  "我时间来不及啦，你快一点呀！": "I don't have enough time, hurry up!",
  "要等它踢完啊，有一点时间啦！": "We've got to wait for them to finish playing - there's still a while to go!",
  "你看这两件做工要比那些讲究。": "See how much more carefully made these are compared to those?",
  "先生小姐，你们买点什么首饰？": "Sir and Miss, what type of jewellery are you looking to buy?",
  "今天晚上你在什么地方有约会？": "Where's your date tonight?",
  "一斤四元五毛，便宜得不得了！": "4.5 yuan for one pound, now isn't that cheap!",
  "太棒了！是毛坯房还是装修房？": "Great! Is the apartment bought as a concrete shell, or is it ready to move into?",
  "小姐，今天晚上有没有空房间？": "Miss, are there any available rooms for tonight?",
  "明天中午叫他打给我一个电话。": "Tell him to call me tomorrow at noon.",
  "去上海新建的绿地玩也特有劲！": "Visiting one of Shanghai's recently developed parks and green spaces is also exciting!",
  "虽然时髦一点，但是价钱太大！": "It's kind of in vogue, but the price is too much!",
  "王兄，你现在在做什么生意了？": "Mr. Wang, what kind of business are you engaged in?",
  "不谈了！我们去周庄玩怎么样？": "No need to say anything more. How about we go to Zhouzhuang?",
  "请你们快点来一辆救护车，快！": "Please get here with the ambulance quickly. Hurry up!",
  "她打扮得妖里妖气，一副傻样！": "She dresses so outrageously; it looks completely ridiculous!",
  "胸口有点儿疼，所以吃不下饭。": "My chest hurts a bit, so I am not going to eat.",
  "下班时间还没，大家就想溜走。": "It still isn't time to leave work, and everyone wants to escape.",
  "我好不容易找到了你们的房子。": "I found your house with difficulty.",
  "我今天想外出，不想留在家中。": "I feel like going out rather than staying at home today.",
  "我第一次见他是三年前的事了。": "I first met him three years ago.",
  "我觉得自己像是不请自来似的。": "I felt as if I were an uninvited guest.",
  "给我看看你在巴黎拍的照片吧。": "Let me see the pictures you took in Paris.",
  "他们的友情深深地感动了我们。": "Their friendship moved us deeply.",
  "我们有一只猫。我们都喜欢猫。": "We have a cat. We are all fond of it.",
  "那商店里的商品全都打九折呢。": "Everything at that store is 10 percent off the regular price.",
  "我当时每个月都会购买五本书。": "I bought five books a month.",
  "我们的饭店在汽车南站的附近。": "Our restaurant is near the southern bus station.",
  "您说得对。这里的面汤比较贵。": "You're right. The noodle broth here is a bit expensive.",
  "这座火山在这年内爆发了两次。": "The volcano has erupted twice this year.",
  "他因为太疲劳而无法继续前进。": "He was too tired to go any further.",
  "2001年时21世纪的开始。": "2001 is the year when the 21st century begins.",
  "好像我做电灯泡了。我该走了。": "Seems like I'm the third wheel here. I should go.",
  "事情比我们最初想象的更严重。": "It was much worse than we initially thought.",
  "出拳就是出拳。出脚就是出脚。": "A punch is just a punch. A kick is just a kick.",
  "我和老干妈有爱恨交加的关系。": "Lao Gan Ma and I have a love-hate relationship.",
  "我父亲很穷并不让我觉得丢脸。": "I'm not ashamed of my father being poor.",
  "他为他的迟到制造了一个借口。": "He invented an excuse for being late.",
  "我回来了！啊？我们有客人啊？": "I'm back! Oh? Have we got a guest?",
  "生活是一条很长、很长的道路。": "Life is a long, long road.",
  "爸爸死后，他就开始照顾妈妈。": "He cared for his mother after his father died.",
  "我把这本书从头到尾读了一遍。": "I read the book from beginning to end.",
  "即使他道歉了，我还是很愤怒。": "Even though he apologized, I'm still furious.",
  "两个男孩子从房间里跑出来了。": "Two boys came running out of the room.",
  "人类适应环境变化的能力很强。": "Man has a great capacity to adapt to environmental changes.",
  "敌方投下炸弹，把工厂炸毁了。": "The enemy dropped bombs on the factory.",
  "我从来没有相信过战争是好的。": "I have never believed that war is good.",
  "能否请您给我看一下您的护照？": "Will you show me your passport, please?",
  "当我听到这个消息时，我想哭。": "When I heard the news, I wanted to cry.",
  "她刚结束，就躺下打了个盹儿。": "As soon as she finished, she lay down and had a nap.",
  "说实话，他没有任何音乐天分。": "To be honest, he doesn't have any musical talent.",
  "他很难掩饰对自己成功的骄傲。": "It was difficult for him to hide his pride in his success.",
  "这儿是他们通常吃宵夜的地方。": "This is where they usually eat supper.",
  "这儿是他们通常吃晚饭的地方。": "Here's where they usually have dinner.",
  "魅力冲击视觉，美德征服心灵。": "Charms strike the sight, but merit wins the soul.",
  "现在我将把我的父母介绍给你。": "Now I will introduce you to my parents.",
  "我从没见过一条那么大的鲸鱼。": "I never saw so big a whale.",
  "胜利是用许多人的性命换来的。": "The victory was won at the cost of many lives.",
  "我该怎么做才能让你更注意我？": "What have I got to do so that you'll pay attention to me?",
  "这个问题不能以常规方法解决。": "You cannot solve this problem with the usual method.",
  "巴黎是世界上最大的城市之一。": "Paris is one of the largest cities in the world.",
  "那时候一杯咖啡要200日元。": "In those days, a cup of coffee cost 200 yen.",
  "您没必要准备一个正式的演讲。": "There's no need for you to prepare a formal speech.",
  "她的男朋友送了一份礼物给她。": "She got a present from her boyfriend.",
  "玛丽对她自己的美感到很自豪。": "Mary was proud of her beauty.",
  "强盗似乎是在上层破窗而入的。": "It seems that the burglar broke in through an upstairs window.",
  "这场革命已经带来了很多改变。": "The revolution has brought about many changes.",
  "问题是 我没什么要跟他说的。": "The problem was that I had nothing to say to him.",
  "最先登上珠穆朗玛峰的人是谁？": "Who first reached the summit of Mt. Everest?",
  "她年轻的时候住在东京的郊区。": "She lived in the suburbs of Tokyo when she was young.",
  "我总是想有兄弟姐妹会怎么样。": "I've always wondered what it'd be like to have siblings.",
  "他一周的收入不超过50美元。": "He earns not more than 50 dollars a week.",
  "所有意见是真相和错误的综合。": "Every opinion is a mixture of truth and mistakes.",
  "我改了一下我网站的版面设计。": "I've changed my website's layout.",
  "只有早上5点，但天已经亮了。": "It's just five in the morning, but nevertheless it is light out.",
  "什么。。。？你还是不会开车？": "What... you still don't know how to drive?",
  "有了我，我们已经多一个人了。": "And with me, we are yet one more.",
  "我在桌面上建了一个快捷方式。": "I created a shortcut on the desktop.",
  "彩虹是自然界最美的现象之一。": "A rainbow is one of the most beautiful phenomena of nature.",
  "这篇英语作文离完美还差得远。": "This English essay is far from perfect.",
  "耐心对一个教师来说是必需的。": "Patience is essential for a teacher.",
  "我从没遇到过那么好心的男人。": "I've never met such a kind man.",
  "收到此邮件后请尽快给我答复。": "Please send me a reply as soon as you receive this mail.",
  "你半透明的裙子让我高度兴奋。": "I am completely agog over your diaphanous dress.",
  "我们给他看了一些伦敦的照片。": "We showed him some pictures of London.",
  "她的裙子是用粗糙的羊毛造的。": "Her dress was made of coarse wool.",
  "不含香料、防腐剂及人造色素。": "No artificial colours, preservatives or flavours.",
  "湖水在耀眼的阳光下闪闪发亮。": "The lake was gleaming in the bright sunshine.",
  "我不在意在六点钟起床这件事。": "I don't mind getting up at six.",
  "­很多人学日语是为了看漫画。": "Many people study Japanese so they can read manga.",
  "宝宝连走都不会，更何况是跑。": "The baby can't walk, much less run.",
  "狂风暴雨造成她无法准时抵达。": "The storm prevented her from arriving on time.",
  "我一定是把它遗留在巴士上了。": "I must have left it on the bus.",
  "他的去世让他的太太大受打击。": "His death was great shock to his wife.",
  "空气污染将会威胁我们的生存。": "Air pollution will be a threat to our survival.",
  "他们的友情酝酿成爱情的果实。": "Their friendship ripened into a deep love.",
  "她弯低身子，把钱币捡了起来。": "She bent down and picked up the coin.",
  "你要戴上头盔来保护你的头部。": "You have to wear a helmet to protect your head.",
  "这是一个具有历史价值的城市。": "This is a city of real historical value.",
  "当我离开家的时候天空很明朗。": "The sky was clear when I left home.",
  "我们在市场上买了些蔬菜和鱼。": "We bought some vegetables and fish at the market.",
  "伦敦是世界上最大的城市之一。": "London is among the largest cities in the world.",
  "在中国十一月十一号是光棍节。": "In China, the 11th of November is Singles Day.",
  "阿拉伯语是一种很重要的语言。": "Arabic is a very important language.",
  "我回答您之前要好好考虑一下。": "I will need to think for a while before I answer you.",
  "护士用温度计量了量他的体温。": "The nurse took his temperature with a thermometer.",
  "光一秒钟能够环绕地球七圈半。": "Light travels around the earth seven and a half times a second.",
  "法兰克用暗号留下了一则讯息。": "Frank left a message by means of a secret code.",
  "与其向命运妥协，我宁可自杀。": "I would rather kill myself than reconcile myself to my fate.",
  "有些人认为阅读简直浪费时间。": "Some people think of reading as a waste of time.",
  "不管哪几本，就选择三本书吧。": "It doesn't matter which, just pick three books.",
  "放开我，你正在掐着我的脖子。": "Let me go, you're choking me.",
  "他没帮助我的话，我就失败了。": "If it had not been for his help, I would have failed.",
  "他们把他视为城里最好的医生。": "They regarded him as the best doctor in town.",
  "你的姐姐游泳得不好，是不是？": "Your sister cannot swim well, can she?",
  "看到了吧？你应该学一门外语。": "You see? You must study a foreign language.",
  "她慢慢地重复了一遍她的名字。": "She repeated her name slowly.",
  "我们吃北京烤鸭在中国餐厅了。": "We ate Peking duck in the Chinese restaurant.",
  "你越是吃巧克力，越是会变胖。": "The more chocolate you eat, the fatter you'll get.",
  "他解释了这个计划的主要目标。": "He explained the plan's main objective.",
  "她很想知道那束花是谁寄来的。": "She is curious to find who sent the flowers.",
  "我在街上听到有人叫我的名字。": "I heard my name called by someone on the street.",
  "每一位选手都有义务遵守规则。": "Every player is under obligation to keep the rules.",
  "看来他的失败和他的性格有关。": "His failure seems to have something to do with his character.",
  "我们几乎不抱他还活着的希望。": "There is little, if any, hope of his being alive.",
  "他有些在日本不能找到的外书。": "He has some foreign books that cannot be found in Japan.",
  "不要把奥地利和澳大利亚混淆。": "Don't confuse Austria with Australia.",
  "我生病了，我在家待了一整天。": "Being ill, I stayed at home all day long.",
  "我有钱的话，我就买这台电脑。": "If I had money, I'd buy this computer.",
  "日本女性平均在二十五岁结婚。": "Japanese women get married at 25 on average.",
  "那个年经人住在一座老房子里。": "The young man lives in an old house.",
  "他们看到我就突然停止了说话。": "Seeing me, they suddenly stopped talking.",
  "两组在比赛中的表现都不太好。": "Neither team played well in the game.",
  "他的爸爸和妈妈都不在人世了。": "Both his father and mother are dead.",
  "她呢就是喜欢打破沙锅问到底。": "She especially likes to pursue questions till the very end.",
  "语言是人类最重要的发明之一。": "Language is one of man's most important inventions.",
  "我的儿子从盒子里拿了一粒糖。": "My son took a candy from the box.",
  "我今天一个问题都不会再问了。": "Today, I again didn't get to ask a single question",
  "这个夏天，我去苏格兰度假了。": "This summer I went on vacation in Scotland.",
  "抱歉，我没能早点回复你的信。": "Sorry I haven't replied to your letter earlier.",
  "中国的人口已经超过了十三亿。": "The population of China has already exceeded 1.3 billion.",
  "你开着电视怎么能安心学习呢？": "With the T.V. on, how can you keep your mind on your studies?",
  "我常常在晚上跟朋友出去玩儿。": "I often go out with friends in the evening.",
  "我进屋的时候，他们都鼓掌了。": "As I entered the room, they applauded.",
  "无色的绿色的观念疯狂地睡觉。": "Colorless green ideas sleep furiously.",
  "我发现一家很好的墨西哥餐厅。": "I found a good Mexican restaurant.",
  "他刷新了百米短跑的世界纪录。": "His record is a new world record in the 100-meter dash.",
  "你愚蠢地行事，你会付出代价。": "You've acted foolishly and you will pay for it.",
  "这盏灯发出了一个强大的光束。": "This lamp sends out a powerful beam.",
  "女人为什么想被男人抱着睡觉？": "Why do women want to sleep in a man's embrace?",
  "我的叔叔在这个办公室里工作。": "My uncle works in this office.",
  "现在才6点半，怎么会堵车呢？": "How can there be a traffic jam now, as late as 6 o'clock?",
  "你看都出血了，我扶你起来吧。": "You're bleeding everywhere; I'll help you up.",
  "我在一九七二年十月十日出生。": "I was born on October 10th, 1972.",
  "谁也不能阻止这个计划的实行。": "Nobody can prevent this plan from being carried out.",
  "人人需要学习的不仅仅是语言。": "What one has to learn is more than the language.",
  "你愿意给我看看你买了什么吗？": "Will you show me what you bought?",
  "这个组织跟任何政党没有联系。": "The organization is not connected with any political parties.",
  "许多家庭主妇抱怨物价非常高。": "A lot of housewives complain about the high prices of goods.",
  "我以感情为生活里最重要的事。": "I consider relationships to be the most important thing in life.",
  "我想要参加十一月一日的派对。": "I want to attend the party on November 1st.",
  "我们最近十年经历了很多变化。": "We have experienced many changes over the last decade.",
  "除了雨之外，我们体验了强风。": "Besides the rain, we experienced heavy winds.",
  "中国诗歌以李白的诗最为有名。": "Li Bai's work is the most famous of Chinese poetry.",
  "他把杯子举到嘴边，一饮而尽。": "He raised the glass to his lips and drained it at one gulp.",
  "饺子是年夜饭桌上必不可少的。": "Dumplings are essential at the New Year's Eve dinner table.",
  "有棵树倒了下来，把路堵住了。": "A fallen tree obstructed the road.",
  "有很多科学家住在这个小村里。": "Many scientists live in this small village.",
  "今年冬天我们这里雪下得不多。": "We have had little snow this winter.",
  "你给我的资料没有多大的用处。": "The information you gave me is of little use.",
  "一些世界上最蓝的水在火山湖。": "Some of the bluest water in the world is found in Crater Lake.",
  "第二天早上，我们都觉得很困。": "We were very sleepy the next morning.",
  "人们认为他是一名伟大的学者。": "People thought him to be a great scholar.",
  "如果今晚下雨, 我就不出去。": "If it rains tonight, I am not going to go out.",
  "幸运的是我的伤口消失得很快。": "Fortunately, my wound is clearing up quickly.",
  "那么，这代表更健康的城市吗？": "So, will this mean healthier cities?",
  "鲨鱼对电子信号和噪音很敏感。": "Sharks are sensitive to electrical impulses as well as sound.",
  "夏威夷是一个大众化旅游圣地。": "Hawaii is a popular tourist resort.",
  "对不起, 你要联络的人没空。": "We are sorry, the person you are trying to contact is not available.",
  "我的评论引起了小组内的争论。": "My comment sparked off an argument in the group.",
  "你的铅笔差点戳到我的眼睛了。": "You nearly poked me in the eye with your pencil.",
  "你最好立刻去看你的家庭医生。": "You'd better go to see your family doctor at once.",
  "喂，小鬼！这里是我们的地盘！": "Hey, twirp! This here is our territory!",
  "他的薪水包括基本工资和提成。": "His remuneration consists of a base salary plus commissions.",
  "我是被外面的交通噪音唤醒的。": "I was woken up by the noise of the traffic outside.",
  "就好像那证明了英语是正确的。": "Just as if that was proof that that English was correct.",
  "在他倒下前我抓住了他的手臂。": "I caught him by the arm before he could fall.",
  "从骏河湾看, 富士山很美丽。": "Mt. Fuji as seen from Suruga Bay is beautiful.",
  "他去世的消息在世界各地播出。": "His death was broadcast all over the world.",
  "大量生产降低许多商品的价格。": "Mass production reduced the price of many goods.",
  "如果你尝试的话，你会成功的。": "You'll succeed if you try.",
  "作为回报，我给了她一个娃娃。": "I gave her a doll in return.",
  "下周我们要去看望我们的老师。": "We will visit our teacher next week.",
  "你能把你的自行车借我两天吗？": "Could you lend me your bicycle for a couple of days?",
  "这味道可能是微波炉传出来的!": "This smell might come from the oven!",
  "送这束花的人可能是佐藤小姐。": "It might have been Miss Satoh who sent these flowers.",
  "乔治对自己的新工作充满热情。": "George is very enthusiastic about his new job.",
  "当他看见耶稣经过，他说...": "When he saw Jesus passing by, he said...",
  "尽管他很富有，他还是不满足。": "Despite his riches, he's not contented.",
  "你用了多少时间来翻译这本书？": "How long did it take you to translate this book?",
  "我遇上了阵雨被淋得全身湿透。": "I was caught in a shower and got drenched to the skin.",
  "工厂的面积是1000平方米。": "The area of the factory is 1,000 square meters.",
  "完成这个工作不会花太长时间。": "It won't take long to finish the job.",
  "水是液体。冻起来就成了固体。": "Water is liquid. When it freezes, it becomes solid.",
  "我不禁想我的儿子一直都在生。": "I cannot help thinking that my son is still alive.",
  "气压计下降了 - 要下雨了。": "The barometer is falling. It is going to rain.",
  "问题就是我忘记把车停在哪里。": "The trouble is that I can't remember where I parked the car.",
  "海啸席卷稻田, 淹没了城镇。": "Tsunamis swept through rice fields and flooded the towns.",
  "找蛋糕也没用，我已经吃完了。": "It is no use looking for the cake; I already ate it.",
  "伦敦是一个为马而建立的城市。": "London was a city built for the horse.",
  "我妹妹的英语有了明显的进步。": "My sister has made remarkable progress in English.",
  "阿里似乎对蚁类研究很感兴趣。": "It seems that Ali is very interested in Myrmecology.",
  "这个男人的名字我记得很清楚。": "Well do I remember the man's name.",
  "这些珍珠是真的，不是人造的。": "These pearls are genuine, not artificial.",
  "请快点把碎了的那个换掉好吗？": "Would you please replace the broken one promptly?",
  "我很抱歉, 但它是不可能的。": "I'm sorry, but it's impossible.",
  "如果你不想去, 就不必去了。": "If you don't want to go, you don't need to.",
  "冰冷的疾风吹到我骨子里去了。": "An icy blast of wind cut me to the bone.",
  "把灯打开。我什么都看不见了。": "Switch on the light. I can't see anything.",
  "你宁愿说谎也不愿让他生气吗？": "Would you rather lie than make him angry?",
  "我宁愿不睡觉也要看完这本书。": "I'd rather not sleep and finish reading this book.",
  "我看见一个老太太穿过了马路。": "I saw an old woman cross the street.",
  "我留着在街上发现的20美元。": "I kept the $20 I found in the street.",
  "因为一起事故，我上学迟到了。": "I was late for school on account of an accident.",
  "好像你们在这儿玩得不愉快啊。": "It seems that you are not having a good time here.",
  "光有胡子是不能成为哲学家的。": "The beard does not make the philosopher.",
  "最近频繁的地震让我们很焦虑。": "The recent frequency of earthquakes makes us nervous.",
  "拥有一切的人可能会失去一切。": "One who has everything can lose everything.",
  "我是个穷学生，我没法付你钱。": "I'm a poor student and I can't pay you.",
  "将融化了的奶油倒入爆米花中。": "Pour melted butter over the popcorn.",
  "只有一点点的知识是危险的事。": "A little knowledge is a dangerous thing.",
  "自助餐厅是一种自助式的餐厅。": "A cafeteria is a self-service style restaurant.",
  "苏格兰以其羊毛纺织品而著名。": "Scotland is famous for its woollen textiles.",
  "尽量避免制造任何更多的麻烦。": "Try to avoid making any more trouble.",
  "盐可以帮助保存食物避免腐烂。": "Salt helps to preserve food from decay.",
  "粗心大意可能导致严重的事故。": "Carelessness can lead to a serious accident.",
  "它不是一条路，而是一条小径。": "It's not a road, but a path.",
  "日本并不拥有丰富的自然资源。": "Japan is not rich in natural resources.",
  "我很抱歉，但我无法立即回答。": "I'm sorry, but I can't answer right away.",
  "我们觉得你独自登山非常危险。": "We think that it is dangerous to climb mountains alone.",
  "展览大大地吸引了公众的注意。": "The exhibition has drawn much attention from the public.",
  "生活中绝对没有什么是持久的。": "Absolutely nothing is permanent in life.",
  "苏格兰在9月可以变的很温暖。": "Scotland can be very warm in September.",
  "我既不是雅典人也不是希腊人。": "I'm neither an Athenian nor a Greek.",
  "我不必对汤姆所做的事负责任。": "I'm not responsible for what Tom did.",
  "你的履历给我留下深刻的印象。": "Your CV has really impressed me.",
  "我给他的儿子做了一套新西装。": "I made his son a new suit.",
  "帕克夫人面带微笑向他打招呼。": "Mrs. Parker greeted him with a smile.",
  "她在五点钟前做完了她的工作。": "She got through her work before five.",
  "她违背了她父亲的意愿结了婚。": "She got married against her father's will.",
  "我一面咬著指甲一面担心着你。": "I was biting my nails, worrying about you.",
  "爱和被爱是生活中最大的幸福。": "It is the greatest happiness in life to love and to be loved.",
  "吉姆得到了一份服务生的工作。": "Jim got a job as a waiter.",
  "法院判决了那个遗言是有效的。": "The court adjudged that the will was valid.",
  "她为自己孩子的行为感到羞耻。": "She was ashamed of her children's behavior.",
  "三月小姐给了我一本英语词典。": "Miss March gave me an English dictionary.",
  "也许我会马上放弃然后去睡一觉。": "I may give up soon and just nap instead.",
  "然而，相反的理论往往也是真的。": "And yet, the contrary is always true as well.",
  "在英国的时候，我经常看参考书。": "While in England I often consulted the guidebook.",
  "我找到那把我一直在找的钥匙了。": "I found the key for which I had been looking.",
  "十年后，我们的城市将改变许多。": "In ten years our town will change a lot.",
  "我无法想象另一个星球上的生物。": "I can't imagine what creatures living on another planet are like.",
  "他们粗心大意，还没意识到危险。": "They were carelessly unaware of the danger.",
  "对严格限制经济的批评蜂拥而来。": "Critics are coming down hard on tightened economic restrictions.",
  "你可以骑上我的摩托车去遛一圈。": "You can have a ride on my motorcycle.",
  "如果你需要笔的话，我借你一支。": "If you need a pen, I'll lend you one.",
  "他还没来。他肯定错过公交车了。": "He hasn't come yet. He must have missed the bus.",
  "他很年轻，更重要的是，他很帅。": "He is young and, what is more, handsome.",
  "我要预订一间6月3日的单人房。": "I'd like to reserve a single room on June 3.",
  "我做完我的功课后，就读这本书。": "I read the book after I had finished my homework.",
  "他和他的姐妹们目前都住在东京。": "His sisters as well as he are now living in Tokio.",
  "现在的人教育程度比以前高得多。": "People are more educated now than they used to be.",
  "接受对方的准则就是给予他权力。": "Accepting the other's norms is submitting to the other's power.",
  "这箱子是空的，里面什么也没有。": "This box is empty. It has nothing in it.",
  "我不知道她什么时候从法国回来。": "I don't know when he returned from France.",
  "问题是我们如何应付目前的困难。": "The problem is how we cope with the present difficulties.",
  "除了雨天，我都是骑车去上班的。": "I go to the office by bicycle except on rainy days.",
  "父亲常常在空闲时间读侦探小说。": "Father would often read detective stories in his spare time.",
  "有了坚定的目标，你会做得很好。": "With a firm goal in mind, you will do well.",
  "消防车到达之前，房子就全烧了。": "The house burned to the ground before the fire truck arrived.",
  "她迷路了，紧接着天开始下雨了。": "She lost her way and on top of that it began to rain.",
  "你成功与否取决于你自身的努力。": "Whether you succeed or not depends on your own efforts.",
  "我肯定你会喜欢我们今晚的菜肴。": "I'm sure you'll love what we have on the menu tonight.",
  "这场秀棒极了，但是门票太贵了。": "The show was wonderful, but the tickets were too expensive.",
  "我们整个夏天都和他们待在一起。": "We stayed with them all through the summer.",
  "你知道从火车站到市政府有多远？": "Do you know how far it is from the station to city hall?",
  "你知道音乐家什么时候来这儿吗？": "Do you know when the musician will come here?",
  "有些人喜欢运动，有些人不喜欢。": "Some people like sports. Others don't.",
  "我们觉得他的威胁只是一个玩笑。": "We thought his threat was only a joke.",
  "大学在20年前由他的父亲建立。": "The university was founded by his father twenty years ago.",
  "他说他没有进房间，那是骗人的。": "He said he did not enter the room, which was a lie.",
  "我现在在上班，所以晚点打给你。": "I'm at work now, so I'll call you later.",
  "死刑在美国的很多州都被废除了。": "The death penalty had been done away with in many states in the USA.",
  "你能用这台相机帮我们拍张照吗？": "Would you take a picture of us with this camera?",
  "我们估计能在两周内到那个地方。": "We calculated that we could reach the place within two weeks.",
  "我们走开的时候，房子被盗窃了。": "Our house was robbed while we were away.",
  "这显然是今年出版的最好的小说。": "This is by far the best novel that has been published this year.",
  "我们应该告诉孩子怎么保护自己。": "We should tell children how to protect themselves.",
  "在城市里行驶的车辆数量增加了。": "The number of cars driven in the city has increased.",
  "我在想哪个跑步运动员会跑第一。": "I wonder which of the runners will come first.",
  "我认识那个坐得最靠近门的男孩。": "I know the boy who is sitting closest to the door.",
  "你昨天看到的那个男人是我叔叔。": "The man you saw yesterday is my uncle.",
  "那就是那台他用来写文章的电脑。": "That's the computer he used to write the article.",
  "他为一份印刷量很大的报纸工作。": "He works for a newspaper with a large circulation.",
  "尤其是要注意你吃的和喝的东西。": "You have to pay special attention to what you eat and drink.",
  "一个有名的建筑师造了这个房子。": "A famous architect built this house.",
  "这是我所见过的最大型的构造了。": "This is the most massive structure I have ever seen.",
  "许多燕子不久就要从南方飞来了。": "Many swallows will come soon from the south.",
  "年轻的时候多看点好书是件好事。": "It's a good thing to read good books when you are young.",
  "他跟她说这样的话真是太残忍了。": "It is cruel of him to say such things to her.",
  "那是我每天在火车上看到的男人。": "That is the man I see every day on the train.",
  "在城市生活和在农村生活很不同。": "Living in the city is really different to living in the country.",
  "她对我来说是一个完全陌生的人。": "As far as I'm concerned, she's a complete stranger.",
  "那女孩的头发上绑了一根黄丝带。": "The girl wore a yellow ribbon in her hair.",
  "翻译几页英文花了我2个多小时。": "It took me more than two hours to translate a few pages of English.",
  "我们今晚出去吃饭，你说怎么样？": "What do you say to dining out tonight?",
  "我想和一个像她那样的女孩结婚。": "I want to marry a girl like her.",
  "很抱歉，我们不能接受你的要求。": "I'm very sorry, we can't accept your request.",
  "交通事故没有一天是不在发生的。": "Not a day passes without traffic accidents.",
  "我们的眼睛需要时间来适应黑暗。": "Our eyes take time to adjust to the darkness.",
  "耐心地坚持下去，这些事急不来。": "Be patient and persistent. These things take time.",
  "她把大部分钱都用在买裙子上了。": "She spends most of her money on her dresses.",
  "100万人在战争中失去了生命。": "One million people lost their lives in the war.",
  "你为什么不去？\"\"因为我不想去。": "Why aren't you going? \"\"Because I don't want to.\"\"",
  "他以优异的成绩毕业于剑桥大学。": "He graduated from Cambridge with honors.",
  "那不可能是玛丽，她现在在医院。": "That can't be Mary. She's in the hospital now.",
  "我老板把艰巨的任务指派给了我。": "My boss assigned the hard job to me.",
  "昨天，我收到一封用英语写的信。": "I received a letter written in English yesterday.",
  "你真的需要提问题来知道答案吗？": "Do you really need to ask the question to know the answer?",
  "是你该放弃你幼稚手段的时候了。": "It is time you left off your childish ways.",
  "年轻的时候你应该开拓你的思想。": "You should enrich your mind when young.",
  "我们在任何公司都应该是执行者。": "One must be an executive in some company.",
  "奥运会重要的是参与，不是获胜。": "The important thing about the Olympic Games is not to win, but to take part in them.",
  "我可以在茶和咖啡之间做个选择。": "I can choose between tea and coffee.",
  "别忘了一到伦敦就给我们留言啊。": "Be sure to drop us a line as soon as you get to London.",
  "他是个很安静的人，头顶有点秃。": "He's a quiet man, a little bald on top.",
  "他把他的那段话从磁带里删除了。": "He erased his speech from the tape.",
  "我深信事情会往更好的方向转变。": "I am convinced that things will change for the better.",
  "日本是世界高科技产业的领头人。": "Japan is the leader of the world's high-tech industry.",
  "救护车把伤者送往了最近的医院。": "The ambulances carried the injured to the nearest hospital.",
  "我今天无法给您一个最终的答复。": "I cannot give you a definite answer today.",
  "医生发现了一些令人吃惊的事实。": "Doctors have discovered some startling facts.",
  "我认为你考虑久了就会不一样了。": "I suppose it's different when you think about it over the long term.",
  "尽管受了伤，他们还是继续战斗。": "Though wounded, they continued to fight.",
  "我第一次来拜访你的时候迷路了。": "I got lost when I visited you for the first time.",
  "我本来很想走走，但是天太热了。": "I would like to take a walk, but the day is too hot.",
  "这首歌使我想起了我年轻的时候。": "This song makes me think of when I was young.",
  "美国人在2月14日庆祝情人节。": "On February 14 Americans celebrate St. Valentine's Day.",
  "很不幸，我没来得及听他的演讲。": "Unfortunately I was not in time for his speech.",
  "在全体职员回家后，火事爆发了。": "The fire broke out after the staff went home.",
  "这本教科书是用简单的英语写的。": "This textbook is written in simple English.",
  "50个申请人中有20个不合格。": "There were 20 failures among 50 applicants.",
  "这个工作需要不低于300美金。": "No less than three hundred dollars was needed for the work.",
  "他说他累了，所以他想早点回家。": "He said he was tired, so he would go home early.",
  "地球的表面约有三分之一是陆地。": "About one third of the earth's surface is land.",
  "我醒来，发现原来一切都是场梦。": "I awoke to find everything had been a dream.",
  "为什么这个月房东还不来收房租？": "Why hasn't the landlord come to collect rent this month?",
  "威斯特夫人正在忙碌地准备早餐。": "Mrs. West is busy getting breakfast ready.",
  "她合上双唇，并告诉自己不要哭。": "She pressed her lips together and willed herself not to cry.",
  "我得了胃肿瘤，必须动手术切除。": "I got a stomach tumor and had to have it operated on.",
  "小心不要弄醒了正在睡觉的婴儿。": "Take care not to awake the sleeping baby.",
  "他用尽了全力, 还是没有成功.": "With all his efforts, he couldn't succeed.",
  "数艘游艇在远方的海洋并列航行。": "Several yachts were sailing side by side far out at sea.",
  "这个国家的主要产品之一是咖啡。": "One of the main products of this country is coffee.",
  "我的三明治里有肉，奶酪和番茄。": "In my sandwich there is meat, cheese and tomatoes.",
  "会为你说谎的人，就会对你说谎。": "People who will lie for you, will lie to you.",
  "美国的每个城市都有一个图书馆。": "There is a library in every city in America.",
  "她凭著努力和生意头脑成了富翁。": "She became rich by virtue of hard work and good business sense.",
  "汤姆正考虑应聘薪酬更高的工作。": "Tom is thinking about applying for a better-paying job.",
  "我从没见过那么壮丽的日落景色。": "I never saw such a splendid sunset.",
  "地震过后，许多人都失去了家园。": "Many lost their homes after the earthquake.",
  "她开了窗，尽管我叫她别这么做。": "She opened the window, even though I told her not to.",
  "我有一点时间，但总是不多...": "I have some time, but never very much...",
  "他有一个妻子和两个孩子要养活。": "He has a wife and two young children to provide for.",
  "她的眼泪已经告诉了发生了什么。": "Her tears have already told me what has happened.",
  "应该做什么，我和他的见解不同。": "My view was different from his as to what should be done.",
  "我从小的梦想就是做一名糕点师。": "From childhood I dreamed of being a pastry cook.",
  "如果没有电，那我们生活会怎样?": "What would our lives be like without electricity?",
  "我不会讲英语，更不用说德语了。": "I cannot speak English, much less German.",
  "把收音机调大声点。我听不清楚。": "Turn up the radio. I can't hear it.",
  "10分钟后，他们换了个新话题。": "After ten minutes, they passed on to a new topic.",
  "我找到一个买水果很便宜的地方。": "I found out where to buy fruit cheaply.",
  "我要把我的玫瑰拿到花展上展示。": "I'm going to exhibit my roses at the flower show.",
  "我的物理老师不在乎我是否逃课。": "My physics teacher doesn't care if I skip classes.",
  "无论你怎么说，我也不会听你的。": "No matter how you say it, I'm not going to listen to you.",
  "玛丽把鸡蛋一颗一颗地取了出来。": "Mary took out the eggs one by one.",
  "严格地讲,这句话语法上有错误。": "Strictly speaking, this sentence is grammatically incorrect.",
  "我现在的收入比两年前多了一倍。": "Now my income is twice what it was two years ago.",
  "虽然我很同情他，但却帮不上忙。": "Much as I pitied him, I could not help him.",
  "他到了火车站，就叫了辆出租车。": "On his arrival at the station, he called a taxi.",
  "球弹呀弹呀的弹进了邻家的花园。": "The ball bounded away into our neighbor's garden.",
  "阿姨，您别客气，喝杯开水就行。": "No need to trouble yourself, Auntie. A glass of boiled water will be plenty.",
  "面包是用面粉、水和发酵粉做的。": "Bread is made from flour, water and yeast.",
  "事实上，价格每个星期都在攀升。": "As it is, prices are going up every week.",
  "谢谢你寄给我的一张漂亮的卡片。": "Thank you for sending me a nice card.",
  "我或者去看电影，或者去看歌剧。": "I am either going to see a film, or going to see an opera.",
  "我会告诉她开会的时候说些什么。": "I will tell her what to say at the meeting.",
  "他们往前走而我一直都在往后退。": "They are going forwards and I am always going backwards.",
  "她父母很漂亮，而她却长得一般。": "Her parents are very beautiful, but she looks ordinary.",
  "我做的每件事都要通过他的允许。": "Everything I do requires his permission.",
  "今天早上我因为太懒而没有出门。": "This morning, I was very lazy and didn't go out.",
  "我在两个半小时以前就吃了午饭。": "I ate lunch two and a half hours ago.",
  "京都和奈良都是历史悠久的古城。": "Nara is as old as Kyoto.",
  "大标题今天早上吸引了我的注意。": "The headline caught my eye this morning.",
  "巴士司机有责任保护乘客的安全。": "A bus driver is responsible for the safety of the passengers.",
  "吉姆很努力工作，但薪水却不高。": "Though Jim works very hard, his job does not pay very much.",
  "我跟你说过的那个女生住在这儿。": "The girl about whom I told you lives here.",
  "你知道这儿附近有什么好餐馆吗?": "Do you know of any good restaurant near here?",
  "这些绿叶到秋天变成红色或黄色。": "These green leaves turn red or yellow in fall.",
  "没有你的话，我的生命就毁灭了。": "Life's a ruin without you.",
  "我们昨天试了一下，果然是很好。": "We tried it out yesterday; as expected, it was really good.",
  "他脚受伤了，不能再继续踢足球。": "He hurt his foot, he can't play football anymore.",
  "在她生日那一天，她妈妈过世了。": "Her mother died on her birthday.",
  "社会保障吗？他们在说什么笑话？": "Social security? Who do they think they're kidding.",
  "他既不喜欢棒球，又不喜欢足球。": "He likes neither baseball nor football.",
  "关于这件事。。。我真的不知道。": "Concerning this matter... I really don’t know.",
  "她在街上看到我也不跟我打招呼。": "She ignored me even when she met me on the street.",
  "最危险的猎物是无路可走的那种。": "Cornered prey is the most dangerous kind.",
  "麻烦你把付了钱的人的名字删掉。": "Cross off the names of the people who have paid their dues.",
  "没有你帮忙，计划就不能成功了。": "Your help is indispensable for the success of the scheme.",
  "那个看着你的男人，你认识吗 ?": "That man who is looking at you, do you know him?",
  "通过医生的帮助，她战胜了疾病。": "With the help of doctor, she has beaten the illness.",
  "你能把最近的公车站指给我看吗?": "Can you tell me where the nearest bus stop is?",
  "很快人群就在他周围聚集了起来。": "A crowd soon gathered around him.",
  "根据天气预报，雨季下周会开始。": "According to the weather report, the rainy season will start next week.",
  "所有的客人都被她的好客感动了。": "All the guests were touched by her hospitality.",
  "连超级英雄们偶尔也该休息一下。": "Even superheroes need an occasional break.",
  "万一来不了，我会先给你打电话。": "In case I can't come, I'll give you a call beforehand.",
  "乘那辆巴士就可以到达动物园了。": "That bus will take you to the zoo.",
  "你们看，窗开着，厨房门也没关！": "Look guys, the window and even the kitchen door have both been left open!",
  "你闻闻香味，五香茶叶蛋香不香？": "You smell it. Do five spice tea eggs smell good?",
  "小区安全吗？夜晚有照明设施吗？": "Is this community safe? Are there lighting installations for the night?",
  "租的房屋要离我工作地方近一点。": "The rental should be somewhat close to where I work.",
  "从上海坐火车到郑州需几个小时？": "How long would a train from Shanghai to Zhengzhou take?",
  "请问最后一次开信箱在什么时间？": "Excuse me, when was the mailbox last opened?",
  "你到厨房里替我把一把锤子拿来。": "Could you get a hammer for me from the kitchen please?",
  "你认为可以胜任那些方面个工作？": "Do you think that you are qualified for that aspect of the work?",
  "当然会的，不过上海话不太会讲。": "Sure I can, although I can't really speak Shanghainese.",
  "不是瞎说，我这份工作真是没劲！": "Do not talk nonsense, My job is very boring!",
  "你这个人真是傻瓜一个，这么笨！": "You really are an idiot. You're so stupid!",
  "我虽然在虎口里，却是安如泰山。": "Though I may be in the jaws of death, I am as a firm as a rock.",
  "他的计划是在那条河上建一座桥。": "His plan is to build a bridge over that river.",
  "我以前星期天常常和他去打网球。": "I often used to play tennis with him on Sundays.",
  "从山顶上可以欣赏到秀丽的海景。": "You can get a fine view of the sea from the mountaintop.",
  "为什么你买了一本那么贵的词典？": "Why did you buy such an expensive dictionary?",
  "你的作文非常好，而且错误很少。": "Your composition is very good, and it has few mistakes.",
  "哦，能不能请你帮我听一下电话？": "Oh, could you please answer the phone for me?",
  "我们看了窗外，但什么都没看见。": "We looked out the window, but we didn't see anything.",
  "不知道别的星球上有没有生物呢？": "I wonder if life exists on other planets.",
  "丑闻让他付出了失去声誉的代价。": "That scandal cost him his reputation.",
  "记忆是我们大脑的一种主要功能。": "Memory is an essential function of our brain.",
  "如果他犯了罪，他应该受到惩罚。": "He must be fined if he breaks the law.",
  "我觉得一部电影比任何书都有趣。": "I think a film is more interesting than any book.",
  "男人是猎人而女人就是他的猎物。": "Man is the hunter, woman is his game.",
  "你不觉得这房里的冷气太强了吗？": "Don't you think the air conditioner is turned up too high in here?",
  "他突然过世的消息让我感到惊讶。": "I was surprised at the news of his sudden death.",
  "你对于现在的年轻人有什么看法？": "What do you think about young people today?",
  "总的来说，我对这个结果很满意。": "On the whole I am satisfied with the result.",
  "如果是这样的话，我们该做什么？": "If so, what should we do?",
  "我起了个大早为了赶第一班火车。": "I got up early enough to catch the first train.",
  "在家里，麦克的工作就是擦窗户。": "When Michael is at home, his work is to clean the windows.",
  "在中国有一种说法：人不可貌相。": "In China, there's a saying that you can't judge a person by appearance.",
  "我叔叔住在西班牙的首都马德里。": "My uncle lives in Madrid, the capital of Spain.",
  "计划受到舆论的压力而被取消了。": "The plan was given up under the pressure of public opinion.",
  "我听到了淡路发生大地震的消息。": "I heard the news that there had been a big earthquake in Awaji.",
  "我不弯膝也能把手掌平放在地上。": "I can place the palms of my hands on the floor without bending my knees.",
  "我把你的花瓶打破了，真对不起。": "I must apologize to you for breaking the vase.",
  "我迷路了，能不能请您帮我一下？": "I am lost. Can you help me, please?",
  "一颗一颗的星星在空中闪闪发光。": "Many stars are twinkling in the sky.",
  "我想下个月和一个朋友去北海道。": "I want to go with a friend to Hokkaido next month.",
  "我买了一支钢笔，但我把它丢了。": "I bought a pen, but I lost it.",
  "有什么你想要但是没有的东西吗？": "Is there anything you want that you don't have?",
  "我们都认为你的想法是行不通的。": "We all consider your idea to be impractical.",
  "你还有什么事情需要我去做的吗？": "Is there anything else you want me to do?",
  "我看书看得入神，听不到你叫我。": "I was absorbed in a book and didn't hear you call.",
  "他把朋友借给他的钱全都花光了。": "He had used up all the money which his friend had lent him.",
  "我的宝宝开始哭了，他想要吃奶。": "My baby began crying, asking for milk.",
  "印度是一个烹饪文化丰富的地区。": "India is a region rich in culinary culture.",
  "我用吸尘机把地上的灰尘吸掉了。": "I sucked up the dust on the floor with a vacuum cleaner.",
  "智子邀请了朋友来参加她的派对。": "Tomoko asked her friends to come to her party.",
  "所有的老师都无法解决这个问题。": "None of the teachers could solve the problem.",
  "她那双蓝鞋子和这个裙子很搭配。": "Her blue shoes go well with that dress.",
  "我不行了！我已经三天没睡过了！": "I can't take it anymore! I haven't slept for three days!",
  "如果你不能有孩子，你总能领养。": "If you can't have children, you could always adopt.",
  "这一天只是浪费时间，浪费金钱。": "This day was just a waste of time and money.",
  "趁还有太阳的时候，我该洗衣服。": "I have to do laundry while it's still sunny.",
  "暑假里，我半夜十二点才吃晚饭。": "During summer breaks, I ate dinner at midnight.",
  "他的父亲去世了，所以他很伤心。": "He felt sad because he lost his father.",
  "我感觉到自己的心在剧烈地跳动。": "I felt my heart beating violently.",
  "人类在月球上居住已不再是梦想。": "It is no longer a dream for man to live on the moon.",
  "微风在湖面上掀起了一丝丝涟漪。": "A gentle wind made ripples on the surface of the pond.",
  "高卡路里的食物对我的身体不好。": "High calorie foods are bad for my health.",
  "他因为生病了，所以不能来拜访。": "Because he was ill, he could not go to the party.",
  "在我的梦中，我梦到自己在做梦。": "In my dream I dreamt that I was dreaming.",
  "你什么时候回来？请你吃一顿饭。": "What time will you get back? I'll treat you to a meal.",
  "最重要的是你有没有尽全力去做。": "What matters is whether you do your best or not.",
  "什么意思，他竟然一直在欺骗我！": "I ask you, he's been cheating me!",
  "我们已经尝试了所有可能的方法。": "We tried all means possible.",
  "那只鸟的体积有半只老鹰那么大。": "The bird was half the size of a hawk.",
  "他对西装和领带的选择非常挑剔。": "He's picky about suits and ties.",
  "所有的员工都回家了，只剩一位。": "All the workers went home save one.",
  "我们的方案在最后的时刻失败了。": "Our plans fell through at the last minute.",
  "他本希望可以成功，但是他没有。": "He had hoped to succeed, but he didn't.",
  "她不仅讲德语、法语，还讲英语。": "She speaks German and French, not to mention English.",
  "你昨天看到的那个男人是我伯伯。": "The man you saw yesterday was my uncle.",
  "请勿由享有版权的来源添加句子。": "Don't add sentences from copyrighted sources.",
  "就我所知，他是个很用功的学生。": "He is an industrious student to the best of my knowledge.",
  "希特勒在一九三三年取得了权力。": "Hitler assumed power in 1933.",
  "这篇作文花了我两个小时来完成。": "It took me 2 hours to finish the essay.",
  "遗憾的是我空闲时间不会有很多。": "Unfortunately I will not have much free time.",
  "不管他去哪儿，他的狗就随着走。": "His dog follows him wherever he goes.",
  "等待一位漂亮的姑娘是我的荣幸。": "It is my pleasure to wait for a beautiful lady.",
  "你们的计划很好，可是我的更好。": "Your plan is a good one, but mine is a better one.",
  "这三个漂亮的女孩都是我的侄女。": "These three pretty girls are all nieces of mine.",
  "我打算买一台照相机给我的女儿。": "I'm going to buy a camera for my daughter.",
  "昨天，我爸爸来帮我家装了空调。": "Yesterday, my father came to my house to help me with the air conditioning.",
  "我把爸爸送给我的手表弄不见了。": "I lost the watch Father had given me.",
  "我们必须团结起来才能战胜敌人。": "We need to band together to beat the enemy.",
  "温度计上的温度跌到了零度以下。": "The thermometer went down below zero.",
  "我每次见到你就会想起你的母亲。": "Every time I see you, I think of your mother.",
  "谁都想活得长久，但没人想变老。": "Every man desires to live long, but no man wishes to be old.",
  "他竟然厚着脸皮穿过我们的花园。": "He had the impudence to cut across our garden.",
  "摩天大厦里的电梯是至关重要的。": "The elevators in a skyscraper are vital systems.",
  "据说葡萄酒的价格可以随时增长。": "It is said that the price of wine may go up at any time now.",
  "石头被美丽得放置在日式庭园里。": "Rocks are beautifully arranged in the Japanese-style garden.",
  "那是有史以来最强烈的一次地震。": "It was the greatest earthquake on record.",
  "不久，同样的服务员回来拿起菜。": "Soon the same waiter came back to pick up the dishes.",
  "她是在为其担心她会发胖的饮食。": "She is on a diet for fear that she will put on weight.",
  "他到了最后的一刻才取消了约会。": "He canceled the appointment at the last moment.",
  "骑自行车不能带人，你不知道吗？": "You can't carry people on your bike, didn't you know?",
  "希望你们以后严格遵守交通规则。": "Hopefully you'll comply with traffic regulations after this.",
  "我需要一支新的笔。我会买一支。": "I need a new pen. I'll buy one.",
  "即使有人比你漂亮，也不会太多。": "If there even are people more beautiful than you, there won't be many of them.",
  "听说您已经跟中介公司联系过了。": "I hear you've already contacted the broker.",
  "我们到了就打这个电话跟您联系。": "We'll contact you by phone as soon as we arrive.",
  "你能帮助我的话，我将很感激的。": "I'd be very grateful if you could help me.",
  "最后，他们感受到了胜利的喜悦。": "At last, they experienced the joy of victory.",
  "这是我们历来经历过最大的地震。": "The earthquake was the biggest one that we had ever experienced.",
  "世界上的大学以剑桥最为有名 。": "Cambridge is the most famous university in the world.",
  "汤姆星期一来的，第二天返回了。": "Tom came on Monday and went back the day after.",
  "跟我还客气什么，咱俩谁跟谁啊。": "Sure, anything for you! We're like family!",
  "我需要星期五之前知道你的答案。": "I need to know your answer by Friday.",
  "现代年轻人戴风帽是装一种派头。": "Currently, having a hood is part of young people's fashion.",
  "这种新型的城市生活有什么特点？": "What's new about this way of urban living?",
  "对爱丁堡来说，这表示什么意思？": "What will this mean for Edinburgh?",
  "约翰·列侬是1940年出生的。": "John Lennon was born in 1940.",
  "他把他的手温柔地放在她的肩上。": "He put his hand gently on her shoulder.",
  "我认识他但是我不知道他的名字。": "I know him, but I don't know his name.",
  "善良是聋子能听盲人能看的语言。": "Kindness is the language which the deaf can hear and the blind can see.",
  "婆婆和媳妇就像是暴风雨和冰雹。": "Mother-in-law and daughter-in-law are a tempest and hailstorm.",
  "但是我那次到中国有家人等着我。": "But when I arrived in China that time, I had a family waiting for me.",
  "再说，只能一个星期以前买到票。": "What's more, you can only buy train tickets one week in advance.",
  "你工作得太辛苦了。放轻松一下。": "You are working too hard. Take it easy for a while.",
  "你可以拿大的盒子或是小的盒子。": "You may take either the big box or the small one.",
  "你做你的部份, 其他的我来做。": "You do your part and I'll do the rest.",
  "这里人太多了。咱们换个地方吧。": "There are too many people here. Let's go somewhere else.",
  "他看了看四周，但没看见任何人。": "He looked in all directions, but didn't see anyone.",
  "我很抱歉, 但它就是不可能的。": "I'm sorry, but it's just not possible.",
  "他在伦敦的时候照了很多照片儿。": "He took many pictures in London.",
  "古代的探险家用星星来辨别方向。": "Early explorers used the stars for navigation.",
  "基顿把磁铁放在他的鸽子的头上。": "Keeton put magnets on the heads of his pigeons.",
  "今日的生活是迅息万变和复杂的。": "Life today is fast-moving and complex.",
  "他去了伦敦，并在那儿待了一周。": "He went to London, where he stayed for a week.",
  "每次我读圣经都会被深深地感动。": "Every time I read the Bible, I am deeply moved.",
  "在京都，有很多的景点值得一看。": "There are a lot of sights in Kyoto.",
  "警察收集了很多对他不利的证据。": "The police assembled a lot of evidence against him.",
  "我从没去过纽约，我妹妹也没有。": "I've never been to New York, and my sister hasn't, either.",
  "如果您想抽烟的话，您必须出去。": "You must go outside if you want to smoke.",
  "他戴着面具以至于没有人认出他。": "He wore a mask so that no one could recognize him.",
  "这表明它们注意听了顾客的需要。": "This shows they have listened to the needs of their clients.",
  "团结、公正和自由是幸福的保证。": "Unity, justice and freedom are the pledge of fortune.",
  "她跑得很快是为了赶上其他成员。": "She ran very fast to catch up with the other members.",
  "我觉得像这样句子听起来更自然。": "I think the sentence would sound more natural like that.",
  "12月份巴厘岛极其炎热和潮湿。": "It is extremely hot and humid in Bali in December.",
  "空气对人来说就是水对鱼的意义。": "Air is to us what water is to fish.",
  "养大一个宝宝是一项艰难的工作。": "Bringing up a baby is hard work.",
  "去伯明翰的火车从3号站台出发。": "The train for Birmingham leaves from platform 3.",
  "我一有小狗，就会开始常常散步。": "As soon as I have a dog, I'll start going for walks frequently.",
  "有很多的方法可以改善人的一生。": "There are many ways to improve one's life.",
  "他是因为母亲病了而不能来学校。": "It is because his mother is ill that he cannot come to school.",
  "与她的相遇丰富了他的精神生活。": "His encounter with her is enriching his inner life.",
  "快点，你就能准时搭上公交车了。": "Hurry up, and you will be in time for the bus.",
  "共产主义是在苏联被实行的制度。": "Communism is the system practiced in the Soviet Union.",
  "不，这样不对。应该设α等于β。": "No, that's not right. You have to set α equal to β.",
  "近来咖啡的短缺造成了许多问题。": "The recent shortage of coffee has given rise to a lot of problems.",
  "在紧急情况下，可拨打 119。": "In case of emergency, call 119.",
  "她太过好奇，以至于打开了盒子。": "She was so curious that she opened the box.",
  "这电子辞典的好处就是便于携带。": "The good thing about this electronic dictionary is that it's easy to carry.",
  "我们的学校离这儿要十分钟走路。": "Our school is ten minutes' walk from here.",
  "你们可以乘火车从华盛顿去纽约。": "You can get from Washington to New York by train.",
  "土豆太热，以至于烫到了我的嘴。": "The potato was so hot that it burned my mouth.",
  "他的夫人是我们的意大利语老师。": "His wife is our Italian teacher.",
  "检察官问了我一个引导性的问题。": "The prosecutor asked me a leading question.",
  "爱情是给予一个人所没有的东西。": "Love is giving something one doesn't have.",
  "淡啤酒是一种酒精含量低的啤酒。": "Pale ale is a low-alcohol beer.",
  "睡眠不足增加心脏病发作的危险。": "Sleep deprivation increases risk of heart attacks.",
  "重要的是要遵循严格的饮食控制。": "It's important to follow a strict diet.",
  "英语在外交和旅游业方面很有用。": "English is useful in diplomacy and tourism.",
  "沙乌地阿拉伯有非常丰富的石油。": "Saudi Arabia is very rich in oil.",
  "战争必须不惜一切代价地去避免。": "War must be avoided at all costs.",
  "约翰甘迺迪被安葬在阿灵顿公墓。": "J.F. Kennedy was buried in Arlington Cemetery.",
  "劳拉英戈尔斯是在草原上长大的。": "Laura Ingalls grew up on the prairie.",
  "您能为我解释这句句子的意思吗？": "Will you please explain the meaning of this sentence to me?",
  "你不要随意评判别人的传统文化。": "Don't judge other people's traditional culture.",
  "我们应该根据他的作为来评判他。": "We should judge him according to his actions.",
  "他写了本关于美国南北战争的书。": "He wrote a book about the American Civil War.",
  "父亲缺钱，所以他必须去借点钱。": "Father ran short of money and had to borrow some.",
  "走的那天，房间11点要空出来。": "Rooms should be left vacant by eleven a.m. on the day of departure.",
  "这里你可以看到漂亮的颜色组合。": "Here you can see beautiful colour combinations.",
  "外国投资者从美国收回他们的钱。": "Foreign investors withdrew their money from America.",
  "要变得完美，她就是少了一个缺点。": "To be perfect she lacked just one defect.",
  "在明天前完成报告几乎是不可能的。": "Finishing the report by tomorrow is next to impossible.",
  "我要回房间了，在那儿我可以学习。": "I am going to my room, where I can study.",
  "在一天之内完成它几乎是不可能的。": "It's next to impossible to finish it in a day.",
  "接下来该采取什么行动就交给你了。": "I leave it in your hands what course of action to take.",
  "能不能麻烦你告诉我去邻村怎么走？": "Sorry, but can you show me the way to the next village?",
  "我期待听到你在这件事上的想法 。": "I look forward to hearing your thoughts on this matter.",
  "这张照片让我想起童年的快乐时光。": "This photograph reminds me of enjoyable times when I was a child.",
  "这架飞机一次可以携带40名乘客。": "This airplane is capable of carrying 40 passengers at a time.",
  "我也想要和你身上那件同样的外套。": "I want the same jacket as you are wearing.",
  "我们的孩子喜欢狗，但我更喜欢猫。": "Our children like dogs, but I prefer cats.",
  "每年有成千上万的外国人访问日本。": "Thousands of foreigners visit Japan every year.",
  "她放下手中的针线活，并站了起来。": "She put aside the sewing and stood up.",
  "整个夏天，我们在那里过得很愉快。": "We spent happy days there all the summer.",
  "在公车上，一个陌生人和我说了话。": "A stranger spoke to me on the bus.",
  "你可能是对的，但我和你意见相反。": "You may be right, but I am against your opinion.",
  "自行车从右侧超过汽车是不合法的。": "It is illegal for bicycles to pass on the right of cars.",
  "目前，我妹妹在一家超市当收银员。": "For the time being, my sister is an assistant in a supermarket.",
  "他有个很有意思但很费功夫的工作。": "He has an interesting job but it requires a lot of skill.",
  "跳上一列正在开的火车是很危险的。": "It is very dangerous to jump aboard the train when it is moving.",
  "一个真正的绅士不会出卖他的朋友。": "A true gentleman never betrays his friends.",
  "他还没有去过法国,他很想明年去.": "He still hasn't been to France; he really wants to go next year.",
  "工厂的废料导致了严重的环境污染。": "The factory waste gave rise to serious environmental pollution.",
  "那（就）解释了为什么门是开着的。": "That accounts for why the door was open.",
  "他买不起汽车，更不要说买房子了。": "He cannot buy a car, still less a house.",
  "除了胡萝卜，他没有什么是不吃的。": "Except for carrots, there is nothing he won't eat.",
  "你生日的时候，我送你一辆自行车。": "I will give you a bike for your birthday.",
  "有空的时候，我总喜欢听古典音乐。": "I always enjoy listening to classical music in my free time.",
  "他们互帮互助，把校庆搞得很成功。": "They helped one another to make the school festival a success.",
  "想像力影响着我们生活的各个方面。": "Imagination affects every part of our lives.",
  "她喜欢网球并成为了一个网球教练。": "She liked tennis and became a tennis coach.",
  "恐怕就这点上，我和你持不同意见。": "I'm afraid I differ with you on this point.",
  "我会安排一下，叫个人去你家接你。": "I'll arrange for someone to pick you up at your home.",
  "当它运转了，他们才看起来放心了。": "They looked relieved only when it was in motion.",
  "他不仅给了我们衣服，还有一点钱。": "He gave us not only clothes but some money.",
  "三年前我来到东京并一直住在这儿。": "I came to Tokyo three years ago and have been living here ever since.",
  "如果你发现错误，那就请你纠正它。": "If you see a mistake, then please correct it.",
  "这种水果形状像橙子，味道像菠萝。": "This fruit is shaped like an orange and tastes like a pineapple.",
  "好好睡了一觉以后，我感觉好多了。": "After sleeping well, I felt much better.",
  "威胁我也没用，我什么都不会说的。": "No point in threatening me. I'll still tell you nothing.",
  "不要走得那么快！我跟不上你们了。": "Don't walk so fast! I can't keep up with you.",
  "他看见色彩鲜艳的鸟、花朵和树叶。": "He saw brightly-colored birds, flowers and leaves.",
  "我没有一次演讲的时候是不紧张的。": "I never make a speech without being nervous.",
  "透过窗，我们可以看到很美的海景。": "We have a good view of the sea from the window.",
  "演出真的很有意思，你该去看看的。": "The show was very interesting. You should have seen it.",
  "昨晚我们听了总统在电视上的讲话。": "Yesterday evening we heard the President talk on television.",
  "我没有一个愿意跟我一起旅行的人。": "I don't have anyone who'd travel with me.",
  "在我去荷兰之前，我从没见过风车。": "I had never seen a windmill until I visited the Netherlands.",
  "互联网是一种无法估量的信息资源。": "The Internet is an invaluable source of information.",
  "有时候口误对政治家来说是致命的。": "A slip of the tongue is sometimes fatal to a politician.",
  "要是我死了，谁来照顾我的孩子们？": "Were I to die, who would look after my children?",
  "你很快就会习惯在大庭广众说话了。": "You'll soon get used to speaking in public.",
  "我今天早上起来的时候雨下得很大。": "It was raining heavily when I got up this morning.",
  "那个建筑师创建了非常现代的房屋。": "That architect builds very modern houses.",
  "从天上看下来，这条河像一条巨蛇。": "Seen from the sky, the river looked like a huge snake.",
  "有些人喜欢排球，其他人喜欢网球。": "Some people like volleyball, others enjoy tennis.",
  "万一有紧急情况，联系我的代理人。": "In case of an emergency, get in touch with my agent.",
  "因为仅一分钟就要差不多花费4镑。": "Because just one minute costs nearly four pounds.",
  "我们老师确实很讲究礼节，不是吗？": "Our teacher really stands on ceremony, doesn't she?",
  "我们听到所发生的事，感到很惊讶。": "We were astonished to hear what had happened.",
  "在结冰的街道上我们很难保持平衡。": "It is hard to keep our balance on icy streets.",
  "这个女士看起来很悲伤，也很疲惫。": "The lady looked sad, also tired.",
  "毕加索是个人尽皆知的著名艺术家。": "Picasso is a famous artist whom everyone knows.",
  "很少有人会批评他，即使有也不多。": "Few, if any, will criticize him.",
  "如果你用完了那本书，我想借一下。": "If you are done with that book, I'd like to have it.",
  "我的演讲稿就是依据这个理论写的。": "This is the ideology to which my speech is written.",
  "这个图书馆有超过50000册书。": "This library has over 50,000 volumes.",
  "她不仅漂亮，而且对每个人都很好。": "She is not only beautiful but also kind to everybody.",
  "你可以随意把相片送给想要它的人。": "You may give this picture to whoever wants it.",
  "我偶然在巴士上碰见了一位旧朋友。": "I bumped into an old friend on the bus.",
  "听到这个悲伤的消息，她泣不成声。": "Hearing the sad news, she collapsed in tears.",
  "他失去了平衡，从梯子上摔了下来。": "He lost his balance and fell off the ladder.",
  "她父亲把一生都贡献给科学事业了。": "Her father devoted his life to science.",
  "他跟我说我很苍白，并问我怎么了。": "He told me that I looked pale and asked me what the matter was.",
  "由于缺水，花园里所有的花都死了。": "Due to the water shortage, all the flowers in the garden have died.",
  "我发现一个地方能买到便宜的水果。": "I've found a place to buy cheaper fruits.",
  "我叫她不要松开绳子，但是她做了。": "I told her not to let go of the rope, but she did.",
  "由于天气不好，飞机迟到了3小时。": "The plane was three hours late due to bad weather.",
  "他努力学习，为的是能够考上大学。": "He studied hard in order to get into college.",
  "你应该要尝试著忘掉不快乐的过去。": "You should try to forget your unhappy past.",
  "我看见你和一个高个子男孩在一起。": "I saw you with a tall boy.",
  "至于我, 我没有什么更多要说的。": "As for me, there is nothing more I want to say.",
  "玩笑归玩笑，事情进展得怎么样了？": "Joking aside, how are things going?",
  "喜欢男人，为什么还要和女人结婚？": "Why would you marry a woman if you like men?",
  "我在选择妻子时犯了一个很大的错误": "I made a big mistake in choosing my wife.",
  "不久派对完结，大家也都回家去了。": "By and by the party ended and everyone went home.",
  "为了调查物价，成立了一个委员会。": "A committee was constituted to investigate prices.",
  "我不想和一个陌生人分享旅馆房间。": "I don't want to share the hotel room with a stranger.",
  "这并不是因为我恨他，相反我爱他。": "It is not because I hate him, but because I love him.",
  "已将近十点了。该是睡觉的时候了。": "It's close to ten o'clock. It's about time we went to bed.",
  "我最多只能付每周50美元的房租。": "I can pay no more than $50 a week for rent.",
  "如果你想成功，就一定要努力工作。": "You must work hard if you want to succeed.",
  "我握住门把，它就从门上掉了下来。": "The handle came away from the door when I grasped it.",
  "我要么去看电影，要么和朋友聊天。": "I am either going to watch a movie, or chat with my friends.",
  "除非是你做饭，否则我是不会吃的。": "I won't eat it unless you cooked it.",
  "蓉蓉的妈妈一点都不像一个好妈妈。": "Rong Rong's mother doesn't seem to be a good mother.",
  "今天很抱歉，让你等了这么多时间。": "I'm sorry that I made you wait for so long today.",
  "不论白猫黑猫，抓到老鼠就是好猫！": "It doesn't matter whether the cat is black or white as long as it catches mice.",
  "他在演奏会前练了很多次这首曲子。": "He practiced the piece many times before the concert.",
  "我很抱歉给你惹来所有的这些麻烦。": "I'm sorry to cause you all this trouble.",
  "他这个人话不多，但总是遵守诺言。": "He is a man of few words, but he always keeps his promise.",
  "请问河南中路五十二弄在什么地方？": "Excuse me, where is 52 south river street?",
  "你一路往前走，过了红绿灯就到了。": "Go straight down the road, and when you pass the traffic light you're there.",
  "那路当然挺远的，我们打的去算了。": "That way is very far, so we took a taxi.",
  "丽萨不但会说英文，而且会说法文。": "Lisa speaks not only English but also French.",
  "发展经济和保护环境哪一个更重要?": "Which is more important, economic development or environmental protection?",
  "除了鼻子不通以外，我还发着高烧。": "In addition to a blocked nose, I'm also suffering from a high temperature.",
  "非方矩阵的逆阵是一个危险的东西。": "The inverse of a non-square matrix is a dangerous thing.",
  "如果你离开日本，我会非常想你的。": "I will badly miss you if you leave Japan.",
  "检查一下用户名和密码有没有填错。": "Check that your username and password are written correctly.",
  "他来找我的时候全身都是酒的味道。": "When he came and found me, his whole body reeked of alcohol.",
  "有草的地方无水，有水的地方无草。": "Where there is grass, there is no water. Where there is water, there is no grass.",
  "他们两位现在太忙了，不想跟你谈。": "The two of them are two busy now; they can't talk to you.",
  "要是你有空的话，我们就去购物吧。": "If you have time, let's go shopping.",
  "我用不到一小时就完成了这个工作。": "I finished the work in less than an hour.",
  "我不但吃了抓饭，而且吃了烤肉串。": "Not only did I eat pilaf, but I also ate kebabs.",
  "可是你的函数不符合利普希茨条件！": "But your function isn't Lipschitz continuous!",
  "透过薄雾，我隐约看见了我的未来。": "In looking through the mist, I caught a glimpse of my future.",
  "咱们现在走吧。要不咱们要迟到了。": "Let's go now. Otherwise, we'll be late.",
  "阿非利康族是源在南非形成的民族。": "Afrikaners are the people originated in South Africa.",
  "你如果能利用重力，那就这么做吧。": "If you can use gravity to your advantage, do so.",
  "今天的激进也许是明天的老生常谈。": "What's radical today may be cliché tomorrow.",
  "与其让我在他手下干，我宁愿辞职。": "I would rather quit than work under him.",
  "有缘千里来相会，无缘对面不相逢。": "Those fated to meet will do so regardless of distance. Those not fated will not, even if they are across from one another.",
  "参加派对的话，你会穿哪一件衣服？": "When considering the party, what kind of clothes are you going to wear?",
  "这里一排都是进口面料欧版的西装。": "The suits in this row are all made of imported European fabric.",
  "这里是三星级宾馆，三百元住一晚。": "This is a three-star hotel; three hundred dollars a night.",
  "好的。房间里长途电话可以直拨吗？": "Good. Can you make long distance calls from the room?",
  "顺便问一下，餐厅晚上几点钟开饭？": "By the way, may I ask when in the evening your restaurant opens?",
  "你要喝什么茶？泡壶柠檬红茶好吧？": "What tea do you drink? Is lemon tea okay?",
  "你看他傻乎乎的模样，倒也挺可爱。": "Look at him. He looks like an idiot but he's also very cute.",
  "你看这张表吧，上面已经写清楚了。": "Look at this table; it has been written out clearly.",
  "朋友之间，大家谈谈心，非常爽快。": "Between friends, to have a heart-to-heart is really rejuvenating.",
  "你想去野生动物园就乘五号巴士吧。": "If you are going to the safari park, take the No.5 bus.",
  "信浓川比日本的任何一条河川更长。": "The Shinano River is longer than any river in Japan.",
  "火车以每小时50英里的速度前行。": "The train is going at a speed of 50 miles per hour.",
  "千万别相信一个手里拿手枪的女人。": "Never trust a woman with a pistol in hand.",
  "我把他带到校区里最贵的餐馆去了。": "I took him to the most expensive restaurant on campus.",
  "工作了一整天的汤姆想要休息一下。": "Tom, who had been working all day, wanted to have a rest.",
  "由于暴风雨的关系，飞机没能起飞。": "The plane was unable to take off due to the storm.",
  "城市居民的死亡率高于农村里的人。": "City dwellers have a higher death rate than country people do.",
  "我的声音让我想起了我已故的祖母。": "Your voice reminds me of my late grandmother.",
  "我的右手是维族的，左手是汉族的。": "My right hand is Uighur, and my left is Han.",
  "绿色的毯子和这条蓝色的帘子不配。": "A green carpet will not go with this blue curtain.",
  "上帝知道我们做了我们所能做的事。": "God knows we did everything we could.",
  "我不是被解雇，是自己辞职不干的。": "I wasn't fired. I quit.",
  "我觉得自己好像被你的眼睛吸住了。": "I feel like I'm being drawn into your eyes.",
  "鱼类例如鲤鱼和鳟鱼生活在淡水中。": "Fish such as carp and trout live in fresh water.",
  "我父亲很老了，耳朵也听不清楚了。": "My father is so old that he is hard of hearing.",
  "在英语能力方面，没有人能比我好。": "As far as English is concerned, nobody can beat me.",
  "第一组早上学习，第二组晚上学习。": "The first group studies in the morning, the second in the evening.",
  "如果他努力学习，他会通过考试的。": "If he studied hard, he would pass the test.",
  "电视在日常生活中起着重要的作用。": "TV plays an important part in everyday life.",
  "无论你要我做什么，我都会去做的。": "I'll do whatever you want me to do.",
  "他的突然出现，让我们都感到惊讶。": "His sudden appearance surprised us all.",
  "法兰克高兴地等待着他晚上的约会。": "Frank was waiting with pleasure for the date in the evening.",
  "若她的姿态能再低一点就更完美了。": "If her nose were a little shorter, she would be quite pretty.",
  "经过银行，左边就是他的办公室了。": "His office is past the bank on your left.",
  "我把前一天才买的照相机弄不见了。": "I lost the camera I had bought the day before.",
  "别射撒旦的背部。你可能会射不中。": "Don't shoot the devil in the back. You might miss.",
  "我本来想给她打电话的，结果忘了。": "I meant to call her, but I forgot to.",
  "要都解释的话，需要一辈子的时间。": "It would take forever for me to explain everything.",
  "我该去买东西了，我一小时后回来。": "I have to go shopping. I'll be back in an hour.",
  "我的眼睛是一片反映我梦想的海洋。": "My eyes are an ocean in which my dreams are reflected.",
  "可惜我们不能像买土豆一样买奇迹。": "It's a pity that you can't buy miracles like you would buy potatoes.",
  "如果没有解决方法，那就没有问题。": "If there's no solution, then there's no problem.",
  "艾希勒女士对学生严厉是出了名的。": "Ms. Eichler had a notorious reputation for being austere to her students.",
  "我发现有明确定义的词最容易记住。": "I find words with concise definitions to be the easiest to remember.",
  "他们太吵了，我没办法集中精神了。": "They're too noisy; I can't concentrate.",
  "你本该拒绝一个那么不公平的提议。": "You should've rejected such an unfair proposal.",
  "塔夫斯是世界上最危险的一所大学。": "Tufts is the most dangerous university in the world.",
  "宝石师傅在胸针上镶了一枚大珍珠。": "The jeweler mounted a big pearl in the brooch.",
  "埃菲尔铁塔和卢浮宫在同一座城市。": "The Eiffel Tower is in the same city as the Louvre Museum.",
  "三个不同的出生日期谁也不可能有。": "No one can have three different birth dates.",
  "今天我同学看到你们在欧尚买东西。": "Today, my classmate saw you guys shopping at Auchan.",
  "两点怎么还不睡觉，你这个夜猫子！": "You stay up until two in the morning. You're such a night owl!",
  "蜡烛没有了芯，就不能算是蜡烛了。": "A candle without a wick is no candle at all.",
  "新建的隧道比以前的那一条长两倍。": "The new tunnel is twice as long as the old one.",
  "那位老者捐了一大笔钱去帮助穷人。": "The old man contributed a large sum of money to the poor.",
  "校长向每个毕业生颁发了毕业证书。": "The principal presented each of the graduates with diploma.",
  "那位女生对自己的美貌感到很骄傲。": "That girl is arrogant because of her beauty.",
  "他的妈妈坐了一整夜，等她的儿子。": "His mother sat up all night waiting for her son.",
  "如果他知道她的电话，他会打给她。": "If he knew her phone number, he could call her.",
  "女孩的脖子上围着一条长长的围巾。": "The girl had a long scarf around her neck.",
  "世界人口将在不久的将来增加两倍。": "The population of the world will double before long.",
  "男子从口袋中掏出枪，吓了我一跳。": "To my horror, the man took a gun out of his pocket.",
  "我说中文的时候，开始感到自在了。": "When I speak Chinese, I start to feel at ease.",
  "如果有一天你走了，我会很难过的。": "If one day you leave, I will be very sad.",
  "我听说英国的草在冬天也还是绿的。": "I hear the grass in England is green even in the winter.",
  "我在你的生日会送给你一辆自行车。": "I will give you a bicycle for your birthday.",
  "我想用这块手表换一块便宜一点的。": "I would like to exchange this watch with a cheaper one.",
  "你们比较喜欢什么，苹果还是香蕉？": "Which do you prefer, apples or bananas?",
  "他的处女作受到了大家的极大欢迎。": "His first work gained great popularity among people.",
  "你明天早上七点可不可以叫我起床。": "Can you wake me up at 7:00 tomorrow?",
  "不管我怎么称赞他们，都不会过分。": "I cannot praise them too highly.",
  "租金贵一点儿没关系，近一些最好。": "The rent can be a bit expensive, but something nearby would be best.",
  "含义是哪里有水井，哪里就有居民。": "The implication was that where there was a well, there were residents.",
  "我那天碰到了我其中的一个老朋友。": "I met an old friend of mine the other day.",
  "您的帮助对我们来说是必不可少的。": "Your assistance is indispensable for us.",
  "由于台风原因，很多航班被取消了。": "Many flights were canceled, owing to the typhoon.",
  "我没有钱的时候，只能以地毯为床。": "When I didn't have any money, I only had a rug for a bed.",
  "你再出个句子让我翻译翻译，好吗？": "Can you give me another sentence to translate?",
  "美国政府一直视英国为美国的宠物。": "The American government has always regarded England as America's house pet.",
  "我再三申明无罪，但是没人听我讲。": "I keep saying that I'm innocent, but no one will listen.",
  "我把笔记放在宿舍了，现在回去拿。": "I left the notes in the dormitory. I'll go back and get them now.",
  "你现在手头儿有钱吗？先借我点儿。": "Do you have cash on you now? Could you lend me some?",
  "树上的叶子随着冬天的到来而掉落。": "With the arrival of winter, the leaves on the trees fall down.",
  "你的照相机只有我那台的一半大小。": "Your camera is only half the size of mine.",
  "我为我男朋友忘了情人节对他生气。": "I'm angry with my boyfriend for forgetting about Valentine's Day.",
  "她认识的英语词比我认识的多十倍。": "She knows ten times as many English words as I do.",
  "谁可以来帮我一下? \"\"我帮你。\"\"": "Can somebody help me? \"\"I will.\"\"",
  "如果把瑞士熨了，会比德国还要大。": "If you ironed Switzerland, it would be bigger than Germany.",
  "大部份的保险计划不包含整容手术。": "Cosmetic surgery is not covered by most insurance plans.",
  "妈妈总是告诉我晚上不要熬夜太晚。": "Mother always tells me not to sit up late at night.",
  "你的眼睛不要看着地上; 看着我。": "Don't keep your eyes on the ground; look at me.",
  "男管家宣布史密斯先生和夫人驾到。": "The butler announced Mr. and Mrs. Smith.",
  "我不能和你们一起去，因为我很忙。": "I can't go with you because I'm very busy.",
  "我很抱歉今天您来的时候没能见您。": "I'm sorry I wasn't able to see you when you came by today.",
  "我认为采用他的计划对我们比较好。": "I think it's better for us to adopt his plan.",
  "母亲节我送给我的妈妈一束康乃馨。": "I gave my mother carnations on Mother's Day.",
  "他很自豪他父亲是个伟大的科学家。": "He is proud that his father was a great scientist.",
  "地球表面的五分之一被冻土覆盖了。": "One fifth of the earth's surface is covered by permafrost.",
  "请不要忘记寄信前要在上面贴邮票。": "Please don't forget to put a stamp on the letter before mailing it.",
  "教英语通常是失败者和酒鬼的工作。": "Teaching ESL is usually a gig for losers and boozers.",
  "由于噪音，我无法集中精力工作了。": "I can't concentrate on my work because of the noise.",
  "我问了比尔他旅行期间天气怎么样。": "I asked Bill what the weather had been like during his travel.",
  "偶尔，我觉得你是一个很有趣的人。": "There are times when I find you really interesting.",
  "有一天, 夏目漱石在伦敦迷路了。": "One day, Natsume Soseki was lost in London.",
  "即使您的声音颤抖，也要说出事实。": "Speak the truth, even if your voice shakes.",
  "吉姆工作努力，而约翰却无所事事。": "Jim works hard, but John is idle.",
  "文章的发表被预定在教授生日那天。": "Publication of the article was timed to coincide with the professor's birthday.",
  "尽管天气很冷，孩子却没有大衣穿。": "The child had no overcoat on although it was very cold.",
  "大象的体型比老鼠的体型大好几倍。": "Elephants are several times the size of mice.",
  "最大可能假想事故什么时候会发生？": "When will the most probable hypothetical accident occur?",
  "太可惜了，你一点也不懂它的真髓。": "It's really unfortunate. You don't understand at all its essence.",
  "你要是不答应的话，我就袖手旁观。": "If you don't make the promise, then I'll just stand by and watch.",
  "救助人员将为地震受灾者提供资助。": "The rescue workers are going to hand out supplies to the victims of the earthquake.",
  "跨国公司预料到了规模经济的实行。": "The multinational corporation has forecast the implementation of economies of scale.",
  "会议将会在特意安排的礼堂里举行。": "The conference will be held in a specially selected church.",
  "加利福尼亚州和内华达州相互接界。": "California and Nevada border on each other.",
  "第二次世界大战结束于1945年。": "World War II ended in 1945.",
  "第一次世界大战于1914年爆发。": "World War I broke out in 1914.",
  "我们的问题和她的比起来不算什么。": "Our problems are nothing compared to hers.",
  "一名空姐从飞机残骸中被救出来了。": "A stewardess was rescued from the wreck.",
  "你说的话给我留下了很深刻的印象。": "What you said left a deep impression on me.",
  "小偷在没有被发现的情况下进去了。": "The thief got in without being noticed.",
  "上星期在一次派对中我遇到了玛丽。": "I ran into Mary at a party last week.",
  "海伦和凯蒂在东京郊区租了个套间。": "Helen and Kathy rented an apartment in a suburb of Tokyo.",
  "你什么时候回来？那就全看天气了。": "When are you coming back? \"\"That all depends on the weather.\"\"",
  "我很想找出她为什么这么说的原因。": "I'd love to find out why she said so.",
  "被我认作朋友的那个男人欺骗了我。": "The man who I thought was my friend deceived me.",
  "许多人爱好的一个冬季运动是溜冰。": "A winter sport that many people enjoy is ice skating.",
  "我会把所有有用的信息提供给您的。": "I will provide you all the necessary information.",
  "董事会一致决定任命她为执行总裁。": "The board unanimously decided to appoint her as CEO.",
  "这家公司在巴黎证券交易所上市了。": "This company is listed on the Paris stock exchange.",
  "感到惊讶、感到惊奇就是明白的开始。": "To be surprised, to wonder, is to begin to understand.",
  "我发现了我爸爸收藏了30年的报纸。": "I discovered my father collected 30 years of newpapers.",
  "银行对风险客户收取较高的贷款利息。": "Banks charge higher interest on loans to risky customers.",
  "由医生来决定某人何时该死是对的吗？": "Is it right for a doctor to decide when someone should die?",
  "我将确保你们在第一年后有一个增长。": "I'll see to it that you have a raise after the first year.",
  "汽笛声响起，船开始慢慢地驶离港口。": "A whistle blew, and the boat slowly began to pull out of port.",
  "我爸爸对我的爱和照顾不比我妈妈少。": "My father was no less affectionate and tender to me than my mother was.",
  "全体销售人员通宵达旦地工作了一周。": "The entire sales staff has worked around the clock for a week.",
  "有效期到1997年3月31日为止。": "It's valid until March thirty-first, nineteen-ninety-seven.",
  "一个神圣的仪式在庄严的庙宇中举行。": "A sacred ritual took place in the magnificent temple.",
  "我们有你的尺寸，但是没有那个颜色。": "We have your size, but not in that color.",
  "数据表明年轻人抽烟的现象没有减少。": "As is evident from the data, smoking is not decreasing among the young.",
  "我的一个叔叔给我了一些有用的建议。": "An uncle of mine gave me some useful advice.",
  "我总是在离手不远的地方放一本字典。": "I always keep a dictionary close at hand.",
  "请不要做任何有损松野家族名声的事！": "Please don't do anything that would besmirch the Matsuno family name!",
  "风刮得太猛，他们没法在公园里玩了。": "The wind blew too hard for them to play in the park.",
  "由于产量过剩，卷心菜的价格下降了。": "The price of cabbage fell because of overproduction.",
  "如果他当时再努力一点，他就成功了。": "With a little more effort, he would have succeeded.",
  "要做蛋糕，你要用到鸡蛋，黄油和糖。": "To make a cake, you need egg, butter and sugar.",
  "过去,我是中学生,现在我是大学生.": "In the past, I was a middle school student. Now I am a college student.",
  "你有100万美元的话，你会做什么？": "What would you do if you had a million dollars?",
  "王小明说英语,可是他的英语书不多.": "Wang Xiaoming speaks English, but doesn't have a lot of English books.",
  "这部电影很无聊，最好的部分是结局。": "This film is really boring - the best bit is when it finishes.",
  "湖上的冰太薄了，承受不了你的重量。": "The ice on the lake is too thin to bear your weight.",
  "那个我认为会通过考试的朋友失败了。": "The friend who I thought would pass the exam failed it.",
  "在这种情况下，我认为你今天应该来。": "In that case, I think you should come in today.",
  "到明年四月我们住在这儿就满两年了。": "We'll have lived here for two years next April.",
  "游泳池由住在附近的孩子们共同使用。": "The swimming pool is used in common by all the children in the neighborhood.",
  "现代交通使我们能在几天内环绕地球。": "Modern travel enables us to go around the world in a few days.",
  "乘飞机去该岛，将花费你100美元。": "It will cost you $100 to fly to the island.",
  "圣诞节的时候，我们送圣诞卡给朋友。": "At Christmas we send Christmas cards to our friends.",
  "他被很多人围着，自然变得有点紧张。": "With so many people around he naturally became a bit nervous.",
  "橙子在我嘴里留下了一种奇怪的味道。": "The orange left a strange taste in my mouth.",
  "我感觉困得几乎不能睁开我的眼睛了。": "I felt so sleepy that I could hardly keep my eyes open.",
  "我爸爸参加了料理竞赛并得了第一名。": "My father participated in a cooking contest and came in first.",
  "那个老人，这么说吧，是一本活字典。": "That old man, let's just say, is a living dictionary.",
  "再走一步的话，你就已经跌下楼梯了。": "Another step, and you would have fallen down the stairs.",
  "唯一比无论什么资源都珍贵的是土地。": "The one resource more precious than any other was land.",
  "你可以毫无问题地辨别孩子们的声音。": "You can identify children's voices without any problem.",
  "如果我早知道，我不会跟她说这种话。": "Had I known that, I wouldn't have said such a thing to her.",
  "你不能未经允许就看别人的私人信件。": "You shouldn't read other people's private letters without permission.",
  "据最少的估计，也要花3000日元。": "It takes 3000 yen by the lowest estimation.",
  "你会很惊讶你在一周内能学到的东西。": "You'd be surprised what you can learn in a week.",
  "不管我做什么，她都说我能做得更好。": "No matter what I do, she says I can do better.",
  "为什么你要对你没做过的事表示抱歉？": "Why say sorry for something you haven't even done?",
  "奥运会最重要的不是获胜，而是参与。": "The most important thing in the Olympic Games is not winning but taking part.",
  "我要的是茶，而他却给了我一杯咖啡。": "He brought me coffee, when I had asked for tea.",
  "那个孩子可能在回家的路上被绑架了。": "That child may have been kidnapped on his way home.",
  "一只狐狸不会两次掉入同一个陷阱里。": "A fox is not caught twice in the same snare.",
  "重要的是你怎么读，而不是你读什么。": "It is not what you read but how you read that matters.",
  "如果她和你结婚了，她现在会很幸福。": "If she had married you, she would be happy now.",
  "通常学生们喜欢理解他们问题的老师。": "Students generally like a teacher who understands their problems.",
  "你们除了信任对方，没什么要做的了。": "All you can do is trust one another.",
  "先生，您把您的打火机留在桌子上了。": "Sir, you have left your lighter on the table.",
  "自从他离开去法国，已经有两个月了。": "Two months have passed since he left for France.",
  "当我们走到转角处，湖就映入了眼帘。": "As we went around the corner, the lake came into view.",
  "他肯定是吃了兴奋剂才会跑得那么快。": "He must have been on steroids to have run that fast.",
  "她终于受不了诱惑，吃掉了整件蛋糕。": "Finally she gave in to temptation and ate the whole cake.",
  "第二天，耶稣决定要出发前往加利利。": "The next day Jesus decided to leave for Galilee.",
  "和都市生活相比，乡村生活和谐多了。": "Country life is very peaceful in comparison with city life.",
  "既然雨已经停了, 我们可以回家了.": "Now that it has stopped raining, we can go home.",
  "奇怪的是，谁也没有投那候选人一票。": "Strange to say, no one voted for the candidate.",
  "我一星期前意外受伤，现在不能出外。": "I can't go out, because I was injured a week ago in an accident.",
  "一个国家的风俗习惯反映了它的文化。": "The manners and customs of a country reflect its culture.",
  "她在镜前停下脚步，自我欣赏了一番。": "She stopped before the mirror to admire herself.",
  "如果明天下雨的话，我就不去野餐了。": "If it rains tomorrow, I won't go to the picnic.",
  "在我有生之年，共产主义不可能达到。": "Communism will never be reached in my lifetime.",
  "大多数被香烟害死的人吸的烟都不多。": "Most people killed by smoking were not heavy smokers.",
  "我听说你通过了入学考试。恭喜你了！": "I hear you passed the entrance exam. Congratulations!",
  "我刚打开锅盖，一股恶臭就扑鼻而来。": "I just opened the lid, and a foul smell filled my nose.",
  "我真不想知道三十年后我会是什么样。": "I don't want to know what I'll be like in 30 years.",
  "望着天花板发呆,还不如读一读小说。": "You might as well read a novel instead of staring at the ceiling.",
  "昨晚我还没有睡觉家里就被小偷光顾了": "Last night my house was robbed while I was still awake.",
  "我可不能把阿渚交给这种文弱的男人。": "I can't hand Nagisa over to such a weak man.",
  "不管你同意还是不同意，我还是要做。": "I am going to do it whether you agree or not.",
  "你也许不会记得，而我永远不会忘记。": "You may well not remember, but I'll never forget it.",
  "只要还活着，我永远忘不了你的好意。": "I will never forget your kindness so long as I live.",
  "我们的足球队打败了市里所有其他队。": "Our football team defeated all the other teams in the city.",
  "我知道他的样子，但不知道他的名字。": "I know him by sight, but not by name.",
  "即使他有些小聪明，但是他并不智慧。": "Though he is clever, he isn't wise.",
  "工人们抱怨他们的工作时间被延长了。": "The workers complained when their working hours were extended.",
  "到周二的时候，我就能读完这本书了。": "I will have finished reading this book by Tuesday.",
  "为了学习日语而来日本的外国人很多。": "Many foreigners also come to Japan to learn Japanese.",
  "我想听清楚演讲内容，便坐在了前面。": "I sat at the front in order to hear the lecture clearly.",
  "上星期天我的家庭去了动物园看熊猫。": "My family went to the zoo to see pandas last Sunday.",
  "我以前常去打羽毛球，但现在不打了。": "I used to play badminton, but I don't anymore.",
  "这个教授对他的学生有很大的影响力。": "The teacher has a great influence on his pupils.",
  "他不但会说普通话，而且会说上海话。": "Not only can he speak Mandarin, but Shanghainese as well.",
  "只有你来了，她才会来我的生日派对。": "Only if you come will she come to my birthday party.",
  "我累死了，以至于我一回家就睡觉了。": "I'm so tired that I'm going to bed as soon as I get home.",
  "在我十岁的时候，我哥哥离家出走了。": "When I was 10, my brother left our home.",
  "我回去很遥远的地方，不要问我那里。": "I am going to a distant place, you don't want to ask where.",
  "你可以看，可以听，但手脚不要乱动。": "Hear and see and be still.",
  "他在意外发生的三个小时后恢复意识。": "He regained consciousness three hours after the accident.",
  "我很高兴，因为我正在学一点荷兰语。": "I'm happy, 'cause I'm learning some Dutch.",
  "你等一会然后再给我打电话，可以吗？": "May I ask you to call me back later?",
  "大家说这家饭馆儿的菜又好吃又便宜。": "Everyone says the food in this restaurant is both delicious and inexpensive.",
  "资本、土地和劳动是生产的三大要素。": "Capital, land and labor are the three key factors of production.",
  "我们还从来没参加过中国人的婚礼呢。": "We'd still never been to a Chinese person's wedding.",
  "风声有点恐怖，听起来好像鬼叫一般。": "The wind sounds scary, like screaming ghosts.",
  "我不知道他是什么时候从法国回来的。": "I don't know when he came back from France.",
  "你想不想知道我的秘密？它很简单……": "Do you want to know my secret? It's very simple...",
  "直率在日本人的眼中并不是一种美德。": "Showing your real feelings is not considered a virtue in Japan.",
  "一盘抓饭配一些烤肉串就是人间天堂。": "A plate of pilaf with some kebabs is heaven on earth.",
  "昨天我打电话来的时候，你在干什么？": "What were you doing when I called you yesterday?",
  "天好以后，我要把稿子送到出版社去。": "After today, I want to send the manuscript to a publishing house.",
  "五点钟，你的信赶快投进去还来得及。": "It's five o' clock. If you quickly post your letter, it still might make it in time.",
  "对不起，没有身份证是不能领汇款的。": "I'm sorry, without an I.D. you cannot receive a remittance.",
  "一盏电灯不亮了，你帮我来看看好吗？": "One of the lights is not working. Do you think you could come take a look?",
  "请你把这张表填一下，等我们的通知。": "Please fill out this form and wait for us to notify you.",
  "火车马上就要开，我们勉强可以赶到。": "The train is about to leave, we can barely catch it.",
  "本地人、外来人齐心共创上海新文明。": "Native Chinese people are working alongside foreigners to change the culture of Shanghai.",
  "刘备和诸葛亮是一支无法战胜的队伍。": "Liu Bei and Zhuge Liang are an unbeatable team.",
  "那场演讲很长，但我却听得津津有味。": "The lecture was very long, but I enjoyed it none the less.",
  "南非的祖鲁族人有着自己独特的语言。": "The Zulu tribe in South Africa has its own language.",
  "我该在这个服务器上设置一个防火墙。": "I need to configure this server with an appropriate firewall system.",
  "如果必要的话，我不反对付特别费用。": "I have no objection to paying a special fee if it is necessary.",
  "请沿着这条路走，在银行那里向右转。": "Go along this street and turn right at the bank.",
  "抓饭肉是八块钱。素抓饭只是四块钱。": "The pilaf with meat is eight yuan. The vegetarian pilaf is only four yuan.",
  "这些植物太小了，我觉得它们长不大。": "These plants are too small. I don't think that they'll grow.",
  "跑得再快些，不然你就赶不上火车了。": "Run faster, or you won't be able to catch the train.",
  "比较一下你写的句子和黑板上的句子。": "Compare your sentence with the one on the blackboard.",
  "让我们非常惊讶的是，他突然辞职了。": "What shocked us greatly was his sudden resignation.",
  "在日本，遇到人鞠躬是有礼貌的表现。": "In Japan, it is polite to bow when one meets someone.",
  "你母亲说六种语言真是让人难以置信！": "It's incredible that your mother speaks six languages!",
  "因为人的种族而歧视他们是一种错误。": "Discriminating against people because of their race is a mistake.",
  "我跟你说过她在的时候不要说这件事。": "I told you not to talk about the matter in her presence.",
  "当我到学校的时候，课程已经结束了。": "By the time I arrived at the school, the class had already finished.",
  "许多年轻人在战争中因为民主而死去。": "Many young men died in the cause of democracy during the war.",
  "讲英语的时候不要怕会不会说错什么。": "Don't be afraid of making mistakes when speaking English.",
  "他的武功已经达到了出神入化的境界。": "His martial arts prowess has already reached a level of sublime perfection.",
  "对不起，您拨打的用户暂时无法接通。": "We're sorry. The number you have dialed is currently unavailable.",
  "您能帮我拨号吗？电话机放得太高了。": "Can you help me dial? The telephone is put too high.",
  "在他的文章中总是有太多肤浅的桥段。": "There was always too much superfluous writing in his essays.",
  "我想我要打喷嚏了。。。给我张纸巾。": "I think I'm gonna sneeze. Give me a tissue.",
  "那些葡萄看起来很甜，但其实是酸的。": "Those grapes look sweet, but in fact they're sour.",
  "骆驼，这么说吧，也就是沙漠中的船。": "A camel is, so to speak, a ship on the desert.",
  "你可以把我的早餐送到305房间吗？": "Could you bring my breakfast to room 305?",
  "水、森林和矿物都是重要的天然资源。": "Water, forests, and minerals are important natural resources.",
  "史蒂芬·科拜尔是一个好疯狂的家伙。": "Stephen Colbert is a pretty crazy guy.",
  "我以为你是混血，因为有点像中国人。": "I think you are mixed race, because you look a bit Chinese.",
  "今天的报纸中有没有什么特殊消息呢？": "Is there any special news in today's paper?",
  "观众面前唱歌让我们大家都感到尴尬。": "We all felt embarrassed to sing a song in public.",
  "我的哥哥真的很高，大概有1米8高。": "My brother is really tall, about 1.8m.",
  "他的勇气将帮助他度过这艰难的任务。": "His courage will carry him through this difficult job.",
  "我还是一个小男孩的时候就住在这里。": "I have lived here since I was a boy.",
  "你认为他是自己独立完成这份工的吗？": "Do you think he did the job on his own?",
  "我连自行车都没有，更不用说汽车了。": "I don't have a bicycle, let alone a car.",
  "爸爸把那份法文的文件翻译成了日文。": "Father translated the French document into Japanese.",
  "老师应该一视同仁地对待他们的学生。": "Teachers should treat all their students impartially.",
  "牛群在郁郁葱葱的草地上缓缓移动着。": "The cows were moving very slowly through the long green grass.",
  "教法语的是怀特老师，不是格林老师。": "French is taught by Mr White, not by Miss Green.",
  "我决不会忘记去年与总统握手的情景。": "I'll never forget shaking the President's hand last year.",
  "内心世界很丰富，不知该如何表达了！": "Deep down, everyone is rich and beautiful, but we don't know how to express it!",
  "他一如往常，没有剃胡子就上班去了。": "As is often the case with him, he went to the office without shaving.",
  "他虽然很有才能，但却不肯努力上进。": "With all the talent he has, he never makes any effort.",
  "在民主国家，报刊的独立是很重要的。": "In a democracy, it is important for journalism to be independent.",
  "因为她是新来的，所以她谁都不认识。": "She is new, so she doesn't know anyone.",
  "不知近况如何，你适应新环境了没有。": "I'm just wondering how you are getting on and if you have adjusted to the new environment.",
  "他奋不顾身地把遇溺的男孩救了起来。": "He saved the drowning boy at the risk of his own life.",
  "我们的朋友完成了比赛，得了第二名。": "Our friend finished the race in second place.",
  "这条路是不是直接通往普拉多博物馆？": "Is this the direct way to the Prado?",
  "你会发现它用几页纸进一步作了说明。": "You will find it stated a few pages further on.",
  "真对不起，刚才都怪我，没注意到您。": "I'm really sorry, it's all my fault - I didn't notice you.",
  "法国人的自以为是真是让人难以忍受。": "It's hard to endure the boastings of the French.",
  "胡同是一种跟中国北京有关的窄街路。": "Hutongs are a type of narrow street, most commonly associated with Beijing, China.",
  "我从来没想到他能做到那么残忍的事。": "I never thought he was capable of doing something so cruel.",
  "因为不知道该说什么，我保持了沉默。": "Not knowing what to say, I remained silent.",
  "明代十五世纪初紫禁城是北京的中心。": "In the Ming Dynasty (early 15th century) the centre of Beijing was the Forbidden City.",
  "看起来，这是一个你无法理解的东西。": "It seems this is something you can't comprehend.",
  "他踮着脚尖走, 所以没有人听到他。": "He tiptoed so no one heard him.",
  "说明年夜饭的饺子是亲人团聚的象征。": "This means that eating dumplings on New Year's eve is a symbol of family reunion.",
  "我们总是应该带上安全带以防出事故。": "We should always wear a seatbelt in case we have an accident.",
  "海面随着全球变暖的加剧而越来越高。": "As global warming increases, sea levels get higher and higher.",
  "咱们一起去图书馆学习，你看怎么样？": "How about studying together in the library?",
  "他在麻醉剂的作用下，他失去了知觉。": "He lost consciousness under the influence of the anesthetic.",
  "日本在高科技产业方面的竞争力很强。": "Japan is highly competitive in high technology industries.",
  "法律术语是大多数普通人无法理解的。": "Legal terminology is usually incomprehensible to non-specialists.",
  "我的父母告诉我, 必须尊重老年人。": "My parents told me that I need to respect old people.",
  "明天是2011年二月五号，星期六。": "Tomorrow is Saturday, February 5th, 2011.",
  "一个人的恐怖分子为另人的自由战士。": "One man's terrorist is another man's freedom fighter.",
  "他们大约五百年前在秘鲁建立了帝国。": "They built their empire in Peru about five hundred years ago.",
  "当我在乌克兰时，我总是讲乌克兰语。": "When in Ukraine, I always speak Ukrainian.",
  "有一个人住在福冈，其他人住在新泻。": "One lives in Fukuoka, and the others live in Niigata.",
  "如果你违反了法律, 你将受到惩罚。": "You'll be punished if you break the law.",
  "我买不起300块美元以上的照相机。": "I cannot afford a camera above 300 dollars.",
  "山田的英语在他的班上是首屈一指的。": "Yamada is second to none in English in his class.",
  "对不起, 明天早上我有兼职的工作。": "Sorry, I have a part-time job tomorrow morning.",
  "如果她不高兴, 她从来不表现出来。": "If she was displeased, she never showed it.",
  "不同之处在于: 他比你更努力工作。": "The difference is this: he works harder than you.",
  "现在言论自由被当作是理所当然的事。": "Freedom of speech is now taken as a matter of course.",
  "很久很久以前住着一个漂亮的小女孩。": "Long long ago, there lived a pretty girl.",
  "你喜欢什么时候打给我就什么时候打。": "You can call me anytime you like.",
  "结婚不是什么使年轻人感兴趣的东西。": "Marriage isn't really something that young people are interested in.",
  "我无法相信他有种向老板要求加工资。": "I can't believe he had the balls to ask the boss for a raise.",
  "孩子因糖果受骗, 大人因誓言上当。": "Children are to be deceived with comfits and men with oaths.",
  "了解一家公司的文化为什么是重要的？": "Why is it important to know about a company’s culture?",
  "翻译帮助我们更好地了解自己的母语。": "Translating helps us to know our mother tongue better.",
  "当我打开门的时候，我发现他睡着了。": "When I opened the door, I found him asleep.",
  "那房子因为其少有的形状被突显出来。": "The house stood out because of its unusual shape.",
  "有时候，我不得不读一些无聊的小说。": "Sometimes I have to read boring novels.",
  "这个工作完成了!我们进入下一步吧!": "Ha - this work finished! Let's go to next stage!",
  "爸爸说他明年就要被升为部门主管了。": "Dad said he'd be promoted to section manager next year.",
  "我弟弟小的时候，我常常陪他去公园。": "When my brother was young, I often used to take him to the park.",
  "要是我有钱的话，我将常常出去玩儿。": "If I had the money, I would often go out and have fun.",
  "他似乎不知道我父亲和我之间的纠葛。": "He seems not to be aware of the conflict between my father and me.",
  "孩子们的衣食住行靠的是他们的父母。": "Children depend on their parents for food, clothing and shelter.",
  "今天强盗大白天的就抢了另一家银行。": "The thieves knocked off another bank today in a daytime robbery.",
  "你知道伦敦交响乐团的演奏会行程吗？": "Do you know the concert schedule of London Symphony Orchestra?",
  "在各大土耳其餐馆，烤羊肉串是主食。": "In various Turkish restaurants, shishkabob is the main food.",
  "这张书桌花了我不下30000日元。": "This desk cost me no less than 30000 yen.",
  "荷兰赢得了2010年世界杯足球赛。": "The Netherlands have won the 2010 World Cup.",
  "大多数美国人似乎不反对我直呼其名。": "Most Americans do not object to my calling them by their first names.",
  "虽然有人来了，但是她还是忐忑不安。": "Even though someone came, she still remained uneasy.",
  "如果人生是凸的，那我们可以优化它。": "If human life is convex, we can optimize it.",
  "你的嗓音对我来说就像是美人鱼的歌。": "The sound of your voice is like a siren's song to me.",
  "哲学不是我们用六个月就能学的东西。": "Philosophy is not a thing one can learn in six months.",
  "因为你工作得太多，所以你总是很累。": "Because you work so much, you are always very tired.",
  "汽车旅馆可以接待多达400名客人。": "The motel can accommodate as many as 400 guests.",
  "女王伊丽莎白一世于1603年去世。": "Queen Elizabeth I passed away in 1603.",
  "我一把孩子抱在手里，他就开始哭了。": "The moment I held the baby in my arms, it began to cry.",
  "为了不吵醒宝宝，我静静地关上了门。": "I shut the door quietly so as not to wake the baby.",
  "我读小学的时候，我母亲常常来接我。": "When I was in elementary school, my mother always fetched me from school.",
  "我读小学的时候，我母亲每天来接我。": "My mother used to pick me up every day when I was at primary school.",
  "和一只恐龙面对面是一段有趣的经历。": "Coming face to face with a dinosaur was a funny experience.",
  "你应该自己判断什么时候喝了太多酒。": "You should be able to judge when you've had too much to drink.",
  "如果他年轻一点，他将很适合这个职位。": "If he were a little younger, he would be eligible for the post.",
  "合同已经到手了，那就出去庆祝一下吧。": "The contract is in the bag, so let's go out and celebrate.",
  "直到那时，他才意识到他已经上当受骗。": "Only then did he realize he had been deceived.",
  "罗杰斯先生和史密斯小姐昨天宣布订婚。": "The engagement of Mr Rogers and Miss Smith was announced yesterday.",
  "只有为数不多的几个电视节目值得关注。": "Only a few TV programs are worth watching.",
  "国际货币基金组织不考虑再借款给该国。": "The IMF ruled out any new loans to that country.",
  "控制一个班级需要你做老师的所有技能。": "To control a class calls for all your skills as a teacher.",
  "上个月，我们20岁的女儿生了个女孩。": "Last month our twenty-year-old daughter gave birth to a baby girl.",
  "巨大的柱子遮住了视线，让人看不到湖。": "A large pillar obstructs the view of the lake.",
  "我还了从图书馆借的书，又借了些新的。": "I returned the books I borrowed from the library, and I borrowed some new ones.",
  "你读给我听的时候，我就可以做缝纫了。": "While you are reading to me, I can do my sewing.",
  "那个男人，就是他的孩子很友好的那个.": "That man, the child of whom is very friendly.",
  "麦克和他妹妹会说法语，但不会说日语。": "Mike and his sister can speak French, but they can't speak Japanese.",
  "王小明还没有去过美国,他很想明年去.": "Xiaoming Wang has never been to America. He really wants to go next year.",
  "如果他再努力一点，就可能已经成功了。": "With just a little more effort, he would have succeeded.",
  "我们希望在不久的将来邀请彼得去日本。": "We wish to invite Peter to Japan in the near future.",
  "他有2个孩子，一个4岁，另一个1岁。": "He has two children, aged 4 and 1.",
  "我知道他的名字，但不知道他长什么样。": "I know him by name, but not by sight.",
  "请送两份早餐过来。2号餐加两杯奶茶。": "Bring two breakfasts, please. Number 2 on the menu, and two teas with milk.",
  "如果天气允许的话，我们1小时后出发。": "Weather permitting, we will leave in an hour.",
  "我的手指冻僵了，以至于无法弹钢琴了。": "My fingers are so numb with cold that I can't play the piano.",
  "为了弄到一个好位子，我很早就出门了。": "I left home early to get a good seat.",
  "战争永远谈不上好，和平永远谈不上坏。": "There never was a good war nor a bad peace.",
  "我匆匆忙忙，为的是能赶上第一班火车。": "I hurried in order to catch the first train.",
  "他退休的时候，他儿子接手了他的生意。": "When he retired, his son took over the business.",
  "政治家从来不告诉我们他们的别有用心。": "Politicians never tell us their inner thoughts.",
  "抱歉，请允许我指出上文中的三个错误。": "Excuse me; allow me to point out three errors in the above article.",
  "看你并不感到惊讶，你肯定已经知道了。": "You're not even fazed. You must have known all along!",
  "我爸爸退休了，以便为更年轻的人让路。": "My father retired to make way for younger people.",
  "他们好不容易才回答了他们老师的问题。": "They answered their teacher's question with difficulty.",
  "这里的夏天很潮湿，另外，冬天很干燥。": "It gets very humid here in the summer. In the winter, on the other hand, it gets very dry.",
  "说了所有我要说的话后，我感觉很轻松。": "I felt quite relieved after I had said all I wanted to say.",
  "给你解释这为什么行不通要花很多时间。": "It would take me too much time to explain to you why it's not going to work.",
  "我没请他来参加庆祝会，感到有点内疚。": "I feel a little guilty that I didn't invite him to join the celebration.",
  "很幸运地，我在机场遇到了我的老朋友。": "Quite by chance, I met my old friend at the airport.",
  "她把她的小孩一个人留在那里去购物了。": "She went shopping, leaving her little child all alone.",
  "钱币的价值取决于所使用的金属的重量。": "The value of the coins depended on the weight of the metal used.",
  "那我就不继续打扰你，玩数独游戏去了。": "I will play Sudoku then instead of continuing to bother you.",
  "这个梯子是否足够坚固以承受我的重量？": "Is this ladder strong enough to bear my weight?",
  "不管这个问题重不重要，你必须解决它。": "No matter how important the question may or may not be, you must solve it.",
  "因为住过东京，我对这个城市非常了解。": "Having lived in Tokyo, I know the city well.",
  "她将永远不会忘记听过这首悲伤的曲子。": "She shall never forget listening to the sad tune.",
  "我用了比我预期更长的时间来完成作业。": "The assignment took me longer than I had expected.",
  "他完全沉浸于家庭生活中，不想工作了。": "He is totally immersed in family life and has no wish to work.",
  "我只是希望我们能离开这个可怕的地方。": "I just wish we could leave this horrible place.",
  "年轻人伸出他的手，接着我和他握了手。": "The young man put out his hand and I shook it.",
  "由于诸多不幸因素，单亲家庭在增长中。": "Due to a number of unfortunate causes, one-parent families are on the increase.",
  "在人群中，我们失去了那个男人的踪影。": "We lost sight of the man in the crowd.",
  "你可不可以帮我把这些句子翻译成中文？": "Can you help me to translate these sentences into Chinese?",
  "每年世界人口都有 2% 的平均增长。": "Each year the world's population increases on average by two percent.",
  "从他脸上的神情来看，他似乎是成功了。": "Judging from the look on his face, it seems that he has succeeded.",
  "如果我知道他的地址，就能写信给他了。": "If I knew his address, I could write to him.",
  "若追根溯源，绝大多数美国人都是移民。": "Most Americans are descended from immigrants.",
  "所有村民出发去山里寻找一只失踪的猫。": "All the villagers went into the mountains to look for a missing cat.",
  "3月15日将是我最后一天上学的日子。": "March 15 will be my last day of school.",
  "大炸弹从天而降，夺走了许多人的生命。": "A big bomb fell, and a great many people lost their lives.",
  "英语是当今世界上一种非常重要的语言。": "English is a very important language in today's world.",
  "总体上说，女人是比男人好的语言学家。": "Generally speaking, women are better linguists than men.",
  "从现实的角度看，他的计划有很多缺点。": "From the practical point of view, there are many shortcomings in his plan.",
  "虽然失败了很多次，但是他仍从不放弃。": "Having failed many times, he never gave up the plan.",
  "暂时下线洗澡吃饭，过40分左右回来!": "Break for bath &amp;amp; food, back in about 40 minutes!",
  "这不公平！凭什么我必须做艰苦的工作。": "It's not fair! I have to do the hard work!",
  "你衬衫的第二粒衣钮好像快要掉下来了。": "The second button of your shirt is coming off.",
  "地面仍然很湿滑，看来比赛要被取消了。": "The ground is still wet. As likely as not, the game will be cancelled.",
  "你喜欢哪个就买哪个,但不能两个都买。": "You can buy whichever you like, but not both.",
  "他的学生中没有一个可以解决这个问题。": "None of his students could solve the problem.",
  "他留了胡子，为了让自己看起来更成熟。": "He grew a beard to look more mature.",
  "与其知道你要走，我宁肯你没有回来过。": "I would rather that you never returned than know that you wanted to leave.",
  "哪怕没有人陪我，我也要去看这部电影。": "Even if no one goes with me, I still want to see this movie.",
  "快点写完你的作业，我们好去打游戏机。": "Finish your homework faster, so that we can play video games.",
  "我轻轻地对她说：《不要怕，我在这儿》": "I whispered to her quietly \"\"Don't be afraid, I'm here.\"\"",
  "我今天不用当值，不如一起去海滩玩吧。": "As I am off duty today, let's go to the beach.",
  "猴子跳到他身上的时候，他受到了惊吓。": "He was scared when the monkey jumped at him.",
  "我们走的时候下着雨，到的时候有太阳。": "It was raining when we left, but by the time we arrived, it was sunny.",
  "演员们一边唱，一边跳，表演得好极了。": "The performers danced whilst singing - they performed extremely well.",
  "这个公园不小，有很多树，还有很多花。": "This park is pretty big; it has a lot of trees and many flowers.",
  "这时候公园里的工人拿来了一些小纸牌。": "Just then, the workers in the park brought over some small playing cards.",
  "沿着这条大道走，你就会找到电影院了。": "Go along this street, and you'll find the movie theater.",
  "既然你要去超市，那就顺便买些鸡蛋吧。": "Since you're going to the supermarket, buy some eggs while you're there.",
  "他们之所以没有游泳，就因为天气很冷。": "They didn't swim because it was cold.",
  "如果我知道的话，我早就已经告诉你了。": "Had I known about it, I would have told you.",
  "他和许多其他人一样问了我同样的问题。": "He asked me questions similar to those asked by many others.",
  "时间还早着呢，大家坐下来侃一会儿吧。": "It's still early. We should all just chill for a bit.",
  "上海这个地方，海内海外什么菜肴都有。": "Shanghai has everything under the sun when it comes to food.",
  "周围环境怎么样？静不静？夜晚闹不闹？": "How's the neighborhood? Quiet? Noisy at night?",
  "你吃面条还是吃饭？喝橙汁还是喝咖啡？": "Do you want to eat noodles or rice? Do you want to drink fruit juice or coffee?",
  "这是自动投币电话，用一元硬币来打的。": "This is an automated payphone; you use it by inserting a coin.",
  "喂，请问现在能给我马上送一叠稿子吗？": "Hey, could you send over the stack of manuscripts straight away?",
  "昨天我去看医生做检查，看看有没有病。": "Yesterday, I went to the doctor to see if I was ill.",
  "今天即使再忙，也要做完这些事情才走。": "Even though it's busy today, this bit of work must be finished before leaving.",
  "因为你们公司的业务能够发挥我的特长。": "Because your business can play to my strengths.",
  "如果我有时间有钱，我要到欧洲去旅游。": "If I have time and enough money, I'd want to go traveling in Europe.",
  "上海人结婚，有的人家办酒宴场面很大。": "Some Shanghainese hold large banquets when they get married.",
  "在我们的饭店抓饭，拌面，烤肉串都有。": "We have pilaf, lo mein, and kebabs in our restaurant.",
  "她不想一直胖下去，所以正在戒吃蛋糕。": "She does not eat cake, so as not to put on any more weight.",
  "她只有两岁，但她已经会数到100了。": "She's only two years old, but she can already count to 100.",
  "先生，请别生我的气！我是新来的工人！": "Please don't get mad, sir! I'm a new worker!",
  "那个时候，墨西哥还没有独立于西班牙。": "At that time, Mexico was not yet independent of Spain.",
  "她很会打扮，所以不管穿上什么都合适。": "She has good style, so she looks good in anything she wears.",
  "第二次世界大战是在1939年开始的。": "It was in 1939 that the Second World War broke out.",
  "在新加坡，鞭刑是处置犯人的方法之一。": "In Singapore, one way to punish a criminal is to whip him or her.",
  "因为是用法文写的，所以这本书很难读。": "This book is difficult to read as it is written in French.",
  "就我所知，铃木先生还没从夏威夷回来。": "Mr Suzuki, as far as I know, has not returned from Hawaii yet.",
  "我乘的火车7点出发，10点到了纽约。": "My train left at 7 and arrived in New York at 10.",
  "如果你不想一个人呆着，我可以陪着你。": "If you don't want to stay alone, I can keep you company.",
  "生活真正的艺术是在平凡中看到不平凡。": "True art of life is to see the extraordinary amongst the ordinary.",
  "除非他们事先修好刹车，我才会买车子。": "I will only buy the car if they repair the brakes first.",
  "他没有接电话，所以我给他发了封邮件。": "He did not answer the phone, so I sent him an email.",
  "有些宝宝甚至在一岁之前就学习游泳了。": "Some babies learn to swim even before they are one year old.",
  "她的用功对我们所有人是一个好的榜样。": "Her diligence is a good example to us all.",
  "只要有你在我的身边，我就别无他求了。": "If you are by my side, I don't need anything else.",
  "如果你有其他问题，请通过表格发给我。": "If you have any other issues, please notify me through the form.",
  "根据电视新闻，一架飞机在印度坠毁了。": "According to TV news, there was a plane crash in India.",
  "如果可能的话，在明天前做好这个工作。": "Do this work by tomorrow if possible.",
  "今天我们来揭开英文虚拟式的神秘面纱。": "Today, we are going to unravel the mystery of the English subjunctive.",
  "实在抱歉，老板在睡觉。请您明天再来。": "I'm sorry, my boss is sleeping right now. Please come back tomorrow.",
  "我的六十岁的房东为什么买了一个蹦床？": "Why did my sixty-year-old landlord buy a trampoline?",
  "嗨，我可能没钱，但我一直有我的骄傲。": "Hey, I may have no money, but I still have my pride.",
  "自由旨在能够做所有不伤害其他人的事。": "Liberty consists of being able to make everything as harmless as possible.",
  "如果我没有给予任何回答，我不会说话。": "If I gave no answer, I would not have spoken.",
  "当我们明白真正的自己时，生活开始了。": "Life begins when we realize who we really are.",
  "我是在一九六二年三月二十二日出生的。": "I was born on March 22, 1962.",
  "我什么都不需要。。。只要一条新裤子。": "I don't need anything... just a new pair of pants.",
  "记者没有犹豫地去干涉了人们的私生活。": "Reporters do not hesitate to intrude into people's privacy.",
  "如果仍然有人缺席的，请将名单发给我。": "If anybody is still absent, please send their names to me.",
  "招股说明书必须由两名保荐代表人签字。": "Prospectuses must be signed by two sponsor representatives.",
  "最近的一项调查显示吸烟的人数减少了。": "A recent survey shows that the number of smokers is decreasing.",
  "我爸爸病了，正在床上休息，不能见你。": "Being sick in bed, my father can't see you.",
  "我到处都看了，可还是没找到我的皮夹。": "I have looked everywhere, but I can not find my wallet.",
  "我小的时候经常跟我父亲一起去钓鱼的。": "I used to go fishing with my father when I was a child.",
  "天不怕，地不怕，就怕温州人说温州话。": "Do not fear the heavens and the earth, but be afraid of hearing a person from Wenzhou speak in their local tongue.",
  "顺便问一句，你们已经去过北海道了吗？": "By the way, have you ever been to Hokkaido?",
  "大家帮我这么大的忙，真心向大家道谢。": "You have helped me so much, I'd like to express my sincere gratitude.",
  "这件衣服样式倒是挺好，就是贵了点儿。": "The style of this item of clothing is good; it's just a bit expensive.",
  "今年我们公司的发展速度大大超过去年。": "This year, the speed of development in our company far exceeds that of last year.",
  "不管我怎么努力，也达不到父母的要求。": "No matter how hard I strive, I fail to achieve my parents' requirements.",
  "谣传一架宇宙飞船在上海附近被见到了。": "It is rumoured that a spaceship has been seen near Shanghai.",
  "我宁愿自己独立生活也不要他来指使我。": "I would rather live by myself than do as he tells me to do.",
  "现代版旗袍因能突显女人的身材而闻名。": "The modernized version of the qipao is noted for accentuating the female figure.",
  "这个家庭非常贫穷以至于无法偿还贷款。": "The family is too poor to pay back the debts.",
  "我提出这一点之前，我的鞋和我去睡觉。": "I make it a point to shine my shoes before I go to bed.",
  "等一下，我马上就回来。不要挂断电话！": "Hold on a second, I'll be right back. Don't hang up!",
  "它有四条腿，是木制的而且站在厨房里。": "It has four legs, it is made of wood and it lives in the kitchen.",
  "在印度，人们在餐桌上用右手传递食物。": "In India, people pass food at the dinner table with the right hand.",
  "英国的食物以炸鱼排加炸薯条最为有名。": "Fish'n'chips is the most famous English food.",
  "今天晚上我先用一下，争取明天还给你。": "I'll use it a bit this evening, and try my best to give it back to you tomorrow.",
  "我现在身上没有那么多钱，不过卡里有。": "I don't have much money on me right now, but my card has some on it.",
  "劳动不仅是一种需要，而还是一种愉快。": "Labor is not merely a necessity but a pleasure.",
  "我们五个之中，肯定是他说的语言最多。": "Among the five of us, he's surely the one who can speak the most languages.",
  "我不要红色的柿子椒, 而是要绿色的。": "I don't want red bell peppers, I want green ones.",
  "如果她的体温上升, 派人去请医生来。": "If her temperature goes up, send for the doctor.",
  "欺骗别人是错的, 但更糟的欺骗自己。": "It's wrong to deceive people, but worse to deceive yourself.",
  "没有肮脏的爱情, 也没有美丽的监狱。": "No love is foul nor prison fair.",
  "在哈尔滨，许多人邀请我到他们家吃饭。": "In Harbin, many people invite me to their homes to have dinner.",
  "在你侍酒前最好先将白葡萄酒冷却一下。": "It's better to chill white wine before you serve it.",
  "我数着星宿的星光来预测我爱情的未来。": "I count the sparkle of constellations to foretell the future of my love.",
  "昨天是星期天，所以我睡了一整天的觉。": "I slept all day yesterday, because it was Sunday.",
  "你是不是喝醉到能再说一遍德语的程度？": "Are you drunk enough to speak German once again?",
  "他把荷马的史记从希腊语翻译成了英语。": "He translated Homer from the Greek into English.",
  "上次我见到她的时候，她看上去挺好的。": "She looked well when I last saw her.",
  "杰夫找了三个月以后才找到了一份工作。": "Jeff searched for three months before he found a job.",
  "这家公司不分种族、宗教或国籍雇用人。": "That company hires people without regard to race, religion, or nationality.",
  "他和他所有的朋友分享了他的那盒饼干。": "He shared his box of biscuits with all his friends.",
  "我永远不会忘记那次跟她一起去夏威夷。": "I'll never forget going to Hawaii with her.",
  "这家饭馆下午的时候往往没有很多顾客。": "Not many customers come to this restaurant in the afternoon.",
  "他将要成为中国驻法国大使馆的外交官。": "He is about to become a diplomat at the Chinese Embassy in France.",
  "减税常被用作刺激经济的主要财政手段。": "Tax cuts are often used as a major fiscal tool to stimulate the economy.",
  "啊？我们说过要去公园吗？我没有印象。": "Eh? We said we'd go to the park? I didn't realise.",
  "诗人对他爱的女人表达了他火热的激情。": "The poet expressed his burning passion for the woman he loved.",
  "万一她回来得太晚，把这个口信带给她。": "If she should come late, give her this message.",
  "当更多的纸币投入使用，价格就下跌了。": "As more paper money came into use, the value fell.",
  "她挥着她的手，直到火车消失在视线之外。": "She waved her hand until the train was out of sight.",
  "当她发现他们还没有学校，她就办了一个。": "When she saw that they had no schools, she started one.",
  "不要相信一个你一点都不了解他过去的人。": "Don't trust a man whose past you know nothing about.",
  "他很快便与小区里新来的男孩交上了朋友。": "He quickly made friends with the new boy on the block.",
  "如果我现在有100万日元，我会买辆车。": "If I had one million yen now, I would buy a car.",
  "在某种程度上你是对的，但我还是有疑问。": "In a way you are right, but I still have doubts.",
  "他在城市里一直受到噪音或者其他的干扰。": "He was always annoyed in the city by noises of one sort or another.",
  "你只要在这里写下你的姓名和地址就行了。": "All you have to do is to write your name and address here.",
  "警察大概从一个月前就开始找被偷物品了。": "The police have been searching for the stolen goods for almost a month.",
  "他的分数总比我高，尽管他学习得少一点。": "His scores are always better than mine, even though he doesn't study very much.",
  "他过去认识她，但他们现在不再是朋友了。": "He once knew her, but they are no longer friends.",
  "她开始对生态学感兴趣，是受到他的影响。": "It was through his influence that she became interested in ecology.",
  "这个班的女生平均身高超过了155公分。": "The average height of the girls in class is over 155 centimeters.",
  "我觉得要我用法语写一本小说是不可能的。": "I think it impossible for me to write a novel in French.",
  "我一点都不知道这会给你带来那么多问题。": "I had no idea it would put you to so much trouble.",
  "自从手术后，我父亲一直处于良好的状态。": "My father has been in good shape since his operation.",
  "只有能提出新问题的回答才是有用的回答。": "The only useful answers are those that raise new questions.",
  "我们今天所认识的工业在那个时代不存在。": "Industry as we know it today didn't exist in those days.",
  "明天下午2点以前，我希望这工作完成了。": "I want this work completed by two o'clock tomorrow afternoon.",
  "就像你们知道的那样，毅力是成功的关键。": "Perseverance, as you know, is the key to success.",
  "两个孩子的年龄加起来和他们的父亲相当。": "The ages of the two children put together was equivalent to that of their father.",
  "除了相信对方以外，你们没什么要做的了。": "All you need to do is trust each other.",
  "我在伦敦的时候，应该会去看一两场演出。": "When I am in London, I will most probably go catch a few performances.",
  "我怎么可能是机器人呢？机器人不会做梦。": "How could I be a robot? Robots don't dream.",
  "去年夏天，我们在桥上看焰火看得很过瘾。": "We enjoyed watching the fireworks on a bridge last summer.",
  "知道如何使用电脑对我们来说变得很重要。": "It is becoming important for us to know how to use a computer.",
  "那个时候我才意识到我把钱包忘在家里了。": "Only then did I realize that I had left my wallet at home.",
  "那是在我到家以后，我才不见了我的钱包。": "It was not until I reached home that I missed my purse.",
  "了解一个国家最好的方法是亲自去看一看。": "The best way to know what a country is like is to go and see it with your own eyes.",
  "为了参加划船比赛，一支新的队伍组成了。": "A new team was formed in order to take part in the boat race.",
  "如果运气好的话，我一天可以生产好几件。": "I can produce several pieces a day if I'm lucky.",
  "在我看来,澳洲是世界上最好的国家之一.": "From my point of view, Australia is one of the best countries in the world.",
  "他被人发现倒在厨房的地板上，不省人事。": "He was discovered unconscious on the floor of the kitchen.",
  "我爸爸拿出他的钱包，并给了我10美元。": "My father took out his wallet and gave me ten dollars.",
  "行动比语言更有说服力。别发牢骚多做事。": "Actions speak louder than words. Stop complaining and do it.",
  "我家和邻居家以院子之间的篱笆为分界线。": "There is a fence marking the boundary between our yard and the neighbor's.",
  "你们学校真好，还帮你们报销来回的机票。": "Your school is so kind to reimburse you for the return airfare.",
  "顺着这条街走大约50米，就会看到邮局。": "Follow the street for about 50 meters, and you will see a post office.",
  "火很快便被扑熄了，房子只受到轻微损坏。": "The house did not suffer much damage because the fire was quickly put out.",
  "我得推我的自行车，因为有个轮胎漏气了。": "I had to push my bicycle because I had a flat tire.",
  "只要你好好学中文，你就能去中国读书了。": "If you learn Chinese well, you can go study in China.",
  "由于这几天下了很多雪，因此学校停课了。": "Due to the large amounts of snow over the last few days, school has been cancelled.",
  "只要听到这首歌，我就会想起他们的笑容。": "Whenever I hear this song, I think of his smile.",
  "我今天晚点下班，省得明天早上手忙脚乱。": "Today I'm working a little late so as to avoid a rush in the morning.",
  "他出去看电影了。 电影好看吗? 好看。": "He went out to see a movie. \"\"How was the movie?\"\" \"\"Good.\"\"",
  "警方根据现场遗下的证物把贼子找了出来。": "The burglar was traced by one of the things he had left on the scene.",
  "我在午休时间睡了一会儿，因为我太累了。": "I slept a little during lunch break because I was so tired.",
  "我突然想起钱包好像放在家中，忘了带了。": "It occurred to me that I had left my purse at home.",
  "汤川博士在科学研究上起了很重要的作用。": "Dr. Yukawa played an important part in the scientific study.",
  "二零零九年我高中毕业了可是还没上大学。": "In 2009, I had graduated from high school but I still hadn't started university.",
  "听说老师要结婚，大家都想参加她的婚礼。": "When they heard that their teacher was going to get married, everyone wanted to attend her wedding.",
  "客人很多，大部分都是老师的同学和朋友。": "There were many guests - most of them were our teacher's classmates and friends.",
  "因为他是个友好的人，所以大家都喜欢他。": "People like him because he is kind.",
  "西班牙人最爱在晚上外出散散步、乘乘凉。": "Spaniards love to stroll around in the evening cool.",
  "在实战中，你要知道三心二意是很危险的。": "In real combat, you must not forget that hesitation is a very dangerous thing.",
  "一名伟大的战士放射出力量。他不用死战。": "A great warrior radiates strength. He doesn't have to fight to the death.",
  "你变了那么多，以至于我几乎认不出你了。": "You have changed so much that I can hardly recognize you.",
  "我时间有点来不及，只能出门买大饼油条。": "I'm running a little short on time, so I can only go out and buy flat bread and bread sticks.",
  "旁边一排衣服跟这里的衣服没什么不一样。": "There is no difference between this row of clothes and the one next to it.",
  "这条领带颜色亮一点，跟这件西装比较配。": "This tie has a more vibrant color and goes better with this suit.",
  "我觉得价钱太贵，再说没什么特别好看……": "I think it's too expensive; besides, it doesn't even look that good...",
  "欢迎光临，现在人很多，请坐下来等一等。": "Welcome. Now that many people have arrived, please take a seat and wait for a while.",
  "里面开了一个个欧式的小店，情调好极了！": "A small European shop opened inside. The ambience is great!",
  "我刚知道你在生病，所以下了班来看望你。": "I just found out that he's sick, so I'll visit him later.",
  "你身体一直非常好，怎么突然间住医院了？": "Your body was always very healthy; why are you suddenly in the hospital?",
  "这次一进医院，才知道身体健康最最重要。": "This time, when he went into the hospital, he finally understood that one's health is really the most important thing of all.",
  "小林的眉毛长得浓，眼睛又大，睫毛很长。": "Xiaolin's eyebrows are thick, his eyes are big, and his eyelashes are long.",
  "已经退休了，但还常常被他们请去做顾问。": "He's already retired but is often asked by them to consult.",
  "他的工作工资很高，工作时间也相当理想。": "His salary is high, and the hours are pretty good, too.",
  "做餐馆服务员啊、酒吧招待员啊，都可以。": "Either as a waiter at a restaurant or a bartender, both are OK.",
  "上海人讲上海话；上海人也都会讲普通话。": "People from Shanghai speak Shanghainese; they can also speak Mandarin.",
  "虽然我住在她家附近，可是也很少见到她。": "Although her house is nearby, I seldom see her.",
  "会议我迟到了，结果错过了最重要的部分。": "I was late for the meeting with the result that I missed the most important part.",
  "我觉得很难用一天时间做完所有这些工作。": "I find it difficult to do all this work in a day.",
  "收音机太响了。你不能把音量调低一点吗？": "The radio is too loud. Can't you turn it down a little?",
  "我们将要整理房间，这样妈妈就会满意了。": "We will tidy up our room so that Mom is satisfied.",
  "你的文章写得很好，但却有很多字拼错了。": "Your composition was good except for the spelling.",
  "用大智慧做股票，说明您对投资是认真的！": "Managing your stocks with Big Wisdom shows that you are serious about investing!",
  "人是生而自由的，但却无往不在枷锁之中。": "Man is born free; and everywhere he is in chains.",
  "如果你不忙，这周末为何不来跟我钓鱼呢？": "If you are not busy, why don't you come fishing with me this weekend?",
  "在这个密码里，每个数字取代了一个字母。": "In this secret code, each number stands for a letter of the alphabet.",
  "你说今晚改变一下，去外面吃晚饭怎么样？": "How about eating out this evening for a change?",
  "五十岁以后学一门新的语言不是那么容易。": "It's not that easy to learn a new language after fifty.",
  "他把自己的钱包掉到地上，现在是我的了。": "He dropped his wallet, and now it's mine.",
  "我想在爸爸妈妈回来之前把房子打扫干净。": "I want to clean the house before my parents return.",
  "最后一个听我说我的主意的人认为我疯了。": "The last person I told my idea to thought I was nuts.",
  "我觉得我和你一起住影响了你生活的方式。": "I think that our living together has influenced your habits.",
  "尼日尔仍然有50万孩子面临着营养不良。": "Half a million children still face malnutrition in Niger.",
  "民主主义者是屈服于大部分人的自由公民。": "A democrat is a free citizen who yields to the will of the majority.",
  "政治家以揭露政府官员的腐败来推动改革。": "The politician pushed for reform by denouncing the corruption of the government officials.",
  "所有的模型都有错，不过有些还是有用的。": "All models are wrong, but some are useful.",
  "如果你中了一百万日元的奖，你会怎么做?": "If you won a million yen, what would you do?",
  "山中的小径舖满了柔软的落叶，十分好走。": "The mountain path was under a blanket of leaves, soft and easy to walk on.",
  "他的书销路不好，所以现在手头十分拮据。": "He is badly off, because his book doesn't sell well.",
  "天才们有一个重要的缺点：　他们不会输。": "Brilliant people have one major drawback - they don't know how to lose.",
  "平行四边形是由两组平行线组成的四边形。": "A parallelogram is a quadrilateral formed from two sets of parallel lines.",
  "母亲在我的生日蛋糕上插上了十三枝蜡烛。": "My mother put thirteen candles on my birthday cake.",
  "如果没有了水，没有人能够在地球上生存。": "If it were not for water, no one could live on earth.",
  "世界上没有人能够不付出努力就获得成功。": "No one succeeds in the world without effort.",
  "这部恐怖片很吓人，我一看就睡不着觉了。": "This horror movie is really scary. I couldn't sleep after I watched it.",
  "你们家去北海道旅游是真的么？我羡慕你。": "Is it true that your family will travel in Hokkaido? I envy you.",
  "如果他继续这样喝酒，他该乘出租车回家。": "If he keeps drinking like that, he'll have to take a taxi home.",
  "有些月份有三十天，有些月份有三十一天。": "Some months have thirty days, others thirty one.",
  "热天气不仅仅意味着人们觉得有点不高兴。": "Hot weather doesn’t just mean that people feel a little unhappy.",
  "彼此必须一辈子努力,才能把感情维系好。": "Each of you must work hard for a lifetime, and only then will you be able to maintain a relationship.",
  "我们真的不知道，下次我们再也不这样了。": "We really didn't know; we won't do it next time.",
  "生肖的十二种动物里没有猫的原因很简单。": "The reason the cat is not included in the 12 animals of the Chinese zodiac is very simple.",
  "我送了他一个在美国买的双火焰的打火机。": "I offered him a double-flame lighter that I bought in the United States.",
  "即使我的钱够了，我也不会买一辆法拉利。": "Even if I had enough money, I still wouldn't buy a Ferrari.",
  "尽管喝酒对身体不好，很多人还是喜欢喝。": "In spite of the fact that drinking alcohol damages their bodies, many people still like to drink it.",
  "我们玩过了。我们输了。咱们从新来过吧？": "We played. We lost. How about starting it over?",
  "实验构造是怎样的？它们是如何相连接的？": "What did the experimental set-up look like? What was connected to what and how?",
  "熟练的士兵知道怎么以他们的环境为武器。": "Skilled soldiers know how to use their environment as a weapon.",
  "我需要某人抱着我并对我说一切会顺利的。": "I need someone to hold me and tell me everything will be alright.",
  "我很想跟你一起去, 但重点是我不能去。": "I'd like to go with you, but as it is I can't.",
  "爸爸给了我一本书, 弟弟给了我一枝笔。": "Dad gave me a book, and my little brother gave me a pen.",
  "可能你们中的许多人在动物园都看过熊猫。": "Maybe a few of you have seen pandas in the zoo.",
  "熊猫因为它们的稀有而成为了世界的宝藏。": "Because of their rarity, pandas have become a world treasure.",
  "迈克吃完早饭以后一直在做一个模型飞机。": "Mike has been making a model plane since breakfast.",
  "在中国，人人必须去出发的火车站买车票。": "In China, you have to go to the departure station and buy train tickets there.",
  "我的记性不好。我简直不记得他的名字了。": "My memory failed me. I just could not remember his name.",
  "上周六，因为我母亲病了，我无法离开家。": "I was unable to leave home last Saturday, with my mother being ill.",
  "他履行了他的承诺，并且帮助了他的兄弟。": "He kept his promise and helped his brothers.",
  "我喜欢孩子。这就是为什么我成为了教师。": "I like children. That's why I became a teacher.",
  "我不推荐在那家餐馆吃饭。食物糟糕透了。": "I don't recommend eating in that restaurant. The food is awful.",
  "现在我们很容易就能乘飞机去遥远的国度。": "Today we can go to distant countries easily by plane.",
  "祂到自己的地方来，自己的人却不接受祂。": "He came to that which was his own, but his own did not receive him.",
  "我不知道火车时间，你能帮我打听一下吗？": "I do not know the train schedules, could you find out for me?",
  "如果他听了他医生的建议，他可能还活着。": "If he had taken his doctor's advice, he might still be alive.",
  "我不喜欢茶，所以我早餐大致上都喝咖啡。": "I do not like tea, so I generally drink coffee for breakfast.",
  "他跟我说了他明天从北京机场飞往英格兰。": "He told me that tomorrow he goes from Beijing to England by plane.",
  "他儿子的犯罪行为给他带来了很大的痛苦。": "His son's criminal activities caused him great pain.",
  "陪审团作出的犯罪判决激起了很大的争论。": "The jury's guilty verdict gave rise to widespread debate.",
  "你知道吗，我从没过见你跟一个男人一起。": "You know, I've never seen you with a guy before.",
  "小孩子不能判断什么是对的，什么是错的。": "Young children cannot determine what is right and what is wrong.",
  "对你来说，我们可不可以评判别人的宗教？": "In your view, can we judge other people's religion or not?",
  "世界就像一本书，不旅游的人只读了一页。": "The world is like a book, and those who don't travel read only one page.",
  "意大利到了夏季，21点前是不会天黑的。": "In Italy, during summer, it doesn't get dark until about nine o'clock.",
  "我在派对玩得太尽兴，以至于不想回家了。": "I was having such a good time at the party that I didn't want to come home.",
  "尽管距离很远，我们还是保持着通信联系。": "Even though we are far apart, we still keep in touch.",
  "男孩们窃窃私语，我知道他们准备做些什么。": "The boys were whispering; I knew they were up to something.",
  "睡眠是最大的小偷，它偷了我们一半的生命。": "Sleep is the greatest thief, for it steals half one's life.",
  "爱，就是一个人把另一个人的心揉碎的过程。": "Love is the process of breaking and mending the heart of another.",
  "威尼斯的圣马可广场在夏季总是挤满了游客。": "St Mark's Square in Venice is always swarming with tourists in the summer.",
  "许多词是根据拼写来发音的，不过有些不是。": "Many words are pronounced according to the spelling, but some are not.",
  "我想知道这个冬天在我们的城市会不会下雪。": "I wonder if it will snow in our town this winter.",
  "他在气头上，说了所有他想说的话就回家了。": "In a fit of anger he said everything he wanted to say and went home.",
  "我的电视机出故障了，所以我不得不拿去修。": "My television was broken down, so I had to get it repaired.",
  "我看不出有其他方法能让他接受我们的提议。": "I can't think of any other way of getting him to accept our proposal.",
  "每月发工资的那天，我给我妈5000日元。": "Every month when I receive my salary, I give 5000 Japanese Yen to my mother.",
  "他以牺牲自己的健康为代价完成了这项工作。": "He did it at the expense of his health.",
  "在这个城市，白人和黑人间的争端愈演愈烈。": "The conflict between blacks and whites in the city became worse.",
  "瑞士位于法国、意大利、奥地利和德国之间。": "Switzerland is located between France, Italy, Austria and Germany.",
  "直到我自己有了孩子我才明白了什么是母爱。": "It was not until I had a baby myself that I knew what mother's love is.",
  "如果我早知道你在这儿的话，我马上就来了。": "If I had known that you were here, I would have come at once.",
  "要我相信我会相信你不相信的东西是没用的！": "It's no use pretending to make me believe that I believe things you don't believe!",
  "要是我们做了同样的事，我们将会受到惩罚。": "Were we to do such a thing, we should be punished.",
  "我生平难得做了一件好事...却是没用的。": "For once in my life I'm doing a good deed... And it is useless.",
  "他对我说了谎，这就是为什么我生他的气了。": "He lied to me. That is why I am angry with him.",
  "要是我告诉你我所知的一切，你会被惊呆的。": "If I were to tell you all I know, you would be amazed.",
  "他很高兴能通过各种方法在人生中取得成功。": "He was glad to avail himself of any means to succeed in life.",
  "从那时以后，我们再也没听到他的任何音讯。": "Thereafter we heard no more from him.",
  "我能不能够订一个圣诞节时去夏威夷的位子?": "Can I reserve a seat to Hawaii for Christmas?",
  "世界上任何山峰都达不到珠穆朗玛峰的高度。": "No other mountain in the world is as tall as Mt. Everest.",
  "25 岁至 54 岁的男女生活压力最大。": "Men and women between the ages of 25 and 54 have the most stressful lives.",
  "大部分人写的东西是关于他们的日常生活的。": "Most people write about their daily life.",
  "把这张邮票贴在明信片上，然后投到邮箱里。": "Put this stamp on the postcard and drop it in the mailbox.",
  "即使我承认你说的是真的，但这并不是借口。": "Even if I grant that what you say is true, it is no excuse.",
  "我把你认成了别人，所以才没有和你打招呼。": "I didn't greet you because I mistook you for somebody else.",
  "如果你明天有空，我们就可以一起吃午饭了。": "If you have free time tomorrow, we could eat lunch together.",
  "一、二、三、四、五、六、七、八、九、十。": "One, two, three, four, five, six, seven, eight, nine, ten.",
  "我在你这个年纪的时候，冥王星是一颗行星。": "When I was your age, Pluto was a planet.",
  "有借有还，再借不难。有借不还，再借就难。": "Borrow and return, then you can borrow again. Borrow and don't return, and then the borrowing gets difficult.",
  "你决没决定骑自行车还是坐公共汽车去城里？": "Have you decided whether you are going into town by bike or by bus?",
  "由于下大雪，从北京来的班机延迟二十分钟。": "Because of heavy snow, the plane from Beijing arrived 20 minutes late.",
  "这件衬衫我不喜欢。把另外一件给我看一下。": "I don't like this shirt. Show me another.",
  "你们会用电脑是为了学习，不是为了玩游戏。": "You'll use the computer for studying, and not for playing games.",
  "他没有办法生火，便只好把鱼活生生的吃掉。": "As he had no way of making fire, he ate the fish raw.",
  "硬币的一面叫做\"\"公\"\"，另一面叫做\"\"字\"\"。": "One side of a coin is called 'heads' and the other side is called 'tails'.",
  "书桌上一叠专业书里有几本卡通书混在里面。": "There were some graphic novels mixed into the pile of specialty books on the desk.",
  "我们大概去了，不过要看天气怎么样再决定。": "We'll most likely go, but we'll decide once we see what the weather is like.",
  "在房间里只能拨市内，长途可以到总台来打。": "You can only make local calls from the room; you can go to the front desk to call long-distance.",
  "你要交几张照片，填好几张表格，办好签证。": "You need to hand in a few photos, fill in a form, and get a visa.",
  "子女培养全社会都很关心，教育要进行改革。": "The raising of children is something that concerns the entire community. There will be an education reform.",
  "我不是一条真的鱼，我只是一个长毛绒玩具。": "I'm not a real fish, I'm just a mere plushy.",
  "它就像我的尾巴一样，我去哪里它就去哪里。": "Just as if it were my tail, wherever I go, it goes too.",
  "一份我们不喜欢的工作就是。。。一份工作。": "A job that you don't love is... a job.",
  "偶数乘以奇数是偶数，奇数乘以奇数是奇数。": "Even times odd is even, odd times odd is odd.",
  "英式英语和美式英语在很多地方上有所不同。": "British English differs from American English in many ways.",
  "在中国的旁边，瑞士像一个荒废的乡村似的。": "Next to China, Switzerland is an abandoned village.",
  "意大利的国际号码前缀是三十九(+39)。": "The country code for Italy is +39.",
  "你该把你的值钱物品保存在一个安全的地方。": "You should keep your valuables in a safe place.",
  "假如你没有这个程序，你现在就可以去下载。": "If you do not have this program, you can download it now.",
  "这次交通事故中只有一个小男孩幸存了下来。": "Only one little boy survived the traffic accident.",
  "喜欢的人什么都不怀疑，或什么都疑神疑鬼。": "People who love doubt nothing, or doubt everything.",
  "按照这个速度，我们不会在这周结束前完成。": "At this rate, we're not likely to be done before the end of the week.",
  "水和冰虽然形态不同，但其实是同一种物质。": "Water and ice are the same substance in different forms.",
  "大魔王终于失去知觉，砰的一声倒在了地上。": "The demon lord finally lost conciousness and fell to the floor with a thud.",
  "我的猫儿一脸迷惘地盯着自己在水中的倒影。": "My cat peers bemusedly at her reflection in the water.",
  "灰暗的天空突然下起了一大滴一大滴的雨来。": "All of a sudden, large drops of rain began falling from the dark sky.",
  "吸烟的人请病假的日数比不吸烟的人多两倍。": "Smokers take twice as many days off sick as non-smokers.",
  "虽然他是我的邻居，但是我对他并不太了解。": "He is my neighbor, but I don't know him well.",
  "这个系统存在着许多缺陷和不尽完善的地方。": "This system is bristling with defects and drawbacks.",
  "因为不知道做什么，所以我向老师寻求建议。": "Not knowing what to do, I asked the teacher for advice.",
  "你看上去很苍白。你最好立刻去床上躺会儿。": "You look pale. You had better lie down in bed at once.",
  "公共汽车的停车站正好坐落在我的住所前面。": "The bus stop is located right outside where I live.",
  "我们在意大利的时候，租车用了一个礼拜 。": "We hired a car for a week when we were in Italy.",
  "学校与企业见面会于12月26日按期举行。": "The meeting between the school and the business is scheduled to be held on the 26th of December.",
  "从来就没有什么救世主， 也不靠神仙皇帝！": "There has never been a savior nor an immortal emperor to rely on.",
  "找到一位能够代替他的人不会是容易的任务。": "It won't be easy to find someone capable of taking his place.",
  "不是因为某人不理事实它们就会不复存在了。": "Facts do not cease to exist because they are ignored.",
  "我在电视台的工作就是处理观众们写来的信。": "My work at the TV station is handling letters written in by viewers.",
  "今天我要处理的事还没处理完，又要加班了。": "Today I haven't dealt with the things I wanted to deal with; I'll have to work overtime again.",
  "世界上已经够热的地方会变得让人无法忍受。": "Parts of the world that are already hot enough might become unbearably so.",
  "抱着失败主义的态度你无法打一场漂亮的仗。": "You can't fight a good fight with such a defeatist attitude.",
  "问题不需要占用很多时间，也完全不要留名。": "The questions will not take long, and everything would be kept completely anonymous.",
  "在北京，胡同是由四合院的传统居所排形成。": "In Beijing, hutongs are alleys formed by lines of siheyuans, the traditional courtyard residences.",
  "尽管中文学起来不容易，可是比你想的简单。": "Although it seems very difficult to study Chinese, it's not as hard as you think.",
  "大部分的父母视自己的孩子为世界上最好的。": "Most parents see their own children as the best in the world.",
  "韩国随着朝鲜的外患而在边界附近集结军队。": "As North Korea displays aggression, South Korea concentrates its forces near the border.",
  "中国的经济随着时间的推移而变得越来越好。": "As time goes on, China's economy gets stronger and stronger.",
  "我的生活随着时间的推移而变得越来越糟糕。": "As time goes on, my life gets worse and worse.",
  "你的二十块在哪里? 我给你五块钱找到它。": "Where is your twenty? I'll give you five bucks for it.",
  "我不敢探查得太深, 以免发现可怕的事实。": "I dare not probe too deeply, lest I uncover the awful truth!",
  "在那里，人们把熊猫训练得能表演许多节目。": "There, pandas have been trained to perform dozens of items.",
  "从那时起，在广州每年春节的时候都有花节。": "From then on, flower fairs were held in Guangzhou during the Spring Festival every year.",
  "奥林匹斯山? 那不是希腊众神鬼混的地方?": "Olympus? Isn't that where Greek gods hang out or something?",
  "茱莉的哥哥从意大利寄了一张圣诞贺卡给她。": "Julie received a Christmas card from her brother in Italy.",
  "我排队不久后，一个男人来问我要不要租车。": "Not long after I joined the queue, a man approached and asked if I wanted a taxi.",
  "由于全球气候变暖，城市可能被完全地淹没。": "Due to global warming, cities could be completely submerged.",
  "英语现已成为世界上许多国家的通用语言了。": "English has now become the common language of several nations in the world.",
  "今天8.8级的强大地震袭击了日本的岛屿。": "A massive earthquake of magnitude 8.8 hit the Japanese islands today.",
  "海豚和驯养员交流得比我们所期望的好得多。": "The dolphin and trainer communicated much better than we expected.",
  "如果你女朋友发现真相的话，你会有麻烦的。": "You'll get into trouble if your girlfriend finds out the truth.",
  "这表明了地方领导恢复地区卓越水平的雄心。": "It reveals local executives' ambitions of bringing the region back to the top.",
  "那家饭馆儿的服务员给我们留下很好的印象。": "The staff in that restaurant gave us a very good impression.",
  "这次面试的意义是评断你适不适合这家公司。": "The purpose of this interview is to assess whether or not you are suitable for the company.",
  "没有人明白为什么大象突然攻击了它的主人。": "Nobody understood why the elephant suddenly turned on its owner.",
  "沿着这条路直走，到第三个红绿灯的地方右转。": "Go straight down this street and turn right at the third light.",
  "在这种天气下，我最好是待在家里而不要出去。": "In this kind of weather it's best if I stay at home and don't go outside.",
  "即使他们有很好的酒单，我也不想在这里用餐。": "Even if they have a good wine menu, I will not want to dine here.",
  "我有两个儿子，一个在东京，另一个在名古屋。": "I have two sons; one is in Tokyo, and the other in Nagoya.",
  "难怪她表示不想再见到他了。因为他们分手了。": "No wonder she doesn't want to see him again. Because they broke up.",
  "他们和一个导游一起出发，只是为了以防迷路。": "They set out with a guide just in case they lost their way.",
  "这小女孩如果没人关心的话，就要走上歪路了。": "The little girl will go astray if no one cares much about her.",
  "据说《哈姆雷特》是写出来的最有意思的剧本。": "It is said that \"\"Hamlet\"\" is the most interesting play ever written.",
  "贫穷的不是拥有太少的人，而是想要太多的人。": "Poor is not the one who has too little, but the one who wants too much.",
  "家乐福的火腿剩料一点都不贵，然而却很好吃。": "Carrefour's Ham offcuts are not expensive at all, but are nonetheless delicious.",
  "他的包就在这儿，所以他不可能已经去了学校。": "His bag is right here, so he cannot have gone to school yet.",
  "考虑到他缺乏经验，他做得[已经]非常好了。": "He is doing very well considering he lacks experience.",
  "每天早上当他吃早餐的时候，他的狗都看着他。": "Every morning, while he is eating his breakfast, his dog looks at him.",
  "电脑为我们节省了很多时间，解决了很多问题。": "Computers save us a lot of time and trouble.",
  "海洋不是将世界分隔开来，而是将世界连接起来": "Oceans do not so much divide the world as unite it.",
  "一个入室盗窃者趁我去旅游的时候闯入了我家。": "A burglar broke into my house while I was away on a trip.",
  "昨天我在放学回家的路上突然遇上了一阵大雨。": "As I returned from school yesterday, I was caught in a sudden shower.",
  "我听到这个消息时，简直不能相信自己的耳朵。": "I could hardly believe my ears when I heard the news.",
  "虽然她有许多缺点，但我却情不自禁地爱着她。": "I cannot help loving her in spite of her many faults.",
  "我有两条狗。一条是白色的，另一条是黑色的。": "I have two dogs. One is white and the other black.",
  "如果你知道这个问题的答案的话,就请告诉我。": "If you know the answer to this question, please tell me.",
  "她不但是一个演员，她还曾是一个著名的画家。": "Besides being an actress, she was a famous painter.",
  "我做的蛋糕不是被你吃了，就是被你妹妹吃了。": "If you didn't eat the cake I made, then your sister did.",
  "他觉得她说的很有道理，于是接受了她的建议。": "He thought she spoke reasonably, so he accepted her suggestion.",
  "你从这里过去到那里，穿过第二条横马路就是。": "You can get there by crossing the street at the second intersection.",
  "新郎现在在一家公司工作，新娘是我们的老师。": "The groom works for a company now, and the bride is our teacher.",
  "老师和她爱人带着参加婚礼的人来到一个公园。": "The teacher and her partner took the people attending the wedding to a park.",
  "爱你们的同学！爱你们的父母！爱你们的国家！": "Have love for your classmates! Have love for your parents! Have love for your country!",
  "我们今晚会吃很多，所以我希望你没有在节食。": "We're going to eat a lot tonight so I hope you're not on a diet.",
  "中午十二点左右，到我们单位的饭厅去吃午饭。": "At around 12pm, we go to the dining area of our unit for lunch.",
  "今天穿了这件有点儿红的衬衫，我能走出去吗？": "Can I go out today wearing this shirt that has a little bit of red?",
  "比如说，我要到市中心，有什么车子可以坐吗？": "For example, if I want to get downtown what bus should I take?",
  "我谢谢你帮帮忙，给我把灯关了，我想睡觉了。": "Thank you for helping me. Please turn off the light, I want to go to sleep.",
  "因为今天明天我休息，所以趁机会快点搬好它。": "I don't have to go to work today and tomorrow, so I will use the opportunity to quickly finish moving it.",
  "他上身长得呈倒三角形，站在那里看上去特帅！": "His upper body looks like it has the shape of an inverted triangle; standing there, he seems extremely handsome!",
  "即使我拿不到高工资，我也不肯放弃这个饭碗。": "Even if I don't get a high salary, I'm not willing to quit this way of making a living.",
  "如果世界上没有神，那么我就用双手创造出神。": "If God doesn't exist in our world, then I will create God with my own hands.",
  "尽管语言和习俗不同，大家还是能够成为朋友。": "Despite different languages and cultures, everyone still became friends.",
  "我种了很多花，有些是红色的，有些是黄色的。": "I have a lot of flowers. Some are red and some are yellow.",
  "想要得到女儿，就必须从她母亲那儿开始努力。": "He who would the daughter win, with the mother must begin.",
  "我不想放弃我的想法，虽然一些想法有点极端。": "I don't want to lose my ideas, even though some of them are a bit extreme.",
  "从战争开始的那一瞬间开始，两方都是罪恶的。": "Once a war breaks out, both sides are in the wrong.",
  "德国在1880年代采取了一种社会保障制度。": "Germany adopted a social security system in the 1880's.",
  "在一九五八年，巴西首次夺得了世界杯的冠军。": "In 1958, Brazil won its first World Cup victory.",
  "她有两只猫。一只是白色的，另一只是黑色的。": "She has two cats. One is black, and the other is white.",
  "你看，那边正在冒烟，那栋大厦一定是失火了。": "Look at that smoke. That building must be on fire.",
  "我去那里不是为了死亡。我去那里是为了生活。": "I did not go there to die. I went there to live.",
  "如果我去中国的话，是为了尽可能多地说中文。": "If I go to China, it'd be to speak Chinese as much as possible.",
  "我只能问自己这对其他所有人是不是一回事呢。": "I can only wonder if this is the same for everyone else.",
  "我要给我自己买一个新照相机，这次要数码的。": "I'm going to buy myself a new camera, digital this time.",
  "他用斧头重重的斩了一下，那棵树就倒了下来。": "The tree was felled with one hard blow of his ax.",
  "吸烟的人患上肺癌的风险比不吸烟的人高得多。": "Smokers are far more likely to develop lung cancer than non-smokers are.",
  "在那滩冰淇淋的周围，有一群蚂蚁在爬来爬去。": "The area around the melting ice cream was crawling with ants.",
  "她的老公是英文老师，所以她能免费上英文课。": "She is married to an English teacher, so she can take lessons free of charge.",
  "你这样不分昼夜地工作，将会伤害自己的健康。": "If you work day and night, you will lose your health.",
  "他养了两头猫：一头是黑色的，一头是白色的。": "He keeps two cats: one is black, and the other white.",
  "人有选择的权利，但是奴隶却只有服从的份儿。": "A man chooses; a slave obeys.",
  "我一个月没见到小王了，他说不定已经回国了。": "I haven't seen Xiaowang for a month now; perhaps he's already gone back to his own country.",
  "对我来说，努力学习就是最好取得成功的办法。": "In my view, studying hard is the best way to achieve success.",
  "首先，因为海水变热时膨胀，海平面可能提高。": "First of all, the level of the ocean could rise, because ocean water expands as it grows warmer.",
  "如果你没决心做好男人,那你就得不到好女人。": "If you don't resolve to become a good man, then you just won't get a good woman.",
  "这个旅馆的房间不像那个旅馆的房间那么干净。": "The rooms in this hotel are not as clean as the rooms in that hotel.",
  "我正在做一些历史研究工作，想问您几个问题。": "I'm doing some history research and would like to ask you a few questions.",
  "尽管美国是个发达国家，却还有些很贫穷的人。": "Even though America is a developed country, it still has some very poor people.",
  "尽管他考试成绩不高，但他毕业后还是很成功。": "Although his exam scores weren't very high, he was still successful after graduation.",
  "我们这个房子是刚刚装修过的，住了不到一年。": "This house of ours has just been redecorated, and we haven't lived here for sixth months.",
  "剑桥的三十一个学院中，以彼得学院最为古老。": "Peterhouse is the oldest of the 33 colleges of Cambridge.",
  "他把他的打算解释了给我和我的儿子两个人听。": "He explained his plan both to my son and to me.",
  "今天是交学费的最后一天，我银行卡里没钱了。": "Today is the last day to pay tuition fees, and my credit card has no money on it.",
  "所有的思念与祝福都包进了那薄薄的饺子皮里。": "All of the longing and wishes for good fortune are wrapped up in the fragile skin of the dumplings.",
  "在空无一物的地方, 皇帝再大的权力也无用。": "In an empty place, an emperor has no power.",
  "他不知道《罗密欧与朱丽叶》是莎士比亚写的。": "He didn't know Shakespeare wrote Romeo and Juliet.",
  "不同的地方可以在同一时节有十分不同的温度。": "The temperature in different places can vary greatly at the same time of year.",
  "这本书是用简单英语写成的，让初学者看得懂。": "This book is written in easy English for beginners to understand.",
  "我很累, 然而, 我必须完成我的回家作业。": "I am tired; nevertheless, I must finish my homework.",
  "许多网路公司为求生存而需要新颖的商业模式。": "Many on-line companies need to have a new approach to business to survive.",
  "你五点钟还没睡觉！刚从酒吧回来了，是不是？": "It's five and you're still not in bed! You just came back from the bar, didn't you?",
  "那是一个给我们带来无穷乐趣的传奇性的演出。": "It was a fabulous show which brought us an endless delight.",
  "今天糟糕透了，所以我准备去喝一杯就直接上床。": "I had an awful experience today, so I'm going to have a beer and go straight to bed.",
  "他给我们讲了一个有趣的故事，我们都笑了起来。": "He told us such a funny story that we all laughed.",
  "随着时间的推移，比赛增加了规则以使之更安全。": "As time went on, rules were added to the game to make it safer.",
  "如果你不按照安全手续来的话，你可能会受伤的。": "You may injure yourself if you don't follow safety procedures.",
  "我现在感觉好多了，但我知道爸爸还是会很担心。": "I'm feeling better now, but I know that my father will still be very worried.",
  "但是说真的，第21集让我笑得眼泪都要出来了。": "Seriously though, episode 21 made me almost cry while laughing.",
  "今天你们俩很让人印象深刻。我为你们感到骄傲。": "You've both been very impressive today. I'm proud of you.",
  "访客通常在进入一户日本人家之前会被要求脱鞋。": "Visitors are usually asked to remove their shoes before they enter a Japanese house.",
  "他试图表现得很愉快，但我们都知道他有多悲伤。": "He tried to act cheerfully, but we all knew how sad he felt.",
  "感谢最后为我说明了为什么人们把我当作傻瓜了。": "Thanks for having explained to me at last why people take me for an idiot.",
  "她和小区里大部分妇女不同，因为她会读书写字。": "She was different from most women in the neighborhood, for she was able to read and write.",
  "看来他出国学习的目的是要提高他说英语的能力。": "Developing his ability of speaking English, it seems, is his purpose of studying abroad.",
  "你能把我的名字加到等候批准的申请人名单上吗？": "Could you put my name on the waiting list?",
  "我的朋友总是三分钟热度，一年就换了三份工作。": "My friend has had three jobs in a year; he never sticks to anything for long.",
  "癌症如果在第一阶段被发现的话是很容易治愈的。": "Cancer can be cured easily if it is found in its first phase.",
  "我并不反对你出去工作，可是小孩靠谁来照看呢？": "I don't object to your going out to work, but who will look after the children?",
  "那些想要颠覆这个世界的人们，我们将击败你们。": "To those who would tear the world down: we will defeat you.",
  "所有的马都是动物, 但并非所有的动物都是马。": "All horses are animals, but not all animals are horses.",
  "我原本是不需要给花浇水的，我刚浇完就下雨了。": "I need not have watered the flowers. Just after I finished it started raining.",
  "公司的职员设法隐瞒，但真相不久便水落石出了。": "The staff at the company tried to cover up the truth, but soon it came to light.",
  "我的一些同学真是菜鸟，他们一点都不懂计算机。": "Some of my classmates are pure noobs; they know nothing about computing sciences.",
  "他等火车的时候，一会儿听音乐，一会儿发短信。": "While he was waiting for the train, he listened to music and sent text messages.",
  "我今天有点不舒服。那户井水是许多疾病的源头。": "I don't feel well today. That well water is the cause of many illnesses.",
  "虽然他考得很好，他口语的汉语不见得比你的好。": "Although he did well in the exam, his spoken Chinese is not necessarily as good as yours.",
  "我不懂得詹姆斯为什么一直给他的妻子吹毛求疵。": "I can't understand why James always finds fault with his wife.",
  "在他只看了10页的时候，我已经看了60页了。": "He has only read 10 pages so far, I've already read 60.",
  "我可以不慌不忙吃牛奶面包鸡蛋，或者泡饭酱菜。": "I could eat some beef noodle soup, or some reheated rice with soybean paste like that, no problem.",
  "如果我这点活儿可以做完，我将在星期一去南京。": "If I can finish up this bit of work, I will go to Nanjing on Monday.",
  "我家里有个老年人突然倒在地上，大概是中风了。": "An elderly person in my family suddenly fell to the ground; he likely suffered a stroke.",
  "我喜欢画油画，但是我不想拿它做我的终身职业。": "I like to do oil painting, but I don't intend to make that my lifelong occupation.",
  "我可以做中英双向翻译，参加跟外国人交际谈判。": "I can translate between Chinese and English, and can participate in negotiations with foreigners.",
  "我有两张洗澡票在那儿，今天和我一起去洗澡吗？": "I have two tickets to the baths, do you want to come with me today?",
  "当他老板发现真相的时候，谎言给他带来了麻烦。": "His lie got him into trouble when his boss discovered the truth.",
  "自然从不会欺骗我们，骗我们的永远是我们自己。": "Nature never deceives us; it is always we who deceive ourselves.",
  "这不是一个漏洞，而是一个没有写进文档的特性。": "It's not a bug, it's an undocumented feature.",
  "我老婆把瓶子打破了，把厨房弄得满地都是牛奶。": "There is milk all over the kitchen floor because my wife broke the bottle.",
  "我的剑虽然是钝的，但应付你的话是绰绰有余的。": "My sword may be blunt, but that's more than enough for someone like you.",
  "可能我是反社会的，但这并不表示我不跟人说话。": "I may be antisocial, but it doesn't mean I don't talk to people.",
  "世界上有10种人：懂二进制和不懂二进制的人。": "There are 10 types of people in the world: those who understand binary, and those who don't.",
  "肯尼迪总统被刺杀了，但是他的传奇会永久长存。": "President Kennedy was killed, but his legend will live on forever.",
  "动物需要食物和饮料，而植物则需要雨水和阳光。": "As food and drink is to animals, so are rain and sunshine to plants.",
  "不要在太暗的光线下看书，那对你的眼睛不好的。": "Don't read under insufficient light, for it is bad for your eyes.",
  "汤姆和珍吵了架，但是第二天早上就和好如初了。": "Tom and Jane quarreled, but they made up the next morning.",
  "这份职位要求应征者有一定的英语口语表达能力。": "The position requires applicants to be skilled in spoken English.",
  "你应该宁可用词汇来造句，也不要试着死记硬背。": "You should use words to make sentences, rather than try to learn them with rote memorisation.",
  "姐姐在市场买了一点茄子、土豆、丝瓜和大白菜。": "Our sister bought some eggplants, potatoes, zucchinis and Chinese cabbage at the market.",
  "那也不能全怪你，刚才我一直在听歌，也没注意。": "You're not entirely to blame; just then I was listening to music all along, and wasn't paying attention.",
  "在澳大利亚的快乐协会，两百块钱可能达到效果。": "At The Happiness Institute in Australia, a couple of hundred dollars may do the trick.",
  "爱丁堡能不能向我们展示成为更健康城市的办法？": "Can Edinburgh show us the way towards healthier cities?",
  "这次，虽然我的阅历更多但是没有人等着接待我。": "This time, although I'm more experienced, there's nobody waiting to meet me.",
  "我想要一支手机, 但是我没有足够的钱买一支。": "I want a cellular phone, but I don't have enough money to pay for one.",
  "他虽然有好多女朋友，但是还不是一个花花公子。": "Even though he's got a lot of girlfriends, he's still not a player.",
  "在不久的将来，可能有一场大地震将在日本发生。": "In the near future, we may have a big earthquake in Japan.",
  "据一些学者称，现在可能随时发生一场特大地震。": "According to some scholars, a major earthquake could occur at any moment now.",
  "你说新俄罗斯人？太棒了！这正是我们所需要的！": "New Russians, you say? Wonderful! That's just what we need!",
  "照这样的情况，很抱歉，我不能接受你的盛情邀请。": "As such is the case, I am sorry I can't accept your kind invitation.",
  "电视的优点在于它给体育爱好者提供了更大的方便。": "Television has the advantage of providing sports fans with greater convenience.",
  "报纸、杂志和新闻广播讲述着世界上正在发生的事。": "Newspapers, magazines, and newscasts tell what is going on in the world.",
  "如果我是你，我会在这种困难的情况下做同样的事。": "If I were you, I would have done the same thing in such a difficult situation.",
  "不管我跟她说了多少次，她还是继续犯同样的错误。": "No matter how often I tell her, she keeps making the same mistake.",
  "我不知道这个城市，而且我一点都不懂那里的语言。": "I didn't know the city, and what's more, I couldn't speak a word of the language.",
  "除了英语，这个学校的所有学生必须多学一门外语。": "Any student of this school must learn one more foreign language besides English.",
  "有一天我去法国是无可避免的，我只是不知道何时。": "It is inevitable that I go to France someday, I just don't know when.",
  "我喜欢这个工作因为它立竿见影，让人很有成就感。": "I like this work because you see the result immediately; it's very rewarding.",
  "这个可怜的年轻人最后成为了一个了不起的艺术家。": "The poor young man finally became a great artist.",
  "知道一门语言是一回事，教这门语言又是另一回事。": "To know a language is one thing, and to teach it is another.",
  "在一个下雨的早晨，他很早出门为的是及时到学校。": "On a rainy morning he left his house early so as to be in time for school.",
  "你说得太轻了，以至于我没办法听清楚你在说什么。": "You speak so softly that I cannot quite hear what you say.",
  "我向你们承诺——我们作为一个整体将会达成目标。": "I promise you, we as a people will get there.",
  "感谢你们。上帝保佑你们。愿上帝保佑美利坚合众国": "Thank you. God bless you. And may God bless the United States of America.",
  "你不但不和我一起吃饭，反而去和另一个女生吃饭！": "Not only did you not eat with me, you went to have dinner with another girl!",
  "虽然我学了两年中文，但是我还是有很多字不认识。": "Although I have been studying Chinese for 2 years, there are still a lot of words I do not know.",
  "上海夏天的最高温度要到三十八九度，真快热死了！": "Shanghai summers can reach temperatures of up to 38-9 degrees. That is extremely hot!",
  "大家知道，今天对我们来说是一个很有意义的日子。": "As everyone knows, today is a very significant day for us.",
  "他好像对音乐剧什么的很感兴趣，而且还非常内行。": "He seems very interested in musical theatre and the like, and he also seems quite adept.",
  "苏州河是上海的母亲河，弯弯曲曲横跨流过市中心。": "River Suzhou is Shanghai's \"\"mother river\"\"; twisting and turning, it stretches across and flows through the city center.",
  "嗨，先生，黑板上的不是指数函数，而是三角函数。": "Hey, sir, the function on the blackboard is not exponential, but trigonometric.",
  "我想要一张1比250000的得克萨斯州的地图。": "I want a map of Texas on a scale of 1 to 250000.",
  "一万加五千再加五角，加起来就是一万五千零五角。": "Ten thousand plus five thousand and five cents make fifteen thousand and five cents.",
  "我是个有缺点的人，但这些缺点很容易就能被改正。": "I am not without my shortcomings, but these shortcomings can easily be amended.",
  "如果我是想吓你，我就会告诉你我几周前梦到的事。": "If I wanted to scare you, I would tell you what I dreamt about a few weeks ago.",
  "我本来预备今天去海滩的，但接着天就开始下雨了。": "I was planning on going to the beach today, but then it started to rain.",
  "我们想要听起来自然的翻译，而不需要逐字的翻译。": "We want natural-sounding translations, not word-for-word direct translations.",
  "就算是全世界跑得最快的人，也要吃饱了才跑得动。": "Even the fastest runner in the world cannot run if he is hungry.",
  "在情人节，我用玫瑰花瓣拼出了我的另一半的名字。": "For Valentine's day, I used rose petals to spell out my sweetheart's name.",
  "我倒是很想去看这场比赛，可是不知道有没有时间。": "I'd certainly like to go and watch the match; it's just that I'm not sure if I have time.",
  "它可以使一些人，尤其是老人和婴幼儿，病得很重。": "It can make some people, especially elderly people and infants, very ill.",
  "例如，在保加利亚摇头表示同意而点头表示不同意。": "For example in Bulgaria, shaking one's head means yes while nodding one's head means no.",
  "错误是经常出现还是偶尔出现？错误是否能够模仿？": "Does the error occur regularly or sporadically? Is the error reproducible?",
  "爱丁堡的水边地工程可能会把诸如此类的事情改变。": "The Edinburgh Waterfront project could be about to change all that.",
  "因为气候又暖和又湿润，所以广州一年到头都有花。": "With a warm and wet climate, Guangzhou has fresh flowers all year round.",
  "立刻派人去请医生来, 否则病人可能变得更糟糕。": "Send for the doctor at once, or the patient may get worse.",
  "在车站，我把排队买票的地点弄清楚后，开始久等。": "At the train station, once I had figured out where the queue for tickets actually was, I began the long wait.",
  "大使是为了本国的利益被派去外国撒谎的正直的人。": "An ambassador is an honest man sent to lie abroad for the good of his country.",
  "烦恼带不走明天的忧虑, 但却拿走了今天的力量。": "Worrying doesn't take away tomorrow's concerns, but it does take away today's power.",
  "日本发生规模8.9的强烈地震, 引发强大海啸。": "An earthquake, 8.9 on the Richter scale, hits Japan and causes a massive tsunami.",
  "她看上去很幸福，但是在她内心深处，她受着痛苦。": "She looks happy, but deep down, she suffers.",
  "昨天你发现我单独跟她在一块儿应该感到很惊讶吧。": "You must have been surprised to find me alone with her yesterday.",
  "德国人不愿意生产核电，但他们不反对使用邻国的。": "Germans are not willing to produce nuclear energy, but are not against using that of their neighbouring countries.",
  "没有对外语的认识，你永远无法理解外国人的沉默。": "Being unfamiliar with foreign languages, you'll never be able to understand the foreigner's silence.",
  "来吧，阿里亚娜号，不快点我们就永远到不了那儿!": "Come on, Arianna, speed up or we'll never get there!",
  "这意味着其他人只能从听你说的话来了解你和喜欢你。": "This means that others can only come to know you and like you by listening to what you say.",
  "如果不是因为有你的帮助，我不可能完成了这个工作。": "If it had not been for your help, I couldn't have completed the work.",
  "今天下午我有两个小时的英语课和两个小时的汉语课。": "This afternoon I have English class for two hours and then two hours of Chinese.",
  "当一个陌生人来和玛丽说话时，她不知道该说什么了。": "When Mary was spoken to by a stranger, she was at a loss for words.",
  "数学就像爱情，一个简单的意思，但可以变得很复杂。": "Math is like love: a simple idea, but it can get complicated.",
  "很可能等待着我们的幸福根本不是我们要的那种幸福。": "It may be that the happiness awaiting us is not at all the sort of happiness we would want.",
  "总有一些东西我永远不能学会，我的生命不是永恒的！": "There will always be things I will never learn, I don't have eternity before me!",
  "如果有帐户，你就能通过一个系统发送和接收邮件了。": "If there is already an account, there is a system by which you are able to send and receive email.",
  "他也不想洗碗，她也不想洗碗，所以他们决定出去吃。": "Neither he nor she wants to do the dishes, and so the two of them decided to eat out.",
  "你这么漂亮，况且又这么聪明，怎么可能没人追你呢？": "You're beautiful and intelligent, how is it possible that no man is chasing after you?",
  "他反复读了好几遍她寄来的信，还是没明白她的意思。": "Over and over again, he read the letter she had mailed him, but he still did not understand it.",
  "由于种种原因，他们在法国的假期没让他们感到满意。": "For one reason or another their holiday in France didn't come up to expectations.",
  "可惜，我们来到的时候，火车已经十五分钟以前走了。": "Unfortunately, by the time we got there the train had been gone for fifteen minutes.",
  "大家听了，都很高兴，觉得这个婚礼又新颖又有意义。": "Everyone listened and was very happy, thinking this wedding was both original and meaningful.",
  "如果你彩票中一千万美金的话，你会用那点钱干什么？": "If you won ten million dollars in a lottery, what would you do with that money?",
  "与其说她是我的朋友，不如说她只是一个我认识的人。": "She is more of an acquaintance than a friend.",
  "根据国土安全部的规定，目前的安全水准是橙色等级。": "The security level, as established by the Department of Homeland Security, is orange.",
  "不过现在家家人家都有浴缸，洗个澡不是挺方便的吗？": "However, these days everyone has a bathtub. Isn't it pretty simple to take a bath?",
  "如果有人问起这个故事的用意是什么，我还真不知道。": "If anyone was to ask what the point of the story is, I really don't know.",
  "当我们开始像自己护照上的照片时，我们该去度假了。": "When you're beginning to look like the photo in your passport, you should go on a holiday.",
  "宁愿做自己而被人讨厌，也不要因为虚假而被人喜欢。": "Better to be hated for who you are than loved for who you're not.",
  "它长着女人的头、狮子的身体、一双羽翅以及蛇尾巴。": "It had the head of a woman, the body of a lion, the wings of a bird, and the tail of a serpent.",
  "他难过的对我说: \"\"我很犹豫我是否应该活下来\"\".": "He told me sadly, \"\"I'm not sure whether I should be alive.\"\"",
  "我们公司的技术已经达到了发达国家九十年代的水平。": "Our company's technology has already reached the level of a developed country in the 1990s.",
  "如果你做了愚蠢的事，你就必须无怨尤接受痛苦惩罚。": "If you do silly things, you must accept the consequences without complaining.",
  "即使那家饭馆做的菜好吃极了，我也不想在那里吃饭。": "Even if that restaurant did very tasty food, I wouldn't like to eat there.",
  "一个经验丰富的律师会以其它方法来处理这个情形的。": "A more experienced lawyer would have dealt with the case in a different way.",
  "如果呼气的时候能看到自己的气，你就知道天气很冷。": "If you can see your breath when you exhale, you know it's cold.",
  "你怎么敢指责我做这种事？我决不会动手打我的儿子。": "How can you accuse me of such a thing? I would never lay a hand on my child.",
  "我卖了房子和家具，连同我的手饰一起才凑了五十万。": "I sold my house and furniture, together with my jewelry, in order to scrape together a half a million.",
  "对于仅次于伦敦、发展第二快的城市，这是个好消息。": "For the UK's fastest growing city after London, this is good news.",
  "春季的时候，中国北边很冷，所以在外边的花不开花。": "North China is cold in spring, so flowers don't bloom outdoors.",
  "我很晚才到了哈尔滨，等出租汽车的队伍已经长极了。": "I didn't arrive in Harbin until very late, and the queue for taxis was already extremely long.",
  "如果你认为我还会帮你这样的混蛋，那你大错特错了。": "If you think that I'm still going to help a bastard like you, then you couldn't be any further away from the truth.",
  "她作为一个喜欢动手实践的人常常把朋友的汽车修好。": "As she's a very practical person, she often fixes her friends' cars.",
  "别担心! 即使我喝酒了, 它对我的驾驶没有影响。": "Don't worry! Even if I drink, it doesn't have an effect on my driving.",
  "正如身体需要锻炼，所以心灵需要刺激才能保持健康。": "Just as the body needs exercise, so the mind needs stimulation to stay healthy.",
  "你觉得绕路的司机占所有的出租车司机的百分之多少？": "What percentage of all taxi drivers make unscrupulous detours, do you think?",
  "看完研究以后，我们其中大部分人论定疫苗是件好事。": "After looking at the research, most of us conclude that vaccines are a good thing.",
  "诚在艾尔斯岩上找到了自己真正的爱情。她来自大阪。": "Makoto found his true love on top of Ayers Rock. She's from Osaka.",
  "一个从俄勒冈州来的朋友，布朗先生明天会来拜访我们。": "Mr. Brown, a friend from Oregon, will visit us tomorrow.",
  "他为美国承受了比我们大多数人所能想象的更多的牺牲。": "He has endured sacrifices for America that most of us cannot begin to imagine.",
  "根据你所说的话，我认为我们应该重新审视我们的计划。": "In the light of what you told us, I think we should revise our plan.",
  "和一个只说\"\"是\"\"与\"\"否\"\"的人维持一段对话是很难的。": "It is difficult to keep up a conversation with someone who only says \"\"yes\"\" and \"\"no\"\".",
  "这个科幻故事似乎很有趣。你看完的时候能不能借给我？": "This science fiction story seems interesting. Will you lend it to me when you have finished reading it?",
  "演讲者不熟悉他的主题，说得又不好，总之，他很糟糕。": "The speaker didn't know his subject, nor did he speak well; in short, he was disappointing.",
  "除了那些我们尝试过的政府形态，民主是最差的那种了。": "Democracy is the worst form of government, except all the others that have been tried.",
  "50年代，芬兰人被认为是世界上饮食最不健康的例子。": "In the 1950's, the Finns were cited as having one of the least healthy diets in the world.",
  "直到我游览了澳大利亚之后，我才意识到日本是多幺小。": "It wasn't until after visiting Australia that I realized Japan was so small.",
  "我意识到这个可怕的地下室是唯一可以救我们命的地方。": "I realized then that this awful cellar was the only place that could save our lives.",
  "中国政府控制了网络，以免让人民知道六四事件的真相。": "The Chinese government controlled the internet to prevent the people from knowing the truth of the Tiananmen Square Massacre.",
  "理论上说，理论和实践没有区别。但实践上说，是有的。": "In theory, there is no difference between theory and practice. But, in practice, there is.",
  "萨尔曼·鲁西迪的《撒旦诗篇》是现代文学的真正的杰作": "“The Satanic Verses” by Salman Rushdie is a real masterpiece of modern literature.",
  "这儿周围有没有小菜场跟大型超市，买生活用品方便吗？": "Are there any markets or supermarkets around here? Is it convenient for daily shopping?",
  "请问，我要用美元换人民币，这儿可以换给我人民币吗？": "Excuse me, I'd like to exchange US dollars for RMB - can I get RMB here?",
  "既然房间里新家具都买好了，这点破家具都可以丢掉了！": "Now that we've bought new furniture for the room, why not throw away this old, worn-out furniture?",
  "严禁卖淫嫖娼，赌博，吸毒，酗酒滋事等违法犯罪活动！": "Prostitution, gambling, the use of narcotic substances, drunkenness, disorder, and all other illegal activities are STRICTLY FORBIDDEN.",
  "如果你不明白一件事，那是因为你没有意识到它的背景。": "If you don't understand something, it's because you aren't aware of its context.",
  "有时候冰球运动员相互挑衅得太厉害以至于会引发斗殴。": "Sometimes hockey players get so competitive that fights break out.",
  "我们小时候，所有的一切对我们来说都显得那么大。。。": "When we are small, everything seems so big.",
  "我在人来人往的街道上走着，突然听见一下尖锐的叫声。": "I was walking along the crowded street when all at once I heard a shrill cry.",
  "关于这个问题，我觉得垃圾媒体只报道了很片面的信息。": "Concerning this issue, I feel that the trash media only report biased information.",
  "父亲生前留下来的老古董，原来只是一堆不值钱的垃圾。": "The antiques my father left when he died turned out to be nothing but worthless junk.",
  "关于财务方面的事项，公司里没有人比琼斯先生更了解。": "With respect to financial matters, Mr Jones knows more than anyone else in the company.",
  "其实我工作并不多，但足以让我这周在办公室里忙着了。": "I don't have a lot of work, but it's enough to keep me in the office this week.",
  "在中国，身高 1.1 米以下的儿童坐火车不用买票。": "In China, children shorter than 1.1m don't need to buy a ticket to travel by train.",
  "跟异性交往最重要的不是他有多好,而是他对你有多好。": "The most important thing about relations with the opposite sex is not how good the other person is, but that they treat you well.",
  "感情最重要的是在于他对你的好,而不是他自己有多好。": "The most important thing in a relationship lies in how good your partner is to you, and not in how good they are themselves.",
  "融化中的极地冰盖也可以使海平面上涨的势态更加严重。": "Melting polar icecaps could also contribute to an increase in sea levels.",
  "旗袍是一种17世纪起源于中国的传统式样的女性服装。": "The qipao is a classic female garment that originated in 17th century China.",
  "熊猫在四川省土生土长，不在任何其他省份的野外生活。": "The panda is indigenous to Sichuan Province and does not live in the wild in any other places.",
  "他不太能喝酒，但是朋友都喜欢喝，所以他往往会喝醉。": "He's not a big drinker, but his friends all like to drink, so he often gets drunk.",
  "我不能禁止一个人娶好几个妻子，因为这与圣经不矛盾。": "I cannot forbid a person to marry several wives, for it does not contradict Scripture.",
  "妈妈，我能吃一块饼干吗？ \"\"不行，不该在3餐间吃。\"\"": "Mum, can I have a biscuit? \"\"No, you shouldn't eat between meals.\"\"",
  "我想要打个电话到日本东京，号码是3202－5625。": "I'd like to make a call to Tokyo, Japan. The number is 3202-5625.",
  "我想用媒体播放器听音乐，却出现了错误讯息，不能播放。": "When I try to listen to music with media player there's an error and I can't play the file.",
  "实践和理论同样重要，但我们倾向于重视后者而忽略前者。": "Practice is as important as theory, but we are apt to value the latter and despise the former.",
  "男人老不老,自己心中有数;女人老不老,别人一目了然.": "A man is as old as he feels and a woman as old as she looks.",
  "越来越多的女人拥有自己的事业并实现和丈夫的经济独立。": "More and more women have their own careers and are economically independent of their husbands.",
  "大部分程序员讨厌调试，设置故障比纠正它们有意思多了。": "Most developers hate debugging; it's more fun to create bugs than to correct them.",
  "我不喜欢出去玩，常常在家泡壶咖啡，跟朋友下围棋象棋。": "I don't like going out to have fun. Usually, I make my own coffee at home, and have a game of chess with a friend.",
  "上海那么繁荣，主要是一百六十年前开埠以后发生的变化。": "Shanghai is so prosperous; notably it was after the port was opened for trade one hundred and sixty years ago that things started to change.",
  "在公园里，我看到一个年轻人躺在一棵樱桃树下的长椅上。": "I saw a young man lying on the bench under the cherry tree in the park.",
  "我是一个认真的文员，在家里，我是一个好妻子兼好母亲。": "I am a serious clerk, and at home, I am a good wife and mother.",
  "这可能是个蠢问题，但是一头老虎和一头狮子哪个更厉害？": "This may be a silly question, but which is stronger - a tiger or a lion?",
  "若同期的人先一步完成销售目标，我也不能再吊儿郎当了。": "When one of my coworkers starts racking up good sales figures I can't let down my guard.",
  "如果两个人总是意见相同，那么他们其中一个就没必要了。": "If two men always have the same opinion, one of them is unnecessary.",
  "我母亲宁愿选彩票机上的任意数字，也不选我的幸运数字。": "My mother prefers the arbitrary selection of the lottery machines over my lucky numbers.",
  "老师肯定厌倦了一遍又一遍地纠正学生试卷中同样的错误。": "Teachers must be tired of correcting the same mistakes over and over again in their students' papers.",
  "五成熟牛排见了七成熟牛排为什么不打招呼？两个都不熟。": "Why didn't the half-cooked steak say hello to the nearly-cooked steak when the two saw each other? They both weren't ready.",
  "你知道那么多关于中文的东西，就好像你是中国人一样啊。": "You know so many things about the Chinese language... It's just as if you were Chinese yourself.",
  "请勿更改没有错误的句子。请添加一个新的更自然的翻译。": "Don't change sentences that are correct. You can, instead, submit natural-sounding alternative translations.",
  "老王身体检查的结果别的方面都挺正常，就是血压有点高。": "In other aspects, the results of Laowang's health examination were all quite normal; it was just that his blood pressure was a bit high.",
  "这将会是巨大的，如果你可以挑选一些面包，然后再回家。": "It'd be great if you could pick up some bread before you come home.",
  "我找商店经理谈了话，因为他拒绝为那不能用的电视退钱。": "I had words with the manager of that store, because he refused to refund my money for the TV set that wasn't operating properly.",
  "杀害大象、老虎等濒危物种，不仅是残忍的，也是非法的。": "Murdering elephants, tigers and other endangered species is not just cruel; it's also illegal.",
  "越来越多的环保者开始宣传和使用环保的无铅汽油的汽车。": "More and more environmentalists advocate and use environmentally friendly unleaded petrol in cars.",
  "高达百分之九十的快乐来自看法、生活控制、关系等因素。": "As much as 90 percent of happiness comes from elements such as attitude, life control and relationships.",
  "这房子在附近，两室一厅，装修也不错，一个月1500。": "This house is nearby, it has two bedrooms and a living room, and the decoration isn't bad; it's 1500 a month.",
  "尽管在剑桥学习压力很大，很多学生还是有时间出去玩儿。": "Although the pressure of studying at the University of Cambridge is very high, many students still have time to go out and have fun.",
  "尽管现在中国人的生活越来越好了，可是还有改进的余地。": "Although the life of Chinese people is getting better and better now, there is still room for improvement.",
  "我不知道这份礼物应该给谁：给女孩子呢，还是给男孩子？": "I'm not sure who I should give this present to, the girl or the boy?",
  "我发现了我办公桌上有张字条, 但是我不知道是谁写的。": "I noticed a note on my desk, but I do not know who wrote it.",
  "我们看东西不是看其实质，而是以我们的主观意识看它们的。": "We don't see things as they are, but as we are.",
  "我们的任务到目前为止很轻松，但从现在开始将会变得很难。": "Our task has been easy so far, but it will be difficult from now on.",
  "我不管你们的名字叫什么。一旦工作完成，我就从这儿离开。": "I don't care what your names are. Once this job's over, I'm out of here.",
  "虽然我很想知道他的名字，只是我的胆子太小了，不敢去问。": "Even though I really want to know his name, I don't have enough courage, and I'm afraid to go ask.",
  "尽管他是一周前才开始学中文的，然而他已经认识很多字了。": "Despite the fact that he has only just started learning Chinese, he already knows lots of characters.",
  "下个礼拜除了星期一星期三有事，我其他日子都有空在那儿。": "Next week I have things to do except on Monday and Wednesday, I am free on all the other days though.",
  "从苏黎世到波士顿坐飞机要八个小时，但是返回时只要六个。": "It takes eight hours to fly from Zurich to Boston, but only six for the return trip.",
  "甚至是不相信天主教的人也把教皇敬为一个象征性的领导者。": "Even people who don't believe in the Catholic church venerate the Pope as a symbolic leader.",
  "以前的人不知道地球是圆的，也不知道地球是绕着太阳转的。": "Formerly people did not know that the earth is round and that it moves around the sun.",
  "一个成长中的孩子如果没有充足的能量，可能需要药物治疗。": "A growing child who doesn't seem to have much energy perhaps needs medical attention.",
  "一开始许多事情看上去不同了，但我很快习惯了我的新生活。": "At first many things seemed different, but I soon got involved in my new life.",
  "他的第三点说明的是，埃米特试图协调现实与他的理论设计。": "The third point to make is that Emmet attempted to harmonize his theory with the reality of designing.",
  "大熊猫被认为是中国的国宝，但在一些保护区，它仍被偷猎。": "The giant panda is recognised as a national treasure of China, but in some conservation areas it is still killed by poachers.",
  "在英国，以珍稀物种为主题的公园变得越来越受人们的欢迎。": "In England, parks taking rare breeds of animals as their theme are becoming increasingly popular with people.",
  "在中国，提到过年，许多人想到的都是一家围在一起包饺子。": "If you mention New Year in China, the image that many people will think of is a family gathered around wrapping dumplings together.",
  "婚姻生活固然有许多痛苦的地方，但单身也绝不是一件乐事。": "Marriage has many pains, but celibacy has no pleasures.",
  "我见到了两辆汽车：一辆红的和一辆白的。红的比白的好看。": "I saw a red car and a white one. The red one was nicer looking than the white one.",
  "爱丁堡的水边地工程只是许多重建联合王国城镇的工程之一。": "Edinburgh's Waterfront is just one of the many projects that are regenerating UK towns and cities.",
  "国际野生动物基金在一九六一年创办的时候，以熊猫为象征。": "When the World Wildlife Fund was founded in 1961, it took the panda as its symbol.",
  "农村的女孩喜欢把红色的纸裁减成桃和李的花及贴在门窗上。": "Country girls like to cut red paper into peach and plum blossoms and paste them onto doors and windows.",
  "喂！这里有个会说维语的美国人！快来把他的电脑检查一下！": "Hey! There's an American who speaks Uyghur here! Hurry up and get over here to inspect his computer!",
  "因为这是一个有好几层的瀑布，所以速度慢也不会让人惊讶。": "As this is a cascade with multiple layers, it shouldn't be surprising that it's slow.",
  "不是因为读者对某本书不感兴趣，这本书就肯定是有问题的了。": "Just because a certain book does not interest readers does not mean that the fault lies in the book.",
  "人不是为失败而生的, 一个人可以被毁灭, 但不能给打败。": "But a man is not made for defeat. A man can be destroyed but not defeated.",
  "因为现在上海家家都是独生子女，家长对小孩的读书非常重视。": "Because families in Shanghai today have only one son or daughter, the head of the family places a strong emphasis on their childs studying.",
  "据说日本人对他们认识的人非常友好，对不认识的人非常冷淡。": "It is said that the Japanese are very friendly to those that they know, and very indifferent to those they don't.",
  "要用智慧来理解智慧：如果听众是聋的话，那音乐什么都不是。": "It requires wisdom to understand wisdom: the music is nothing if the audience is deaf.",
  "国王受够了他的大臣们总是对他阿谀奉承，于是把他们遣散了。": "The king was tired of his sycophants always praising him, so he sent them away.",
  "即使你的句子实际上是毫无意义的，至少你有幸能造出好句子。": "Even if your sentences were actually senseless, you at least have the luck to be able to form beautiful sentences.",
  "说因为学生不够努力，老师应该布置更多回家作业的傻瓜是谁？": "Who are the idiots who said that teachers should push for larger amounts of homework, seeing as the students don't work enough?",
  "这个词指的是由于大气层里二氧化碳含量增多而导致全球变暖。": "It is a term used to describe the warming of the earth due to increasing amounts of carbon dioxide in the atmosphere.",
  "住在海边的人可能失去他们的家，并且城市可能会被完全淹没。": "People living on coastlines might lose their homes, and cities might be completely submerged.",
  "现在中国公认的标准旗袍的现代版本是首先在上海发展起来的。": "The modern version, which is now popularly recognized in China as the standard qipao, was first developed in Shanghai after 1900.",
  "旗袍因有与众不同的特点而在国际时尚界享有与日俱增的名望。": "With its distinctive Chinese features, the qipao enjoys growing popularity in the international world of high fashion.",
  "他们以摇头表示不同意，而其他国家的人可能以摇头表示同意。": "They express disagreement by shaking their heads, which may indicate agreement in other countries.",
  "中国农历年的一月一日为春节，是中国人民最隆重的传统节日。": "The first day of the first month in the Chinese lunar calendar is Spring Festival, the most important festival for the people of China.",
  "中国福建省福州市动物园在训练大熊猫方面做得比它的同行多。": "The Fuzhou Zoo in China's Fujian Province has done more than its counterparts in training pandas.",
  "但是，我一看到在火车站的场面是就开始对这个决定表示遗憾。": "However, as soon as I saw the situation at the train station I began to regret this decision.",
  "想要跟你分享他们宗教信仰的人几乎从不愿你跟他们分享你的。": "People who want to share their religious views with you almost never want you to share yours with them.",
  "每次我坠入爱河，爸爸就告诉我那个女孩是我同父异母的妹妹。": "Every time I fall in love, Dad tells me the girl is my half sister.",
  "他对日本的历史非常感兴趣。我们很惊讶他在这方面的丰富知识。": "He is very much interested in Japanese history. We are surprised at his vast knowledge of the subject.",
  "我们必须学会像兄弟一样共同生活，要么就像傻子一样同归于尽。": "We must learn to live together as brothers, or we will perish together as fools.",
  "为了让我们和大家都记住这个日子，我请大家跟我们一起来种树。": "In order to make us and everyone else remember this day, I ask everyone to plant a tree with us.",
  "他一直好好的，却突然死去了。未来的事情，实在是无法预知的。": "He was so healthy up to the minute of his sudden death. You really never know what might happen next.",
  "十、二十、三十、四十、五十、六十、七十、八十、九十、一百。": "Ten, twenty, thirty, forty, fifty, sixty, seventy, eighty, ninety, hundred.",
  "专家说只有百分之十五左右的快乐来自收入、资产等财政的因素。": "Experts say only about 15 percent of happiness comes from income, assets and other financial factors.",
  "他们的四合院要小得多，设计和装饰也比较简单，胡同也比较窄。": "Their siheyuans were far smaller in scale and simpler in design and decoration, and the hutongs were narrower.",
  "请把发给你的那张单子看一下，再确认一下所有的句子都很通顺。": "Read the list we sent you and check that all the sentences sound natural to you.",
  "第一次，我差不多完全不会普通话，而且不懂中国的常规和传统。": "The first time, I spoke pretty much no Chinese at all, and didn't understand China's conventions and customs.",
  "我在我的行李上附上了有我名字的标签, 但是它很快就剥落了。": "I attached my name-tag to my baggage, but it soon came off.",
  "翻译就像一个女人。她漂亮就会不忠诚；她忠诚就肯定不会漂亮。": "Translation is like a woman. If it is beautiful, it is not faithful. If it is faithful, it is most certainly not beautiful.",
  "你如果看见圣灵降下，落在谁身上，谁就是用圣灵替人施洗的了。": "The man on whom you see the Spirit come down and remain is he who will baptize with the Holy Spirit.",
  "上海以前有许多小河浜，其中有肇家浜、洋泾浜，现在都被填了。": "There used to be a lot of small creeks in old time Shanghai, which included Zhaojia Creek and Yangjing Creek, but they're all covered up nowadays.",
  "在这种困难的时候，任何寻常的努力都无法使我们的公司摆脱赤字。": "In hard times like this, no ordinary effort can get our company out of the red.",
  "我喜欢这幅画，不仅是因为它的名气，而是因为它真的是一个杰作。": "I like this picture, not just because it is famous, but because it really is a masterpiece.",
  "他承诺给这个地区带来新的工业，但是政治家很少完成他们的承诺。": "He promised to bring new industries to the region, but politicians rarely keep their word.",
  "冯迪索在做俯卧撑时，并不是把自身往上推，而是在把地球向下推。": "When Vin Diesel does pushups, he's not pushing himself up - he's pushing the Earth down.",
  "老师又说，她的婚礼跟别人不一样，我们问怎么不一样，老师不说。": "Our teacher also said that her wedding wouldn't be the same as other people's; we asked how it would be different, but she didn't say.",
  "战争不是轻易就应该开始的，所以也不能够因为像打仗就改变宪法。": "War isn't something to be done lightly, also changing the constitution isn't something that should be done because \"\"I just really want to go to war\"\".",
  "我不喜欢那些数学家知道的比我多得多，却不知道清楚地表达自己。": "I don't like it when mathematicians who know much more than I do can't express themselves explicitly.",
  "根据美国国民的一个投票，人们普遍认为穆斯林人和恐怖主义有关。": "It is a prevalent belief, according to a nationwide poll in the United States, that Muslims are linked with terrorism.",
  "一些大学生在假期去非洲做志愿者 ，帮助当地完善野生生物管理。": "During the holidays, some university students go to Africa as volunteers and help to perfect local wildlife conservation.",
  "为了提高出生率，中国政府花了很多钱在大熊猫成功繁殖的研究上。": "The Chinese government has spent a lot of money on research into successful panda breeding in order to increase their birth rate.",
  "你们把自行车留下，明天带着身份证和20块钱到交通局领自行车。": "Leave the bike here, and tomorrow bring your ID and 20 dollars to the Bureau of Communications to get the bike back.",
  "电车会把这个地区连接于爱丁堡的城市中心（离那里只有两英里）。": "Trams will link the area to Edinburgh's city centre (which is only two miles away).",
  "水边地工程会帮助爱丁堡城市紧随形势并使更多人来苏格兰的首都。": "The Waterfront project will help to keep Edinburgh up-to-date and bring more people to Scotland's capital city.",
  "我在中国最后的目的地是东北的哈尔滨，离北京大概一千公里左右。": "My final destination in China is the city of Harbin in the north-east, about one thousand kilometres from Beijing.",
  "卢梭是疯狂的, 但有影响力; 休谟是理智的, 但没有追随者。": "Rousseau was mad but influential; Hume was sane but had no followers.",
  "人类登上月球、柏林墙倒下，世界被我们的科学和想像被连接在一起。": "A man touched down on the moon. A wall came down in Berlin. A world was connected by our own science and imagination.",
  "你和你妈用上海话聊天的时候，我只听得懂几个词，所以我插不上话。": "When you speak Shanghainese with your mum, I only understand a few words, so I can't join in the conversation.",
  "我有时候走路去上班，有时候骑自行车去上班，因为我家离单位很近。": "Sometimes I walk to work, and sometimes I ride my bike, because I live very close to work.",
  "我打电话给你，一来是想请你吃饭，二来是想告诉你我儿子要结婚了。": "I called you, on the one hand to invite you out to eat, and on the other to tell you my son is going to get married.",
  "没有你的钥匙的话，你还是进不去，所以你不放来跟我们一起吃晚饭。": "You can't get in without your key anyway, so you may as well come to have supper with us.",
  "上课时她是我们的老师，下课以后是我们的朋友，而且是很好的朋友。": "In class she's our teacher; after class she's our friend, and a good friend too.",
  "友情提示：请留意您需要换乘线路的首末班时间，以免耽误您的出行。": "Friendly Reminder: Please keep in mind the closing time of the line you need to switch to, so as to avoid delays in your trip.",
  "或许是因为他有胡子而让他乍看之下很可怕，其实他是个非常好的人。": "Possibly because he's got a beard, he looks scary at first glance but he's really a kind man.",
  "如果我们不做更多的努力去保护雨林，很多其中的稀有物种将会灭绝。": "If we don't make the utmost effort to protect the rainforests, many of the rare species in them will become extinct.",
  "由于一些工厂使用矿物燃料，化学品的排放已经产生严重的环境问题。": "As a result of some factories using fossil fuels, chemical emissions have already caused serious environmental problems.",
  "否则，用左手传递食物会被认为是不礼貌的，因为左手是用来洗澡的。": "Otherwise, it is considered impolite to pass food with the left hand, because the left hand is used for bathing.",
  "最近，有些胡同被指定为保护区，以试图保存这方面的中国文化历史。": "More recently, some hutongs have been designated as protected areas in an attempt to preserve this aspect of Chinese cultural history.",
  "越多奶酪越多洞。洞越多则奶酪越少。因此: 奶酪越多就越少奶酪。": "The more cheese, the more holes. The more holes, the less cheese. Thus: The more cheese, the less cheese.",
  "我在校庆后打扫的时候弄掉了一把学校的钥匙，我被迫写了一份检讨。": "I lost a school key when I was cleaning up after the school festival and I was then required to write an apology letter.",
  "如果他们必须先学拉丁文的话，是没有时间让罗马人征服世界的对吧。": "The Romans would never have had enough time for conquering the world if they had first been required to study Latin.",
  "现在的孩子认为解决任何生活问题都像重新开始一个电脑游戏那么简单。": "Kids these days think that any issue in life can be resolved as easily as restarting a computer game.",
  "在奥运会的竞赛中，金牌代表第一名，银牌代表第二名，铜牌是第三名。": "In Olympic competitions, a gold medal is for first place, a silver medal for second, and a bronze medal is for third place.",
  "这意味着对利用能源、耗费资金和制造污染的空调的使用有了大幅增长。": "It means a huge increase in the use of air conditioning which uses energy, which costs money and creates pollution.",
  "爱丁堡已经供应一个繁忙而传统的城市，有许多历史性的建筑物和名胜。": "Edinburgh already offers a busy and traditional city experience, with many historic buildings and tourist attractions.",
  "据估计只有几百只遗留的熊猫，其中的少数圈养在中国和国外的动物园。": "It is estimated that only a few hundred pandas remain, with a small number of them being raised in zoos in China and abroad.",
  "伯拉罕·林肯，美国第16任总统，生于肯塔基州的一个简陋的小屋里。": "Abraham Lincoln, the 16th president of the United States, was born in a log cabin in Kentucky.",
  "由于农业的发展，食品全球产量能够跟上人口的增长，但只是牺牲了将来。": "Thanks to the development of agricultural science, world food production has managed to keep up with population growth - but only at the expense of the future.",
  "随着无继承人的国王的发疯和王室家族的中毒，将军终于有机会篡夺王位。": "With the heirless king going crazy and royal family poisoned, the general of the army finally had his chance to usurp the throne.",
  "该报文章中将被告人描述成一个罪魁祸首，尽管他已经被证明是无辜的了。": "The news article painted the defendant as a guilty man, even though he had been proven innocent.",
  "因为保险公司的需要，我能够留下您的姓名，您的地址和您的电话号码么？": "Could I write down your name, address and phone number, for the insurance company?",
  "我每次去巴黎，都会去圣心大教堂，坐在台阶上，听下面的人唱歌、弹琴。": "Every time I go to Paris, I visit the Sacred Heart Basilica, sit on the steps, and listen to the people below singing and playing musical instruments.",
  "我们应该尽我们最大的努力减少塑料包装的使用，并回收所有的塑料废物。": "We must make the utmost effort to reduce the use of plastic packaging, and also to recycle all waste plastic.",
  "一些人只买有机的食物，他们认为这样可以使他们的健康不受污染的损害。": "Some people only buy organic food; they think that in this way their body will not be damaged by pollutants.",
  "来自国家发展和改革委员会的数据显示，互联网在中国农村地区发展迅猛。": "As figures from the National Development and Reform Committee show, the Internet has developed rapidly in rural China.",
  "奶酪是由母牛、山羊、绵羊或其它哺乳动物的奶被加工制造的坚硬的食物。": "Cheese is a solid food made from the milk of cows, goats, sheep, and other mammals.",
  "冷不防，老师让每个国家的学生用话筒给大家讲一下自己来哈尔滨的原因。": "Without warning, the teachers ask students from each country to take the microphone and explain to everyone their reasons for coming to Harbin.",
  "那些自认为讨厌电脑的人就是这么回事。他们真正讨厌的是差劲的程序员。": "That's the thing about people who think they hate computers. What they really hate is lousy programmers.",
  "我打电话给你，一方面是想请你吃饭，另一方面是想告诉你我儿子要结婚了。": "On the one hand I called you to invite you to dinner, on the other to tell you my son is getting married.",
  "其实，书面语我搞得相当好，但是口语中，我经常会记不起来某个字的音调。": "I'm actually relatively good at written language, but with spoken language I often can't remember the tone on some word.",
  "新的旗袍又修长又紧身，也有高级的剪裁，与传统式样的构成了鲜明的对比。": "Slender and form-fitting with a high cut, the new qipao contrasted sharply with the traditional one.",
  "我和他用世界语沟通，觉得最少从语言的观点来看，我和他的程度是差不多的。": "Using Esperanto with him, I sense that we both are at the same level, at least from a linguistic point of view.",
  "到了四十年代，旗袍有了种类繁多的图案和面料，也有了同样种类繁多的饰品。": "By the 1940s, the qipao came in a wide variety of designs and fabrics, with an equally wide variety of accessories.",
  "要是你注意你的外国朋友，可能会对他们跟你不一样的传统和习惯而感到惊讶。": "If you pay attention to your foreign friends, you may be surprised that their customs and habits are different from yours.",
  "百分之十五的房屋将是经济适用，所以低收入家庭会在这个地区买或者租房子。": "Fifteen per cent of the housing will be affordable, so that low-income families will be able to buy or rent homes in the area.",
  "用疑问代词表任指格式改写下面的句子，根据需要可以增加或者减少一些词语。": "Use interrogative pronouns to rewrite the sentences below; if you need to, you can add or remove a few words.",
  "他决定不买那个房子了，首先是因为太贵了，其次是因为离他的办公室太远了。": "He decided not to buy the house, because in the first place it was too expensive, and in the second place it was too far from his office.",
  "但最重要的是，我永远不会忘记这场胜利真正属于谁，它属于你们，它属于你们。": "But above all, I will never forget who this victory truly belongs to. It belongs to you. It belongs to you.",
  "请给您所译的句子一个良好的翻译。请勿让其他语言的翻译影响到您所做的翻译。": "Make a good translation of the sentence that you are translating. Don't let translations into other languages influence you.",
  "同期中国城镇网民人数达一亿两千五百万人，占城镇总人口的百分之二十一点六。": "In the same period, the number of urban netizens in China reached one hundred and twenty five million, making up 21.6% of the total urban population.",
  "预定机票时我决定最容易的办法就是先坐飞机到北京，然后坐火车完成我的旅程。": "When booking flights, I decided the easiest way would be to fly to Beijing first, then get the train to complete my journey.",
  "幸运的是大家都明白了这个老外的意思，知道我只是闹笑话而友好地对我笑一下。": "Fortunately, everybody understood what this foreigner meant, knew I was only making a fool of myself, and laughed at me.",
  "你的尿液是什么颜色的：浅色的、深黄色的、浅红色的还是像啤酒一样的咖啡色？": "What color is your urine: clear, dark yellow, reddish, or brown like beer?",
  "当我们想到男女在社会中的传统角色时，我们认为丈夫养家，妻子照顾孩子和家庭。": "When we think of the traditional roles of men and women in society, we think of husbands supporting the family, and wives taking care of the house and children.",
  "从来没有见过有谁能仅通过读书就能学会打篮球的，其实学习外语也是一样的道理。": "I've never met anyone who was able to learn how to play basketball just by reading a book. The same holds true for learning foreign languages as well.",
  "在一些农村地区，互联网主要用于农业信息以及农产品技术和价格信息等特殊目的。": "In some rural areas, the Internet is important for agricultural information, as well as being particularly useful for the purposes of agricultural production technologies and pricing.",
  "彼得是一个利他主义的游戏玩家，他会把东西给需要的人，而不是为一己之私利出售。": "Peter was an altruistic video game player; he would give items to people who needed them, rather than selling them for personal profit.",
  "人们热切地寻求更有现代风格的衣服，所以把以前的旗袍改成了适合他们品位的东西。": "People eagerly sought a more modernised style of dress and transformed the old qipao to suit their tastes.",
  "因为几乎所有的四合院有南面的门和主要楼房，所以大部分的胡同是从东到西建造的。": "Nearly all siheyuans had their main buildings and gates facing south for better lighting, so a majority of hutongs run from east to west.",
  "尤其是在中国北方，包饺子、吃饺子，已经成为大多数家庭欢度除夕的一个重要活动。": "Especially in northern China, wrapping and eating dumplings has become an important activity for happily spending New Year's Eve in many households.",
  "为了更好地理解一家公司的文化，你应该考虑下面的论点，并看公司把它们怎么处理。": "To better understand what a company’s culture is you should consider the following points and see how the company deals with them.",
  "我希望可以更紧张我的成绩，但是似乎在我生命的某一刻，我决定它将不再那么重要了。": "I wish I could care more about my grades but it seems that, at a certain point of my life, I decided they wouldn't be so important anymore.",
  "质数就像生活，它们是完全符合逻辑的，但即使我们花所有时间来思考，也找不到规律。": "Prime numbers are like life; they are completely logical, but impossible to find the rules for, even if you spend all your time thinking about it.",
  "婚礼上饮料和食物那么丰富以至于那对年轻的新人开始怀疑他们本不该邀请更多的客人。": "Food and drink were served in such profusion at the wedding that the bride and groom began to wonder if they should not have invited more guests.",
  "两军对敌，能战的当战，不能战的当守，不能守的当走，不能走的当降，不能降的当死。": "When two armies oppose one another, those who can fight should fight, those who can't fight should guard, those who can't guard should flee, those who can't flee should surrender, and those who can't surrender should die.",
  "一百， 二百， 三百， 四百， 五百， 六百， 七百， 八百， 九百， 一千。": "One hundred, two hundred, three hundred, four hundred, five hundred, six hundred, seven hundred, eight hundred, nine hundred, one thousand.",
  "现在许多年轻人工作都不太安分，朋友的儿子大学毕业不到两年，已经换了五个工作了。": "These days many young people work without much focus; my friend's son hadn't gone two years after graduating before he'd changed jobs five times.",
  "我对这个政府的印象是，他们需要强一点儿的经济政策，要不然将来会遇到很大的问题。": "My impression of this government is that they need a more forceful economic policy, otherwise they'll encounter large problems in the future.",
  "经济萧条是一段时间内，当这样的经济活动普遍增长而造成的一种临时性的经济活动衰退。": "Recession is a temporary falling off of business activity during a period when such activity is generally increasing.",
  "911事件让世人震惊，全球所有的政治家都一致谴责恐怖分子的这一应受人斥责的行径。": "Shocked by the events of September 11th, politicians all over the world condemned the terrorists for their reprehensible deed.",
  "研究表明人们一有住处、食物这些基本的需要，附加的财富就不能大量地提高他们的快乐。": "Studies show that once the basic needs of shelter and food are met, additional wealth adds very little to happiness.",
  "这些高官和富商的大四合院常常有精美雕刻并粉刷的横梁和柱子，并伴有精心修剪的花园。": "The large siheyuans of these high-ranking officials and wealthy merchants often featured beautifully carved and painted roof beams and pillars and carefully landscaped gardens.",
  "他提出了一个勇敢而孤独的斗争，但这些沉重的打击，他的赔率不能得到他的商业计划接受。": "He put up a brave and lone struggle, but up against such heavy odds he couldn't get his business plan accepted.",
  "国家发展和改革委员会的报告说，农村电信基础设施的快速推进是网民人数增长的主要原因。": "The report from the National Development and Reform Committee says that the advance in rural high-speed telecommunication infrastructure is the main reason for the increase in Internet users.",
  "某些失明者会产生一个弥补性的能力，这个能力让他们察觉到他们与离他们很近的物体的距离。": "Blind people sometimes develop a compensatory ability to sense the proximity of objects around them.",
  "当移居者的村庄被野蛮人征服后，他们的希望和生活到了痛苦的尽头，数年对灾祸的抵抗结束了。": "Years of resistance to misfortune ended when the settlers' village was overcome by the savages and their hopes and lives came to the bitter end.",
  "二十世纪中以后，北京胡同的数量显著地下降，因为人们把它们拆毁以便给新的楼房和街路让路。": "Since the mid-20th century, the number of hutongs in Beijing has dropped dramatically as they are demolished to make way for new roads and buildings.",
  "当我问人家高中时代他们最后悔的是什么时，他们几乎所有人都回答一致：他们浪费了那么多时间。": "When I ask people what they regret most about high school, they nearly all say the same thing: that they wasted so much time.",
  "截至二零零七年六月底，中国农村网民人数达三千七百四十一万人，占农村总人口约百分之五点一。": "By the end of June 2006, the number of netizens in rural China had reached three million, seven hundred and forty one thousand, making up 5.1% of the total rural population.",
  "就是冷战几十年后的今天，德国人和俄罗斯人之间还有很多伤痛，尤其是在那些被苏联占领的地区。": "Even now, many years after the Cold War, there is still much bitterness between Germans and Russians, especially in areas which were occupied by the Soviet Union.",
  "虽然我们大多数人比我们的父母、祖父母还要富裕得多，但是与之相应的快乐程度却没有多大的改变。": "While most of us are significantly better off financially than our parents and grandparents, happiness levels haven't changed to reflect that.",
  "当我在我母亲的子宫里, 我从我母亲的肚脐看到我将要出生的房子, 我心想: 我不要到那里。\"\"": "When I was inside my mother's womb, I looked through my mother's navel at the house where I would be born and I thought: \"\"No way I'm going there\"\".",
  "仍有在孩子熟睡后仍难以入眠的父母，他们担心如何偿还按揭月供、付医药费或是存够钱让孩子上大学。": "There are mothers and fathers who will lie awake after the children fall asleep and wonder how they'll make the mortgage, or pay their doctor's bills, or save enough for their child's college education.",
  "最近我参加了一个中国朋友的婚礼，新郎和新娘是大学同学，都是中文系毕业的，他们已经恋爱五年了。": "Recently I attended the wedding of a Chinese friend. The bride and groom had been classmates at university, and both graduated from the Chinese faculty. They've already been together for five years.",
  "因为有高而闭合的领子、紧身的剪裁和在笔直裙子两边的开口，旗袍有着独一无二传达端庄和性感的能力。": "With a high, closed collar, figure-hugging cut, and large slits at either side of a straight skirt, the qipao is unique in its ability to communicate both modesty and sensuousness.",
  "以前，想到城市，人们就会想到拥挤的街道、紧缺的车位、拥挤的交通、排得老长的队伍以及噪音和烟雾。": "Before now, when you thought of a city, you thought of crowded streets, parking problems, traffic jams, queues, noise and fumes.",
  "今年，爱丁堡城市为了改变它的水边地并给它增加中的人口供应一种新型的住宅区而开始十五年的重建工作。": "This year, Edinburgh began work on its fifteen-year regeneration project to transform its waterfront and provide a new kind of living area for its growing population.",
  "保险使我们意识到我们生活在一个不安全的世界中，可能会生病、面临危险、出现意外等等，我们必须要面对。": "Insurance makes us remember that the world we live in isn't completely safe; we might fall ill, face danger or encounter the unexpected.",
  "我们需要开发新的能源、创造新的工作岗位，我们需要修建新学校，应对众多威胁、修复与许多国家的盟友关系。": "There's new energy to harness, new jobs to be created, new schools to build, and threats to meet, alliances to repair.",
  "但是，相对于城镇网民，农村网民对网络新闻、搜索引擎、网络购物、网上银行和网上炒股等应用程度要低很多。": "However, compared to that in cities, rural use of online news, search engines, online shopping, online banking, online stocks and so on is much lower.",
  "已经过去了很长时间，但是今晚，由于我们今天在这场选举所采取的行动，在这个决定性的时候，变革来到了美国。": "It's been a long time coming; but tonight, because of what we did on this day, in this election, at this defining moment, change has come to America.",
  "今日在德国，反暴力集会着落到了德国的很多城市，包括周一在汉堡附近一场纵火袭击中3名突厥人被杀害的地方。": "In Germany today, anti-violence rallies took place in several cities, including one near Hamburg where three Turks were killed in an arson attack on Monday.",
  "一件传统式样的旗袍是完全手工制作的，也需要劳动密集的裁缝业技术，为了增加而显示每种独一无二的女性体态。": "A qipao in the traditional style is made entirely by hand and requires labour-intensive manual tailoring techniques to enhance and exhibit every unique female form.",
  "因为有些公司对待雇员和顾客的态度可以随时影响它们的股价，所以对公司的成功或失败不可避免地有巨大的影响。": "For some companies their treatment of their employees or clients at any given time could affect their share prices and so inevitably have a great influence on the company’s success or failure.",
  "最初的旗袍遮住了女性身体的大部分，只露出头部、手和脚趾头，为的是无论穿戴者的年龄如何,都能隐藏她的身材。": "The original qipao covered most of a woman's body, revealing only the head, the hands and the tips of the toes, in order to conceal the figure of the wearer regardless of her age.",
  "截至二零零六年底，中国农村网民数为两千三百一十万人，这说明在六个月内共有一千四百三十万农民成为新的网民。": "By the end of 2006, the number of rural netizens in China was twenty three million one hundred thousand, showing that in six months a total of fourteen million, three hundred thousand rural Chinese got online.",
  "萨沙和马莉娅，我爱你们，我对你们的爱超出了你们的想象。你们已赢得了新的宠物狗，它将和我们一起前往新的白宫。": "Sasha and Malia! I love you both more than you can imagine. And you have earned the new puppy that's coming with us to the White House.",
  "当西班牙殖民了菲律宾时，是从墨西哥城管理它的。于是他加禄语是收到了墨西哥式西班牙语的影响，而不卡斯蒂利亚式的。": "When Spain colonized the Philippines, they were administrated by Mexico City. So it was Mexican Spanish, not Castilian Spanish, that influenced Tagalog.",
  "我们会遭遇挫折和不成功的起步。我作为总统所做的每项决定或政策，会有许多人持有异议，我们也知道，政府不能解决所有问题。": "There will be setbacks and false starts. There are many who won't agree with every decision or policy I make as president. And we know the government can't solve every problem.",
  "过年吃饺子的习俗和中国古代的计时法有关：中国古代把每一天分为十二个时段，每天开始是子时，相当于晚上11点到凌晨1点。": "The custom of eating dumplings on New Year's Eve is related to an ancient Chinese method of measuring time; in ancient China, each day was divided into twelve sections: the beginning of each day was called 'first time', which corresponds to the period from 11pm to 1am.",
  "当炸弹袭击了我们的港口、暴政威胁到全世界，她见证了一代美国人的伟大崛起，见证了一个民主国家获得拯救。是的，我们能做到。": "When the bombs fell on our harbor and tyranny threatened the world, she was there to witness a generation rise to greatness, and a democracy was saved. Yes, we can.",
  "这次跑步比赛，三十五岁以下（包括三十五岁）的人参加青年组；三十六岁到五十岁的人参加中年组；五十一岁以上的人参加老年组。": "For this race, people under the age of 35 (including 35) join the young people's group; people from 36 to 50 years old join the middle-aged group and people 51 or over join the elderly group.",
  "在这个国家，我们患难与共。让我们抵制重走老路的诱惑，避免重新回到令美国政治长期深受毒害的党派纷争、小题大作、不成熟的表现。": "In this country, we rise or fall as one nation, as one people. Let's resist the temptation to fall back on the same partisanship and pettiness and immaturity that has poisoned our politics for so long.",
  "这即表明的是工作气氛不但又好玩儿又放松，而且非常重视协力的成就和交流，并把传统三个小时的会议换成为排队等咖啡时非正的聊天。": "This implies a fun and relaxed working atmosphere where team achievement is highly valued, communication is extremely important and traditional 3-hour meetings have been replaced by informal chats in the queue for coffee.",
  "如果没有我过去16年最好的朋友、我们家庭的中坚、我生命中的挚爱，我今天晚上不可能站在这里，美国下一位第一夫人米歇尔-奥巴马。": "And I would not be standing here tonight without the unyielding support of my best friend for the last 16 years, the rock of our family, the love of my life, the nation's next first lady, Michelle Obama.",
  "竞选活动因为年轻人的支持而越来越有声势，他们拒绝了他们那一代对政治不感兴趣的神话，他们离开家，从事那些薪水少而且辛苦的工作。": "It drew strength from the young people who rejected the myth of their generation's apathy, who left their homes and their families for jobs that offered little pay and less sleep.",
  "就在我们今晚站在这里的时刻，我们知道勇敢的美国士兵在伊拉克的沙漠里和阿富汗的群山中醒来，他们冒着生命危险来保护着我们的生命。": "Even as we stand here tonight, we know there are brave Americans waking up in the deserts of Iraq and the mountains of Afghanistan, to risk their lives for us.",
  "林肯在向远比我们眼下分歧更大的国家发表讲话时说，我们不是敌人，而是朋友……虽然激情可能会褪去，但这不会割断我们感情上的联系。": "As Lincoln said to a nation far more divided than ours, we are not enemies but friends. Though passion may have strained, it must not break our bonds of affection.",
  "这才是美国真正的精华——美国能够改变。我们的联邦会日渐完美。我们现在已取得的成就为我们将来能够取得和必须取得的成就增添了希望。": "That's the true genius of America; that America can change. Our Union can be perfected. What we've already achieved gives us hope for what we can and must achieve tomorrow.",
  "让我们记住这一点，如果说这场金融危机教会了我们什么东西的话，那就是我们不可能在金融以外的领域处于困境的同时拥有繁荣兴旺的华尔街。": "Let us remember that if this financial crisis taught us anything, it's that we cannot have a thriving Wall Street while Main Street suffers.",
  "当30年代的沙尘暴和大萧条使人们感到绝望时，她看到一个国家用新政、新的就业机会以及对新目标的共同追求战胜恐慌。是的，我们能做到。": "When there was despair in the dust bowl and depression across the land, she saw a nation conquer fear itself with a New Deal, new jobs, a new sense of common purpose. Yes, we can.",
  "青年农民和外出务工农民是农村网民的主力军，在对诸如网络音乐、网络游戏、网络影视等互联网娱乐功能的使用上，农村网民和城镇网民相当。": "Young people and migrant workers are the bulk of rural Internet users; in terms of online music, online games, online film and television, and the Internet's capacity for entertainment, rural Internet users are equivalent to urban ones.",
  "对于那些现在没有投票给我的美国人，我想说，我可能没有赢得你们的选票，但是我听到了你们的声音，我需要你们的帮助，而且我也将是你们的总统": "And to those Americans whose support I have yet to earn, I may not have won your vote tonight, but I hear your voices. I need your help. And I will be your president, too.",
  "她出生的那个时代奴隶制度刚刚结束；那时路上没有汽车，天上也没有飞机。当时像她这样的人由于两个原因不能投票，首先她是女性，其次她是黑人。": "She was born just a generation past slavery. A time when there were no cars on the road or planes in the sky, when someone like her couldn't vote for two reasons: because she was a woman, and because of the color of her skin.",
  "我的首席策略师大卫-艾克斯罗德，他一直是追随我的伙伴。你们组建了政治史上最好的竞选团队，是你们成就了今天，我永远感谢你们为此所作出的牺牲。": "To my chief strategist, David Axelrod, who's been a partner with me every step of the way. To the best campaign team ever assembled in the history of politics! You made this happen, and I am forever grateful for what you've sacrificed to get it done.",
  "水边地工程的成功可能代表其他城市快要跟着它而创造给人们供应新型城市生活的地区，有着城市中心所有的优点，而且没有压力，响声，污染等这种缺点。": "The Waterfront's success could mean that other cities soon follow, creating areas that offer people a new kind of city living, with all the benefits and none of the stress, noise and pollution of crowded centres.",
  "前方的道路将很漫长，我们攀登的脚步会很艰辛。我们可能无法在一年甚至一个任期内实现这些目标，但我从未像今晚这样满怀希望，我们将实现我们的目标。": "The road ahead will be long. Our climb will be steep. We may not get there in one year or even in one term. But, America, I have never been more hopeful than I am tonight that we WILL get there.",
  "鸟的家在森林， 鱼的家在江河， 蜜蜂的家在花朵， 小朋友的家在中国。 我们从小爱祖国， 就像鸟儿爱森林， 就像鱼儿爱江河， 就像蜜蜂爱花朵。": "The birds' home is in the forest, the fish's home is in the river, the bees' home is in the flowers, and the little children's is in China. We love our motherland from the time we're little, as the birds love the forest, the fish love the river, and the bees love the flowers.",
  "今年，在这场选举中，她用手指触摸屏幕投下自己的选票，因为在美国生活了106年之后，经历了最好的时光和最黑暗的时刻之后，她知道美国如何能够发生变革。": "And this year, in this election, she touched her finger to a screen, and cast her vote; because after 106 years in America, through the best of times and the darkest of hours, she knows how America can change.",
  "通过创造一个更像家乡并有许多绿色植物和社区建筑物的城市地区，住在城市里快要代表想到在爱丁堡水边地生活，工作也娱乐的两万个人会有更简单、没有压力生活方式。": "With the creation of a city area that's more like a town, with plenty of greenery and community buildings, living in the city will soon mean simpler, stress-free lifestyles for the 20,000 that are expected to live, work and play in Edinburgh's Waterfront.",
  "妇女当时没有投票权，她们的希望被挫败，但是安-尼克松-库波尔活着看到妇女们站了起来，看到她们站出来发表自己的见解，看到她们参加大选投票。是的，我们能做到。": "At a time when women's voices were silenced and their hopes dismissed, she lived to see them stand up and speak out and reach for the ballot. Yes, we can.",
  "今天晚上，我想到了她在美国过去一百年间所经历的种种：心痛和希望；斗争和进步；在那里时代，我们被告知我们办不到，一些人继续坚信着美国的信念——是的，我们能做到。": "And tonight, I think about all that she's seen throughout her century in America. The heartache and the hope, the struggle and the progress. The times we were told that we can't, and the people who pressed on with that American creed: Yes, we can.",
  "对于那些彻夜关注美国大选的海外人士，从国会到皇宫，以及在被遗忘的角落里挤在收音机旁的人们，我们的经历虽然各有不同，但是我们的命运是一样的，新的美国领导层已产生了。": "And all those watching tonight from beyond our shores, from parliaments and palaces, to those who are huddled around radios in the forgotten corners of the world, our stories are singular, but our destiny is shared, and a new dawn of American leadership is at hand.",
  "在接下来的十五年里，建筑师、计划者和社区开发企业为了把三百四十六英亩的工业荒地改变成六千五百座房子、两个购物中心、一个小艇船坞、一个学校、一个高中和公用场地都会一起工作。": "Over the next fifteen years, architects, planners and community developers will work together to transform 346 acres of industrial wasteland into 6,500 homes, two shopping centres, a marina, a primary school and college, and parkland.",
  "但我将总是会向你们坦陈我们所面临的挑战。我会听取你们的意见，尤其是存在不同意见的时候。最重要的是，我会请求你们参与重建这个国家，以美国221年来从未改变的唯一方式-一砖一瓦、同心协力。": "But I will always be honest with you about the challenges we face. I will listen to you, especially when we disagree. And above all, I will ask you to join in the work of remaking this nation, the only way it's been done in America for 221 years; block by block, brick by brick, calloused hand by calloused hand.",
  "这次大选创造了多项第一，也诞生了很多将世代流传的故事。但是今天晚上令我难忘的却是在亚特兰大投票的一名妇女：安-尼克松-库波尔。她和其他数百万排队等待投票的选民没有什么差别，除了一点：她已是106岁的高龄。": "This election had many firsts and many stories that will be told for generations. But one that's on my mind tonight is about a woman who cast her ballot in Atlanta. She's a lot like the millions of others who stood in line to make their voice heard in this election, except for one thing: Ann Nixon Cooper is 106 years old.",
  "美国，我们已经走过了一条漫漫长路。我们已经历了很多。但是我们仍有很多事情要做。因此今夜，请让我们自问--如果我们的孩子能够活到下个世纪；如果我的女儿有幸活得和安一样长，她们将会看到怎样的改变？我们将会取得什么样的进步。": "America, we have come so far. We have seen so much. But there is so much more to do. So tonight, let us ask ourselves, if our children should live to see the next century, if my daughters should be so lucky to live as long as Ann Nixon Cooper, what change will they see? What progress will we have made?",
  "竞选活动的声势也来自那些已不再年轻的人们，他们冒着严寒酷暑，敲开陌生人的家门进行竞选宣传；竞选声势也源自数百万的美国民众，他们充当志愿者和组织者，他们证明了在两百多年以后，民有、民治、民享的政府并未从地球上消失。这是你们的胜利。": "It drew strength from the not-so-young people who braved the bitter cold and scorching heat to knock on doors of perfect strangers, and from the millions of Americans who volunteered and organized and proved that more than two centuries later a government of the people, by the people, and for the people has not perished from the Earth.",
  "那些追求和平和安全的人们，我们支持你们。那些所有怀疑美国的灯塔能否能像以前一样明亮的人们，今天晚上我们再次证明，我们国家真正的力量并非来自我们武器的威力或财富的规模，而是来自我们理想的持久力量：民主、 自由、机会、不屈服的希望。": "To those who seek peace and security. We support you. And to all those who have wondered if America's beacon still burns as bright, tonight we proved once more that the true strength of our nation comes not from the might of our arms or the scale of our wealth, but from the enduring power of our ideals: democracy, liberty, opportunity and unyielding hope.",
  "让我们记住，是伊利诺伊州的一名男子首次将共和党的旗帜扛到了白宫。共和党是建立在自立、个人自由以及国家团结的价值观之上的。这也是我们所有人共同的价值观。虽然民主党今天晚上赢得了巨大的胜利，但我们是以谦卑的态度和弥合阻碍我们进步的分歧的决心赢得这场胜利的": "Let's remember that it was a man from this state who first carried the banner of the Republican Party to the White House, a party founded on the values of self-reliance and individual liberty and national unity. Those are values that we all share. And while the Democratic Party has won a great victory tonight, we do so with a measure of humility and determination to heal the divides that have held back our progress.",
  "我从来不是最有可能获得这一职务的候选人。我们刚开始并没有太多资金，也没有得到许多人的支持。我们的竞选活动并非始自华盛顿的大厅里，而是始于得梅因、康科德、查尔斯顿这些地方的普通民众家中。那些辛勤工作的人们从自己微薄的储蓄中捐出5美元、10美元、20美元。": "I was never the likeliest candidate for this office. We didn't start with much money or many endorsements. Our campaign was not hatched in the halls of Washington. It began in the backyards of Des Moines, and the living rooms of Concord, and the front porches of Charleston. It was built by working men and women who dug into what little savings they had to give $5 and $10 and $20 to the cause.",
  "我知道你们的所做的一切并不只是为了赢得选举，我也知道你们做这一切并不是为了我。你们这样做是因为你们明白前面的任务有多么艰巨。即便我们今晚欢呼庆祝，我们也知道明天将面临我们一生之中最艰难的挑战——两场战争、一个面临危险的星球，一个世纪以来最严重的金融危机。": "And I know you didn't do this just to win an election. And I know you didn't do it for me. You did it because you understand the enormity of the task that lies ahead. For even as we celebrate tonight, we know the challenges that tomorrow will bring are the greatest of our lifetime: two wars, a planet in peril, the worst financial crisis in a century.",
  "尽管她没能和我们在一起，但我知道，我的祖母和养大我的家人在看着我，我今晚很想念他们，我知道我欠他们的东西是无法计量的。我的妹妹马娅、我的姐姐奥玛，我其他的兄弟和姐妹，非常感谢你们对我的支持，我感谢他们。我的妹妹马娅、我的姐姐奥玛，我其他的兄弟和姐妹，非常感谢你们对我的支持，我感谢他们。": "And while she's no longer with us, I know my grandmother's watching, along with the family that made me who I am. I miss them tonight. I know that my debt to them is beyond measure. To my sister Maya, my sister Alma, all my other brothers and sisters, thank you so much for all the support that you've given me. I'm grateful to them.",
  "21个月前在寒冬所开始的一切不应当在今天这个秋夜结束。今天的选举胜利并不是我们所寻求的改变--这只是我们进行改变的机会。如果我们仍然按照过去的方式行事，我们所寻求的改变将不会发生。没有你们，没有服务和牺牲的新精神，就不可能发生改变。因此，让我们发扬新的爱国和负责精神，所有的人都下定决心参与其中，更加努力地工作，不仅是为自己而是为彼此。": "What began 21 months ago in the depths of winter cannot end on this autumn night. This victory alone is not the change we seek. It is only the chance for us to make that change. And that cannot happen if we go back to the way things were. It can't happen without you, without a new spirit of service, a new spirit of sacrifice. So let us summon a new spirit of patriotism, of responsibility, where each of us resolves to pitch in and work harder and look after not only ourselves but each other."
}
